[NoCoverage] StringLiteral
helpers/validator/form/changePassword.ts:5:58
 import i18n from '@/i18n';
 
 export const validatorChangePasswordForm = {
-  oldPassword: validator.password({ min: 6, name: i18n.t('Old password') }),
+  oldPassword: validator.password({ min: 6, name: i18n.t("") }),
   newPassword: validator.password({ min: 6, name: i18n.t('New password') }),
 };

[NoCoverage] ObjectLiteral
helpers/validator/form/changePassword.ts:6:35
 
 export const validatorChangePasswordForm = {
   oldPassword: validator.password({ min: 6, name: i18n.t('Old password') }),
-  newPassword: validator.password({ min: 6, name: i18n.t('New password') }),
+  newPassword: validator.password({}),
 };
 
