[NoCoverage] BlockStatement
src/components/CardContextMenu/index.tsx:90:41
 
   const menuButtonRef = useRef<any>();
 
-  const handleUploadFiles = async () => {
-    const openedFiles = await openFiles('*', true);
-    dispatch(CommentsActions.effects.create({
-      todoId: todoId!,
-      text: '',
-      files: openedFiles,
-    }));
-  };
+  const handleUploadFiles = async () => {};
 
   const handleMenuButtonClick = (action: EnumCardActions, payload?: any) => {
