[NoCoverage] ObjectLiteral
helpers/validator/form/login.ts:5:32
 
 export const validatorLoginForm = ({
   email: validator.email({ max: 64 }),
-  password: validator.password({ min: 6, max: 36 }),
+  password: validator.password({}),
 });
 
