[NoCoverage] BlockStatement
src/components/CardPopup/index.tsx:109:19
     }));
   };
 
-  useEffect(() => {
-    if (activeTodo && activeTodo.columnId === columnId) {
-      setTitleValue(activeTodo.title);
-      setDescriptionValue(activeTodo.description);
-      dispatch(CommentsActions.effects.fetchByTodoId({ todoId: activeTodo.id }));
-      dispatch(CommentAttachmentsActions.fetchByTodoId({ todoId: activeTodo.id }));
-    }
-  }, [activeTodo]);
+  useEffect(() => {}, [activeTodo]);
 
   useEffect(() => {

[NoCoverage] ObjectLiteral
src/components/CardPopup/index.tsx:114:56
       setTitleValue(activeTodo.title);
       setDescriptionValue(activeTodo.description);
       dispatch(CommentsActions.effects.fetchByTodoId({ todoId: activeTodo.id }));
-      dispatch(CommentAttachmentsActions.fetchByTodoId({ todoId: activeTodo.id }));
+      dispatch(CommentAttachmentsActions.fetchByTodoId({}));
     }
   }, [activeTodo]);
