[NoCoverage] BlockStatement
src/components/CommentForm/index.tsx:70:35
     }
   }, [commentForReply, commentForEdit]);
 
-  const handleSendComment = () => {
-    if (editCommentId) {
-      dispatch(CommentsActions.effects.updateText({
-        id: editCommentId,
-        text: commentText,
-      }));
-      if (files) {
-        dispatch(CommentAttachmentsActions.uploadFiles({
-          commentId: editCommentId,
-          files,
-        }));
-      }
-      dispatch(SystemActions.setEditCommentId(null));
-    } else if (files?.length || commentText) {
-      dispatch(CommentsActions.effects.create({
-        todoId: todoId!,
-        text: commentText,
-        replyCommentId: replyCommentId || undefined,
-        files,
-      }));
-      dispatch(SystemActions.setReplyCommentId(null));
-    }
-    setFiles(null);
-    setCommentText('');
-  };
+  const handleSendComment = () => {};
 
   const handleChange = (event: React.BaseSyntheticEvent) => {

[NoCoverage] BlockStatement
src/components/CommentForm/index.tsx:83:46
         }));
       }
       dispatch(SystemActions.setEditCommentId(null));
-    } else if (files?.length || commentText) {
-      dispatch(CommentsActions.effects.create({
-        todoId: todoId!,
-        text: commentText,
-        replyCommentId: replyCommentId || undefined,
-        files,
-      }));
-      dispatch(SystemActions.setReplyCommentId(null));
-    }
+    } else if (files?.length || commentText) {}
     setFiles(null);
     setCommentText('');
