[NoCoverage] StringLiteral
pages/auth/Login/index.tsx:20:10
 }
 
 const initialState = {
-  email: '',
+  email: "Stryker was here!",
   password: '',
 };

[NoCoverage] StringLiteral
pages/auth/Login/index.tsx:67:12
         modificator="primary"
         isMaxWidth
       >
-        {t('Sign In')}
+        {t("")}
       </Button>
       <Button

[NoCoverage] StringLiteral
pages/auth/Login/index.tsx:80:12
         to="/auth/reset"
         className="link"
       >
-        {t('Forgot your password?')}
+        {t("")}
       </Link>
       <div>

[NoCoverage] StringLiteral
pages/auth/Login/index.tsx:84:14
       </Link>
       <div>
         <span className="text">
-          {t('New to Verticals?')}
+          {t("")}
           &nbsp;
         </span>
