[NoCoverage] BlockStatement
src/store/sagas/comments.ts:123:33
   }
 }
 
-export function* watchComment() {
-  yield all([
-    takeLatest(CommentsActions.effects.fetchByTodoId, fetchByTodoIdWorker),
-    takeLatest(CommentsActions.effects.create, createWorker),
-    takeLatest(CommentsActions.effects.remove, removeWorker),
-    takeLatest(CommentsActions.effects.updateText, updateWorker),
-    takeLeading(CommentsActions.effects.addLike, addLikeWorker),
-    takeLeading(CommentsActions.effects.removeLike, removeLikeWorker),
-  ]);
-}
+export function* watchComment() {}
 
