[NoCoverage] StringLiteral
pages/auth/Register/index.tsx:26:13
   name: '',
   surname: '',
   email: '',
-  username: '',
+  username: "Stryker was here!",
   password: '',
 };

[NoCoverage] ArrayDeclaration
pages/auth/Register/index.tsx:38:23
     handleChange, handleSubmit, handleBlur, values, errors, touches,
   } = useForm<IFormValidatedState>(
     initialState,
-    useWith(dispatch, [AuthActions.signUp]),
+    useWith(dispatch, []),
     validatorRegisterForm,
   );

[NoCoverage] StringLiteral
pages/auth/Register/index.tsx:45:19
   return (
     <Form
       title={t('Hi there!')}
-      subtitle={t('Please create your account.')}
+      subtitle={t("")}
       handleSubmit={handleSubmit}
     >

[NoCoverage] StringLiteral
pages/auth/Register/index.tsx:50:24
     >
       <Input
         type="text"
-        placeholder={t('First name')}
+        placeholder={t("")}
         touched={touches.name}
         error={errors.name}

[NoCoverage] StringLiteral
pages/auth/Register/index.tsx:80:24
       />
       <Input
         type="text"
-        placeholder={t('Username')}
+        placeholder={t("")}
         touched={touches.username}
         error={errors.username}
