[NoCoverage] BooleanLiteral
src/components/ArchiveContainer/index.tsx:25:65
   const activeTodoId = useSelector(getActiveTodoId);
   const editableCardId = useSelector(getEditableCardId);
 
-  const [isOpenArchived, setIsOpenArchived] = useState<boolean>(false);
+  const [isOpenArchived, setIsOpenArchived] = useState<boolean>(true);
 
   const handleClick = () => {

[NoCoverage] BlockStatement
src/components/ArchiveContainer/index.tsx:27:29
 
   const [isOpenArchived, setIsOpenArchived] = useState<boolean>(false);
 
-  const handleClick = () => {
-    setIsOpenArchived((prev) => !prev);
-  };
+  const handleClick = () => {};
 
   return archivedTodos.length > 0 ? (

[NoCoverage] ArrowFunction
src/components/ArchiveContainer/index.tsx:28:23
   const [isOpenArchived, setIsOpenArchived] = useState<boolean>(false);
 
   const handleClick = () => {
-    setIsOpenArchived((prev) => !prev);
+    setIsOpenArchived(() => undefined);
   };
 

[NoCoverage] BooleanLiteral
src/components/ArchiveContainer/index.tsx:28:33
   const [isOpenArchived, setIsOpenArchived] = useState<boolean>(false);
 
   const handleClick = () => {
-    setIsOpenArchived((prev) => !prev);
+    setIsOpenArchived((prev) => prev);
   };
 

[NoCoverage] EqualityOperator
src/components/ArchiveContainer/index.tsx:31:10
     setIsOpenArchived((prev) => !prev);
   };
 
-  return archivedTodos.length > 0 ? (
+  return archivedTodos.length <= 0 ? (
     <div className="archive-container">
       <div

[NoCoverage] EqualityOperator
src/components/ArchiveContainer/index.tsx:31:10
     setIsOpenArchived((prev) => !prev);
   };
 
-  return archivedTodos.length > 0 ? (
+  return archivedTodos.length >= 0 ? (
     <div className="archive-container">
       <div

[NoCoverage] StringLiteral
src/components/ArchiveContainer/index.tsx:37:68
         className="archive-container__title"
         onClick={handleClick}
       >
-        <img src={`/assets/svg/menu/archive${isOpenArchived ? '' : '-close'}.svg`} alt="archive" />
+        <img src={`/assets/svg/menu/archive${isOpenArchived ? '' : ""}.svg`} alt="archive" />
         {t('{{count}} cards archived', { count: archivedTodos.length })}
       </div>

[NoCoverage] StringLiteral
src/components/ArchiveContainer/index.tsx:38:12
         onClick={handleClick}
       >
         <img src={`/assets/svg/menu/archive${isOpenArchived ? '' : '-close'}.svg`} alt="archive" />
-        {t('{{count}} cards archived', { count: archivedTodos.length })}
+        {t("", { count: archivedTodos.length })}
       </div>
       {

[NoCoverage] ObjectLiteral
src/components/ArchiveContainer/index.tsx:38:40
         onClick={handleClick}
       >
         <img src={`/assets/svg/menu/archive${isOpenArchived ? '' : '-close'}.svg`} alt="archive" />
-        {t('{{count}} cards archived', { count: archivedTodos.length })}
+        {t('{{count}} cards archived', {})}
       </div>
       {

[NoCoverage] ArrowFunction
src/components/ArchiveContainer/index.tsx:45:30
       <div className="archive-container__inner">
         <Divider verticalSpacer={0} horizontalSpacer={0} style={{ marginBottom: 10 }} />
         {
-          archivedTodos?.map((todo) => (
-            <Card
-              key={todo.id}
-              todoId={todo.id}
-              columnId={todo.columnId}
-              cardType={cardType}
-              title={todo.title}
-              description={todo.description}
-              status={todo.status}
-              color={todo.color}
-              isArchived={todo.isArchived}
-              isNotificationsEnabled={todo.isNotificationsEnabled}
-              isRemoved={todo.isRemoved}
-              expirationDate={todo.expirationDate}
-              commentsCount={todo.commentsCount}
-              imagesCount={todo.imagesCount}
-              attachmentsCount={todo.attachmentsCount}
-              isActive={todo.id === activeTodoId}
-              isEditable={todo.id === editableCardId}
-              invertColor
-            />
-          ))
+          archivedTodos?.map(() => undefined)
         }
       </div>

[NoCoverage] EqualityOperator
src/components/ArchiveContainer/index.tsx:62:25
               commentsCount={todo.commentsCount}
               imagesCount={todo.imagesCount}
               attachmentsCount={todo.attachmentsCount}
-              isActive={todo.id === activeTodoId}
+              isActive={todo.id !== activeTodoId}
               isEditable={todo.id === editableCardId}
               invertColor

[NoCoverage] ConditionalExpression
src/components/ArchiveContainer/index.tsx:62:25
               commentsCount={todo.commentsCount}
               imagesCount={todo.imagesCount}
               attachmentsCount={todo.attachmentsCount}
-              isActive={todo.id === activeTodoId}
+              isActive={false}
               isEditable={todo.id === editableCardId}
               invertColor

[NoCoverage] EqualityOperator
src/components/ArchiveContainer/index.tsx:63:27
               imagesCount={todo.imagesCount}
               attachmentsCount={todo.attachmentsCount}
               isActive={todo.id === activeTodoId}
-              isEditable={todo.id === editableCardId}
+              isEditable={todo.id !== editableCardId}
               invertColor
             />

[NoCoverage] ConditionalExpression
src/components/ArchiveContainer/index.tsx:63:27
               imagesCount={todo.imagesCount}
               attachmentsCount={todo.attachmentsCount}
               isActive={todo.id === activeTodoId}
-              isEditable={todo.id === editableCardId}
+              isEditable={true}
               invertColor
             />
