[NoCoverage] ObjectLiteral
src/components/Avatar/Avatar.stories.tsx:7:13
 
 export default {
   title: 'Avatar',
-  argTypes: {
-    userAvatarUrl: {
-      control: { type: 'text' },
-      defaultValue:
-          'https://avatars.githubusercontent.com/u/39026593?s=460&u=aa4efc89a4c0a11d316d50b0a567d8c85d09b0bf&v=4',
-    },
-    userFullName: { control: { type: 'text' }, defaultValue: 'Max Romanyuta' },
-    size: { control: { type: 'range', min: 1, max: 500 }, defaultValue: 50 },
-    borderSize: { control: { type: 'select', options: ['small', 'medium', 'large'] }, defaultValue: 'medium' },
-    onClick: { action: 'clicked' },
-  },
+  argTypes: {},
   decorators: [
     (Story: any) => (

[NoCoverage] StringLiteral
src/components/Avatar/Avatar.stories.tsx:9:24
   title: 'Avatar',
   argTypes: {
     userAvatarUrl: {
-      control: { type: 'text' },
+      control: { type: "" },
       defaultValue:
           'https://avatars.githubusercontent.com/u/39026593?s=460&u=aa4efc89a4c0a11d316d50b0a567d8c85d09b0bf&v=4',

[NoCoverage] ObjectLiteral
src/components/Avatar/Avatar.stories.tsx:13:19
       defaultValue:
           'https://avatars.githubusercontent.com/u/39026593?s=460&u=aa4efc89a4c0a11d316d50b0a567d8c85d09b0bf&v=4',
     },
-    userFullName: { control: { type: 'text' }, defaultValue: 'Max Romanyuta' },
+    userFullName: {},
     size: { control: { type: 'range', min: 1, max: 500 }, defaultValue: 50 },
     borderSize: { control: { type: 'select', options: ['small', 'medium', 'large'] }, defaultValue: 'medium' },

[NoCoverage] ObjectLiteral
src/components/Avatar/Avatar.stories.tsx:15:17
     },
     userFullName: { control: { type: 'text' }, defaultValue: 'Max Romanyuta' },
     size: { control: { type: 'range', min: 1, max: 500 }, defaultValue: 50 },
-    borderSize: { control: { type: 'select', options: ['small', 'medium', 'large'] }, defaultValue: 'medium' },
+    borderSize: {},
     onClick: { action: 'clicked' },
   },

[NoCoverage] StringLiteral
src/components/Avatar/Avatar.stories.tsx:15:101
     },
     userFullName: { control: { type: 'text' }, defaultValue: 'Max Romanyuta' },
     size: { control: { type: 'range', min: 1, max: 500 }, defaultValue: 50 },
-    borderSize: { control: { type: 'select', options: ['small', 'medium', 'large'] }, defaultValue: 'medium' },
+    borderSize: { control: { type: 'select', options: ['small', 'medium', 'large'] }, defaultValue: "" },
     onClick: { action: 'clicked' },
   },

[NoCoverage] ObjectLiteral
src/components/Avatar/Avatar.stories.tsx:16:14
     userFullName: { control: { type: 'text' }, defaultValue: 'Max Romanyuta' },
     size: { control: { type: 'range', min: 1, max: 500 }, defaultValue: 50 },
     borderSize: { control: { type: 'select', options: ['small', 'medium', 'large'] }, defaultValue: 'medium' },
-    onClick: { action: 'clicked' },
+    onClick: {},
   },
   decorators: [

[NoCoverage] StringLiteral
src/components/Avatar/Avatar.stories.tsx:16:24
     userFullName: { control: { type: 'text' }, defaultValue: 'Max Romanyuta' },
     size: { control: { type: 'range', min: 1, max: 500 }, defaultValue: 50 },
     borderSize: { control: { type: 'select', options: ['small', 'medium', 'large'] }, defaultValue: 'medium' },
-    onClick: { action: 'clicked' },
+    onClick: { action: "" },
   },
   decorators: [

[NoCoverage] ArrayDeclaration
src/components/Avatar/Avatar.stories.tsx:18:15
     borderSize: { control: { type: 'select', options: ['small', 'medium', 'large'] }, defaultValue: 'medium' },
     onClick: { action: 'clicked' },
   },
-  decorators: [
-    (Story: any) => (
-      <>
-        <ReactTooltip
-          id="tooltip"
-          place="top"
-          effect="solid"
-          multiline
-          arrowColor="transparent"
-          overridePosition={({ left, top }) => ({ left, top })}
-        />
-        <Story />
-      </>
-    ),
-  ],
+  decorators: [],
 };
 

[NoCoverage] ArrowFunction
src/components/Avatar/Avatar.stories.tsx:19:5
     onClick: { action: 'clicked' },
   },
   decorators: [
-    (Story: any) => (
-      <>
-        <ReactTooltip
-          id="tooltip"
-          place="top"
-          effect="solid"
-          multiline
-          arrowColor="transparent"
-          overridePosition={({ left, top }) => ({ left, top })}
-        />
-        <Story />
-      </>
-    ),
+    () => undefined,
   ],
 };

[NoCoverage] ArrowFunction
src/components/Avatar/Avatar.stories.tsx:35:24
   ],
 };
 
-export const Default = (args: any) => <Avatar {...args} />;
+export const Default = () => undefined;
 
