[NoCoverage] StringLiteral
verticals/src/plugins/authRefresher.ts:8:31
 
 const UNAUTHORIZED_HTTP_STATUS = 401;
 const UNAUTHORIZED_WS_CODE = 1011;
-const DEFAULT_ERROR_MESSAGE = 'Internal error';
+const DEFAULT_ERROR_MESSAGE = "";
 const REFRESH_ROUTE = '/auth/refresh';
 

[NoCoverage] StringLiteral
verticals/src/plugins/authRefresher.ts:9:23
 const UNAUTHORIZED_HTTP_STATUS = 401;
 const UNAUTHORIZED_WS_CODE = 1011;
 const DEFAULT_ERROR_MESSAGE = 'Internal error';
-const REFRESH_ROUTE = '/auth/refresh';
+const REFRESH_ROUTE = "";
 
 interface IPairTokens {

[NoCoverage] BlockStatement
verticals/src/plugins/authRefresher.ts:30:31
     private readonly retryRequest: (ctx: T) => void,
   ) {}
 
-  async refreshTokens(ctx: T) {
-    try {
-      const pairTokens = await this.getNewPairTokens();
-      AuthRefresher.setTokenData(pairTokens);
-      return this.retryRequest(ctx);
-    } catch (e) {
-      throw new Error();
-    } finally {
-      delete this.refreshRequest;
-    }
-  }
+  async refreshTokens(ctx: T) {}
 
   async websocketResponseInterceptor(event: CloseEvent, ctx: T) {

[NoCoverage] BlockStatement
verticals/src/plugins/authRefresher.ts:31:9
   ) {}
 
   async refreshTokens(ctx: T) {
-    try {
-      const pairTokens = await this.getNewPairTokens();
-      AuthRefresher.setTokenData(pairTokens);
-      return this.retryRequest(ctx);
-    } catch (e) {
+    try {} catch (e) {
       throw new Error();
     } finally {

[NoCoverage] BlockStatement
verticals/src/plugins/authRefresher.ts:35:17
       const pairTokens = await this.getNewPairTokens();
       AuthRefresher.setTokenData(pairTokens);
       return this.retryRequest(ctx);
-    } catch (e) {
-      throw new Error();
-    } finally {
+    } catch (e) {} finally {
       delete this.refreshRequest;
     }

[NoCoverage] BlockStatement
verticals/src/plugins/authRefresher.ts:37:15
       return this.retryRequest(ctx);
     } catch (e) {
       throw new Error();
-    } finally {
-      delete this.refreshRequest;
-    }
+    } finally {}
   }
 

[NoCoverage] BlockStatement
verticals/src/plugins/authRefresher.ts:42:65
     }
   }
 
-  async websocketResponseInterceptor(event: CloseEvent, ctx: T) {
-    if (event.code === UNAUTHORIZED_WS_CODE) {
-      await this.refreshTokens(ctx);
-    }
-  }
+  async websocketResponseInterceptor(event: CloseEvent, ctx: T) {}
 
   async httpResponseInterceptor(ctx: T) {

[NoCoverage] EqualityOperator
verticals/src/plugins/authRefresher.ts:43:9
   }
 
   async websocketResponseInterceptor(event: CloseEvent, ctx: T) {
-    if (event.code === UNAUTHORIZED_WS_CODE) {
+    if (event.code !== UNAUTHORIZED_WS_CODE) {
       await this.refreshTokens(ctx);
     }

[NoCoverage] ConditionalExpression
verticals/src/plugins/authRefresher.ts:43:9
   }
 
   async websocketResponseInterceptor(event: CloseEvent, ctx: T) {
-    if (event.code === UNAUTHORIZED_WS_CODE) {
+    if (false) {
       await this.refreshTokens(ctx);
     }

[NoCoverage] BlockStatement
verticals/src/plugins/authRefresher.ts:48:41
     }
   }
 
-  async httpResponseInterceptor(ctx: T) {
-    const error = ctx as IAxiosErrorRetry;
-    try {
-      if (AuthRefresher.shouldRetry(error)) {
-        return this.retryRequest(ctx);
-      }
-
-      if (!AuthRefresher.shouldRefresh(error)) {
-        throw new Error();
-      }
-
-      return await this.refreshTokens(ctx);
-    } catch (e) {
-      const errorMessage = error?.response?.data?.message || DEFAULT_ERROR_MESSAGE;
-      return Promise.reject(errorMessage);
-    }
-  }
+  async httpResponseInterceptor(ctx: T) {}
 
   private async getNewPairTokens() {

[NoCoverage] BlockStatement
verticals/src/plugins/authRefresher.ts:50:9
 
   async httpResponseInterceptor(ctx: T) {
     const error = ctx as IAxiosErrorRetry;
-    try {
-      if (AuthRefresher.shouldRetry(error)) {
-        return this.retryRequest(ctx);
-      }
-
-      if (!AuthRefresher.shouldRefresh(error)) {
-        throw new Error();
-      }
-
-      return await this.refreshTokens(ctx);
-    } catch (e) {
+    try {} catch (e) {
       const errorMessage = error?.response?.data?.message || DEFAULT_ERROR_MESSAGE;
       return Promise.reject(errorMessage);

[NoCoverage] ConditionalExpression
verticals/src/plugins/authRefresher.ts:51:11
   async httpResponseInterceptor(ctx: T) {
     const error = ctx as IAxiosErrorRetry;
     try {
-      if (AuthRefresher.shouldRetry(error)) {
+      if (false) {
         return this.retryRequest(ctx);
       }

[NoCoverage] ConditionalExpression
verticals/src/plugins/authRefresher.ts:51:11
   async httpResponseInterceptor(ctx: T) {
     const error = ctx as IAxiosErrorRetry;
     try {
-      if (AuthRefresher.shouldRetry(error)) {
+      if (true) {
         return this.retryRequest(ctx);
       }

[NoCoverage] ConditionalExpression
verticals/src/plugins/authRefresher.ts:55:11
         return this.retryRequest(ctx);
       }
 
-      if (!AuthRefresher.shouldRefresh(error)) {
+      if (true) {
         throw new Error();
       }

[NoCoverage] BooleanLiteral
verticals/src/plugins/authRefresher.ts:55:11
         return this.retryRequest(ctx);
       }
 
-      if (!AuthRefresher.shouldRefresh(error)) {
+      if (AuthRefresher.shouldRefresh(error)) {
         throw new Error();
       }

[NoCoverage] BlockStatement
verticals/src/plugins/authRefresher.ts:60:17
       }
 
       return await this.refreshTokens(ctx);
-    } catch (e) {
-      const errorMessage = error?.response?.data?.message || DEFAULT_ERROR_MESSAGE;
-      return Promise.reject(errorMessage);
-    }
+    } catch (e) {}
   }
 

[NoCoverage] ConditionalExpression
verticals/src/plugins/authRefresher.ts:61:28
 
       return await this.refreshTokens(ctx);
     } catch (e) {
-      const errorMessage = error?.response?.data?.message || DEFAULT_ERROR_MESSAGE;
+      const errorMessage = true;
       return Promise.reject(errorMessage);
     }

[NoCoverage] ConditionalExpression
verticals/src/plugins/authRefresher.ts:61:28
 
       return await this.refreshTokens(ctx);
     } catch (e) {
-      const errorMessage = error?.response?.data?.message || DEFAULT_ERROR_MESSAGE;
+      const errorMessage = false;
       return Promise.reject(errorMessage);
     }

[NoCoverage] BlockStatement
verticals/src/plugins/authRefresher.ts:66:36
     }
   }
 
-  private async getNewPairTokens() {
-    const refreshToken = storage.getRefreshToken();
-
-    if (!this.refreshRequest) {
-      this.refreshRequest = this.httpClient.post(REFRESH_ROUTE, { refreshToken });
-    }
-
-    const { data } = await this.refreshRequest;
-    return data;
-  }
+  private async getNewPairTokens() {}
 
   private static setTokenData(pairTokens: IPairTokens) {

[NoCoverage] ConditionalExpression
verticals/src/plugins/authRefresher.ts:69:9
   private async getNewPairTokens() {
     const refreshToken = storage.getRefreshToken();
 
-    if (!this.refreshRequest) {
+    if (false) {
       this.refreshRequest = this.httpClient.post(REFRESH_ROUTE, { refreshToken });
     }

[NoCoverage] ConditionalExpression
verticals/src/plugins/authRefresher.ts:69:9
   private async getNewPairTokens() {
     const refreshToken = storage.getRefreshToken();
 
-    if (!this.refreshRequest) {
+    if (true) {
       this.refreshRequest = this.httpClient.post(REFRESH_ROUTE, { refreshToken });
     }

[NoCoverage] ObjectLiteral
verticals/src/plugins/authRefresher.ts:70:65
     const refreshToken = storage.getRefreshToken();
 
     if (!this.refreshRequest) {
-      this.refreshRequest = this.httpClient.post(REFRESH_ROUTE, { refreshToken });
+      this.refreshRequest = this.httpClient.post(REFRESH_ROUTE, {});
     }
 

[NoCoverage] BlockStatement
verticals/src/plugins/authRefresher.ts:77:56
     return data;
   }
 
-  private static setTokenData(pairTokens: IPairTokens) {
-    const { token, refreshToken } = pairTokens;
-    storage.setToken(token);
-    storage.setRefreshToken(refreshToken);
-  }
+  private static setTokenData(pairTokens: IPairTokens) {}
 
   private static shouldRetry(error: IAxiosErrorRetry) {

[NoCoverage] BlockStatement
verticals/src/plugins/authRefresher.ts:83:55
     storage.setRefreshToken(refreshToken);
   }
 
-  private static shouldRetry(error: IAxiosErrorRetry) {
-    const token = storage.getToken();
-
-    if (!token) {
-      return false;
-    }
-    if (!error.response) {
-      return false;
-    }
-    const rejectedToken = error?.response?.config?.headers?.Authorization?.replace(process.env.AUTH_PREFIX, '');
-    return rejectedToken !== token;
-  }
+  private static shouldRetry(error: IAxiosErrorRetry) {}
 
   private static shouldRefresh(error: IAxiosErrorRetry) {

[NoCoverage] BlockStatement
verticals/src/plugins/authRefresher.ts:86:17
   private static shouldRetry(error: IAxiosErrorRetry) {
     const token = storage.getToken();
 
-    if (!token) {
-      return false;
-    }
+    if (!token) {}
     if (!error.response) {
       return false;

[NoCoverage] BooleanLiteral
verticals/src/plugins/authRefresher.ts:87:14
     const token = storage.getToken();
 
     if (!token) {
-      return false;
+      return true;
     }
     if (!error.response) {

[NoCoverage] ConditionalExpression
verticals/src/plugins/authRefresher.ts:89:9
     if (!token) {
       return false;
     }
-    if (!error.response) {
+    if (true) {
       return false;
     }

[NoCoverage] BooleanLiteral
verticals/src/plugins/authRefresher.ts:89:9
     if (!token) {
       return false;
     }
-    if (!error.response) {
+    if (error.response) {
       return false;
     }

[NoCoverage] BooleanLiteral
verticals/src/plugins/authRefresher.ts:90:14
       return false;
     }
     if (!error.response) {
-      return false;
+      return true;
     }
     const rejectedToken = error?.response?.config?.headers?.Authorization?.replace(process.env.AUTH_PREFIX, '');

[NoCoverage] ConditionalExpression
verticals/src/plugins/authRefresher.ts:93:12
       return false;
     }
     const rejectedToken = error?.response?.config?.headers?.Authorization?.replace(process.env.AUTH_PREFIX, '');
-    return rejectedToken !== token;
+    return true;
   }
 

[NoCoverage] EqualityOperator
verticals/src/plugins/authRefresher.ts:93:12
       return false;
     }
     const rejectedToken = error?.response?.config?.headers?.Authorization?.replace(process.env.AUTH_PREFIX, '');
-    return rejectedToken !== token;
+    return rejectedToken === token;
   }
 

[NoCoverage] BlockStatement
verticals/src/plugins/authRefresher.ts:96:57
     return rejectedToken !== token;
   }
 
-  private static shouldRefresh(error: IAxiosErrorRetry) {
-    try {
-      return error.response?.status === UNAUTHORIZED_HTTP_STATUS && !error.config.retry;
-    } catch (e) {
-      return false;
-    }
-  }
+  private static shouldRefresh(error: IAxiosErrorRetry) {}
 }
 

[NoCoverage] BlockStatement
verticals/src/plugins/authRefresher.ts:97:9
   }
 
   private static shouldRefresh(error: IAxiosErrorRetry) {
-    try {
-      return error.response?.status === UNAUTHORIZED_HTTP_STATUS && !error.config.retry;
-    } catch (e) {
+    try {} catch (e) {
       return false;
     }

[NoCoverage] EqualityOperator
verticals/src/plugins/authRefresher.ts:98:14
 
   private static shouldRefresh(error: IAxiosErrorRetry) {
     try {
-      return error.response?.status === UNAUTHORIZED_HTTP_STATUS && !error.config.retry;
+      return error.response?.status !== UNAUTHORIZED_HTTP_STATUS && !error.config.retry;
     } catch (e) {
       return false;

[NoCoverage] BooleanLiteral
verticals/src/plugins/authRefresher.ts:98:69
 
   private static shouldRefresh(error: IAxiosErrorRetry) {
     try {
-      return error.response?.status === UNAUTHORIZED_HTTP_STATUS && !error.config.retry;
+      return error.response?.status === UNAUTHORIZED_HTTP_STATUS && error.config.retry;
     } catch (e) {
       return false;

[NoCoverage] BlockStatement
verticals/src/plugins/authRefresher.ts:99:17
   private static shouldRefresh(error: IAxiosErrorRetry) {
     try {
       return error.response?.status === UNAUTHORIZED_HTTP_STATUS && !error.config.retry;
-    } catch (e) {
-      return false;
-    }
+    } catch (e) {}
   }
 }
