[NoCoverage] BooleanLiteral
src/components/Board/index.tsx:51:14
   title = '',
   description = '',
   isEditable,
-  isActive = false,
+  isActive = true,
   onClick,
   scrollToBottom,

[NoCoverage] BooleanLiteral
src/components/Board/index.tsx:65:51
 
   const isSearchMode = useSelector(getIsSearchMode);
 
-  const [isHover, setIsHover] = useState<boolean>(false);
+  const [isHover, setIsHover] = useState<boolean>(true);
   const [titleValue, setTitleValue] = useEffectState<string>(title);
   const [descriptionValue, setDescriptionValue] = useEffectState<string>(description);

[NoCoverage] BooleanLiteral
src/components/Board/index.tsx:74:9
   useFocus(titleInputRef, [isEditable]);
 
   const saveBoard = () => {
-    if (!isEditable) return;
+    if (isEditable) return;
     const normalizedTitleValue = titleValue.trim();
     const normalizedDescriptionValue = descriptionValue?.trim();

[NoCoverage] ConditionalExpression
src/components/Board/index.tsx:74:9
   useFocus(titleInputRef, [isEditable]);
 
   const saveBoard = () => {
-    if (!isEditable) return;
+    if (true) return;
     const normalizedTitleValue = titleValue.trim();
     const normalizedDescriptionValue = descriptionValue?.trim();

[NoCoverage] EqualityOperator
src/components/Board/index.tsx:78:9
     const normalizedTitleValue = titleValue.trim();
     const normalizedDescriptionValue = descriptionValue?.trim();
 
-    if (boardId !== NEW_BOARD_ID && belowId === undefined) {
+    if (boardId === NEW_BOARD_ID && belowId === undefined) {
       const isNew = isNewValues([title, normalizedTitleValue], [description, normalizedDescriptionValue]);
       if (normalizedTitleValue && isNew) {

[NoCoverage] EqualityOperator
src/components/Board/index.tsx:78:37
     const normalizedTitleValue = titleValue.trim();
     const normalizedDescriptionValue = descriptionValue?.trim();
 
-    if (boardId !== NEW_BOARD_ID && belowId === undefined) {
+    if (boardId !== NEW_BOARD_ID && belowId !== undefined) {
       const isNew = isNewValues([title, normalizedTitleValue], [description, normalizedDescriptionValue]);
       if (normalizedTitleValue && isNew) {

[NoCoverage] BlockStatement
src/components/Board/index.tsx:80:42
 
     if (boardId !== NEW_BOARD_ID && belowId === undefined) {
       const isNew = isNewValues([title, normalizedTitleValue], [description, normalizedDescriptionValue]);
-      if (normalizedTitleValue && isNew) {
-        dispatch(BoardsActions.effect.update({
-          id: boardId,
-          title: normalizedTitleValue,
-          description: normalizedDescriptionValue,
-        }));
-      } else {
+      if (normalizedTitleValue && isNew) {} else {
         setTitleValue(title);
         setDescriptionValue(description);

[NoCoverage] ConditionalExpression
src/components/Board/index.tsx:80:11
 
     if (boardId !== NEW_BOARD_ID && belowId === undefined) {
       const isNew = isNewValues([title, normalizedTitleValue], [description, normalizedDescriptionValue]);
-      if (normalizedTitleValue && isNew) {
+      if (true) {
         dispatch(BoardsActions.effect.update({
           id: boardId,

[NoCoverage] BlockStatement
src/components/Board/index.tsx:86:14
           title: normalizedTitleValue,
           description: normalizedDescriptionValue,
         }));
-      } else {
-        setTitleValue(title);
-        setDescriptionValue(description);
-      }
+      } else {}
       dispatch(SystemActions.setEditableBoardId(null));
     } else {

[NoCoverage] BlockStatement
src/components/Board/index.tsx:91:12
         setDescriptionValue(description);
       }
       dispatch(SystemActions.setEditableBoardId(null));
-    } else {
-      if (normalizedTitleValue) {
-        dispatch(BoardsActions.effect.create({
-          icon: '/assets/svg/board/item.svg',
-          title: normalizedTitleValue,
-          description: normalizedDescriptionValue,
-          cardType: EnumTodoType.Checkboxes,
-          belowId,
-        }));
-      } else {
-        dispatch(SystemActions.setEditableBoardId(null));
-      }
-      if (belowId !== undefined) {
-        dispatch(SystemActions.setEditableBoardId(null));
-      } else {
-        setTitleValue('');
-        setDescriptionValue('');
-        setTimeout(() => {
-          scrollToBottom?.();
-        }, 200);
-      }
-    }
+    } else {}
   };
 

[NoCoverage] ConditionalExpression
src/components/Board/index.tsx:92:11
       }
       dispatch(SystemActions.setEditableBoardId(null));
     } else {
-      if (normalizedTitleValue) {
+      if (false) {
         dispatch(BoardsActions.effect.create({
           icon: '/assets/svg/board/item.svg',

[NoCoverage] ConditionalExpression
src/components/Board/index.tsx:92:11
       }
       dispatch(SystemActions.setEditableBoardId(null));
     } else {
-      if (normalizedTitleValue) {
+      if (true) {
         dispatch(BoardsActions.effect.create({
           icon: '/assets/svg/board/item.svg',

[NoCoverage] ObjectLiteral
src/components/Board/index.tsx:93:46
       dispatch(SystemActions.setEditableBoardId(null));
     } else {
       if (normalizedTitleValue) {
-        dispatch(BoardsActions.effect.create({
-          icon: '/assets/svg/board/item.svg',
-          title: normalizedTitleValue,
-          description: normalizedDescriptionValue,
-          cardType: EnumTodoType.Checkboxes,
-          belowId,
-        }));
+        dispatch(BoardsActions.effect.create({}));
       } else {
         dispatch(SystemActions.setEditableBoardId(null));

[NoCoverage] BlockStatement
src/components/Board/index.tsx:100:14
           cardType: EnumTodoType.Checkboxes,
           belowId,
         }));
-      } else {
-        dispatch(SystemActions.setEditableBoardId(null));
-      }
+      } else {}
       if (belowId !== undefined) {
         dispatch(SystemActions.setEditableBoardId(null));

[NoCoverage] EqualityOperator
src/components/Board/index.tsx:103:11
       } else {
         dispatch(SystemActions.setEditableBoardId(null));
       }
-      if (belowId !== undefined) {
+      if (belowId === undefined) {
         dispatch(SystemActions.setEditableBoardId(null));
       } else {

[NoCoverage] BlockStatement
src/components/Board/index.tsx:103:34
       } else {
         dispatch(SystemActions.setEditableBoardId(null));
       }
-      if (belowId !== undefined) {
-        dispatch(SystemActions.setEditableBoardId(null));
-      } else {
+      if (belowId !== undefined) {} else {
         setTitleValue('');
         setDescriptionValue('');

[NoCoverage] BlockStatement
src/components/Board/index.tsx:105:14
       }
       if (belowId !== undefined) {
         dispatch(SystemActions.setEditableBoardId(null));
-      } else {
-        setTitleValue('');
-        setDescriptionValue('');
-        setTimeout(() => {
-          scrollToBottom?.();
-        }, 200);
-      }
+      } else {}
     }
   };

[NoCoverage] StringLiteral
src/components/Board/index.tsx:106:23
       if (belowId !== undefined) {
         dispatch(SystemActions.setEditableBoardId(null));
       } else {
-        setTitleValue('');
+        setTitleValue("Stryker was here!");
         setDescriptionValue('');
         setTimeout(() => {

[NoCoverage] BlockStatement
src/components/Board/index.tsx:108:26
       } else {
         setTitleValue('');
         setDescriptionValue('');
-        setTimeout(() => {
-          scrollToBottom?.();
-        }, 200);
+        setTimeout(() => {}, 200);
       }
     }

[NoCoverage] BlockStatement
src/components/Board/index.tsx:115:41
     }
   };
 
-  const handleKeyDown = (event: any) => {
-    const { key, ctrlKey, shiftKey } = event;
-    if (key === 'Enter' && !ctrlKey && !shiftKey) {
-      saveBoard();
-    }
-  };
+  const handleKeyDown = (event: any) => {};
 
   const handleChange = (event: any, isDescription: boolean) => {

[NoCoverage] LogicalOperator
src/components/Board/index.tsx:117:9
 
   const handleKeyDown = (event: any) => {
     const { key, ctrlKey, shiftKey } = event;
-    if (key === 'Enter' && !ctrlKey && !shiftKey) {
+    if (key === 'Enter' || !ctrlKey && !shiftKey) {
       saveBoard();
     }

[NoCoverage] BooleanLiteral
src/components/Board/index.tsx:117:28
 
   const handleKeyDown = (event: any) => {
     const { key, ctrlKey, shiftKey } = event;
-    if (key === 'Enter' && !ctrlKey && !shiftKey) {
+    if (key === 'Enter' && ctrlKey && !shiftKey) {
       saveBoard();
     }

[NoCoverage] BlockStatement
src/components/Board/index.tsx:122:64
     }
   };
 
-  const handleChange = (event: any, isDescription: boolean) => {
-    const { value } = event.target;
-    return isDescription
-      ? setDescriptionValue(value)
-      : setTitleValue(value);
-  };
+  const handleChange = (event: any, isDescription: boolean) => {};
 
   const handleEsc = () => {

[NoCoverage] BlockStatement
src/components/Board/index.tsx:129:27
       : setTitleValue(value);
   };
 
-  const handleEsc = () => {
-    dispatch(SystemActions.setEditableBoardId(null));
-    saveBoard();
-  };
+  const handleEsc = () => {};
 
   const [boardRef] = useOutsideClickRef(saveBoard, isEditable);

[NoCoverage] ObjectLiteral
src/components/Board/index.tsx:136:34
 
   const [boardRef] = useOutsideClickRef(saveBoard, isEditable);
 
-  useKeys(['Escape'], handleEsc, {
-    // @ts-ignore
-    target: boardRef,
-    when: isEditable,
-  });
+  useKeys(['Escape'], handleEsc, {});
 
   const handleDoubleClickUnwrapped = () => {

[NoCoverage] ArrayDeclaration
src/components/Board/index.tsx:136:11
 
   const [boardRef] = useOutsideClickRef(saveBoard, isEditable);
 
-  useKeys(['Escape'], handleEsc, {
+  useKeys([], handleEsc, {
     // @ts-ignore
     target: boardRef,

[NoCoverage] BlockStatement
src/components/Board/index.tsx:142:44
     when: isEditable,
   });
 
-  const handleDoubleClickUnwrapped = () => {
-    dispatch(SystemActions.setEditableBoardId(boardId));
-  };
+  const handleDoubleClickUnwrapped = () => {};
 
   const handleClickUnwrapped = () => {

[NoCoverage] BlockStatement
src/components/Board/index.tsx:146:38
     dispatch(SystemActions.setEditableBoardId(boardId));
   };
 
-  const handleClickUnwrapped = () => {
-    if (!isEditable && !isActive) {
-      onClick?.(title, boardId!);
-    }
-  };
+  const handleClickUnwrapped = () => {};
 
   const {

[NoCoverage] ConditionalExpression
src/components/Board/index.tsx:147:9
   };
 
   const handleClickUnwrapped = () => {
-    if (!isEditable && !isActive) {
+    if (false) {
       onClick?.(title, boardId!);
     }

[NoCoverage] LogicalOperator
src/components/Board/index.tsx:147:9
   };
 
   const handleClickUnwrapped = () => {
-    if (!isEditable && !isActive) {
+    if (!isEditable || !isActive) {
       onClick?.(title, boardId!);
     }

[NoCoverage] BlockStatement
src/components/Board/index.tsx:157:19
     handleDoubleClick,
   } = useClickPreventionOnDoubleClick(handleClickUnwrapped, handleDoubleClickUnwrapped, isEditable);
 
-  useEffect(() => {
-    if (belowId) {
-      dispatch(SystemActions.setEditableBoardId(boardId));
-    }
-  }, []);
+  useEffect(() => {}, []);
 
   return useMemo(() => (

[NoCoverage] BlockStatement
src/components/Board/index.tsx:158:18
   } = useClickPreventionOnDoubleClick(handleClickUnwrapped, handleDoubleClickUnwrapped, isEditable);
 
   useEffect(() => {
-    if (belowId) {
-      dispatch(SystemActions.setEditableBoardId(boardId));
-    }
+    if (belowId) {}
   }, []);
 

[NoCoverage] ConditionalExpression
src/components/Board/index.tsx:158:9
   } = useClickPreventionOnDoubleClick(handleClickUnwrapped, handleDoubleClickUnwrapped, isEditable);
 
   useEffect(() => {
-    if (belowId) {
+    if (true) {
       dispatch(SystemActions.setEditableBoardId(boardId));
     }

[NoCoverage] ObjectLiteral
src/components/Board/index.tsx:166:30
   return useMemo(() => (
     <div
       ref={boardRef}
-      className={cn('board', {
-        'board--editable': isEditable,
-        'board--dragging': snapshot?.isDragging,
-        'board--active': isActive,
-      })}
+      className={cn('board', {})}
       onMouseEnter={() => setIsHover(true)}
       onMouseLeave={() => setIsHover(false)}

[NoCoverage] BooleanLiteral
src/components/Board/index.tsx:171:38
         'board--dragging': snapshot?.isDragging,
         'board--active': isActive,
       })}
-      onMouseEnter={() => setIsHover(true)}
+      onMouseEnter={() => setIsHover(false)}
       onMouseLeave={() => setIsHover(false)}
     >

[NoCoverage] ArrowFunction
src/components/Board/index.tsx:171:21
         'board--dragging': snapshot?.isDragging,
         'board--active': isActive,
       })}
-      onMouseEnter={() => setIsHover(true)}
+      onMouseEnter={() => undefined}
       onMouseLeave={() => setIsHover(false)}
     >

[NoCoverage] BooleanLiteral
src/components/Board/index.tsx:172:38
         'board--active': isActive,
       })}
       onMouseEnter={() => setIsHover(true)}
-      onMouseLeave={() => setIsHover(false)}
+      onMouseLeave={() => setIsHover(true)}
     >
       {

[NoCoverage] ArrowFunction
src/components/Board/index.tsx:172:21
         'board--active': isActive,
       })}
       onMouseEnter={() => setIsHover(true)}
-      onMouseLeave={() => setIsHover(false)}
+      onMouseLeave={() => undefined}
     >
       {

[NoCoverage] ArrowFunction
src/components/Board/index.tsx:187:27
                 minRows={1}
                 maxRows={20}
                 onKeyDown={shiftEnterRestriction}
-                onChange={(event: any) => handleChange(event, false)}
+                onChange={() => undefined}
                 onKeyDownCapture={(event: any) => handleKeyDown(event)}
               />

[NoCoverage] BooleanLiteral
src/components/Board/index.tsx:187:63
                 minRows={1}
                 maxRows={20}
                 onKeyDown={shiftEnterRestriction}
-                onChange={(event: any) => handleChange(event, false)}
+                onChange={(event: any) => handleChange(event, true)}
                 onKeyDownCapture={(event: any) => handleKeyDown(event)}
               />

[NoCoverage] ArrowFunction
src/components/Board/index.tsx:188:35
                 maxRows={20}
                 onKeyDown={shiftEnterRestriction}
                 onChange={(event: any) => handleChange(event, false)}
-                onKeyDownCapture={(event: any) => handleKeyDown(event)}
+                onKeyDownCapture={() => undefined}
               />
               <TextArea

[NoCoverage] BooleanLiteral
src/components/Board/index.tsx:197:63
                 minRows={1}
                 maxRows={20}
                 onKeyDown={shiftEnterRestriction}
-                onChange={(event: any) => handleChange(event, true)}
+                onChange={(event: any) => handleChange(event, false)}
                 onKeyDownCapture={(event: any) => handleKeyDown(event)}
               />

[NoCoverage] ArrowFunction
src/components/Board/index.tsx:197:27
                 minRows={1}
                 maxRows={20}
                 onKeyDown={shiftEnterRestriction}
-                onChange={(event: any) => handleChange(event, true)}
+                onChange={() => undefined}
                 onKeyDownCapture={(event: any) => handleKeyDown(event)}
               />

[NoCoverage] ArrowFunction
src/components/Board/index.tsx:198:35
                 maxRows={20}
                 onKeyDown={shiftEnterRestriction}
                 onChange={(event: any) => handleChange(event, true)}
-                onKeyDownCapture={(event: any) => handleKeyDown(event)}
+                onKeyDownCapture={() => undefined}
               />
             </div>

[NoCoverage] ConditionalExpression
src/components/Board/index.tsx:205:28
         ) : (
           <RoundedButton
             icon={icon}
-            isSpecialIcon={icon.includes('trash') || icon.includes('star')}
+            isSpecialIcon={true}
             text={titleValue}
             color={color}

[NoCoverage] ConditionalExpression
src/components/Board/index.tsx:205:28
         ) : (
           <RoundedButton
             icon={icon}
-            isSpecialIcon={icon.includes('trash') || icon.includes('star')}
+            isSpecialIcon={false}
             text={titleValue}
             color={color}

[NoCoverage] ConditionalExpression
src/components/Board/index.tsx:208:23
             isSpecialIcon={icon.includes('trash') || icon.includes('star')}
             text={titleValue}
             color={color}
-            isActive={isActive || snapshot?.isDragging}
+            isActive={false}
             onClick={handleClick}
             onDoubleClick={handleDoubleClick}

[NoCoverage] ConditionalExpression
src/components/Board/index.tsx:208:23
             isSpecialIcon={icon.includes('trash') || icon.includes('star')}
             text={titleValue}
             color={color}
-            isActive={isActive || snapshot?.isDragging}
+            isActive={true}
             onClick={handleClick}
             onDoubleClick={handleDoubleClick}

[NoCoverage] EqualityOperator
src/components/Board/index.tsx:214:17
           >
             { isSearchMode
               ? <BoardCounter boardId={boardId} isActive={isActive} />
-              : boardId === TRASH_BOARD_ID
+              : boardId !== TRASH_BOARD_ID
                 ? null
                 : (

[NoCoverage] ConditionalExpression
src/components/Board/index.tsx:214:17
           >
             { isSearchMode
               ? <BoardCounter boardId={boardId} isActive={isActive} />
-              : boardId === TRASH_BOARD_ID
+              : true
                 ? null
                 : (

[NoCoverage] ArrayDeclaration
src/components/Board/index.tsx:229:6
         )
       }
     </div>
-  ), [
-    t, isHover, isActive, isEditable,
-    titleValue, descriptionValue, snapshot,
-    color, icon, username, isSearchMode,
-  ]);
+  ), []);
 };
 
