[NoCoverage] BlockStatement
verticals/src/services/auth.ts:24:32
     this.httpClient = httpClient;
   }
 
-  signUp(body: ISignUpRequest) {
-    return this.httpClient.post<ISignUpResponse>('/auth/register', body);
-  }
+  signUp(body: ISignUpRequest) {}
 
   signIn(body: ISignInRequest) {

[NoCoverage] BlockStatement
verticals/src/services/auth.ts:28:32
     return this.httpClient.post<ISignUpResponse>('/auth/register', body);
   }
 
-  signIn(body: ISignInRequest) {
-    return this.httpClient.post<ISignInResponse>('/auth/login', body);
-  }
+  signIn(body: ISignInRequest) {}
 
   logout() {

[NoCoverage] BlockStatement
verticals/src/services/auth.ts:32:12
     return this.httpClient.post<ISignInResponse>('/auth/login', body);
   }
 
-  logout() {
-    return this.httpClient.post<ILogoutResponse>('/auth/logout');
-  }
+  logout() {}
 
   reset(body: IResetPasswordRequest) {

[NoCoverage] BlockStatement
verticals/src/services/auth.ts:36:38
     return this.httpClient.post<ILogoutResponse>('/auth/logout');
   }
 
-  reset(body: IResetPasswordRequest) {
-    return this.httpClient.post<IResetPasswordResponse>('/auth/reset', body);
-  }
+  reset(body: IResetPasswordRequest) {}
 
   change(body: IChangePasswordRequest) {

[NoCoverage] BlockStatement
verticals/src/services/auth.ts:40:40
     return this.httpClient.post<IResetPasswordResponse>('/auth/reset', body);
   }
 
-  change(body: IChangePasswordRequest) {
-    return this.httpClient.post<IChangePasswordResponse>('/auth/change-password', body);
-  }
+  change(body: IChangePasswordRequest) {}
 }
 

[NoCoverage] StringLiteral
verticals/src/services/auth.ts:41:58
   }
 
   change(body: IChangePasswordRequest) {
-    return this.httpClient.post<IChangePasswordResponse>('/auth/change-password', body);
+    return this.httpClient.post<IChangePasswordResponse>("", body);
   }
 }
