[NoCoverage] BooleanLiteral
src/components/BoardContextMenu/index.tsx:44:53
   const { t } = useTranslation();
   const dispatch = useDispatch();
   const { toReadableId } = useReadableId();
-  const [isCopied, setIsCopied] = useState<boolean>(false);
+  const [isCopied, setIsCopied] = useState<boolean>(true);
 
   const username = useSelector(getUsername);

[NoCoverage] BlockStatement
src/components/BoardContextMenu/index.tsx:48:49
 
   const username = useSelector(getUsername);
 
-  const handleColorPick = (newColor: IColor) => {
-    dispatch(BoardsActions.effect.update({ id: boardId, color: newColor }));
-  };
+  const handleColorPick = (newColor: IColor) => {};
 
   const handleMenuButtonClick = (action: EnumMenuActions, payload?: any) => {

[NoCoverage] ObjectLiteral
src/components/BoardContextMenu/index.tsx:49:42
   const username = useSelector(getUsername);
 
   const handleColorPick = (newColor: IColor) => {
-    dispatch(BoardsActions.effect.update({ id: boardId, color: newColor }));
+    dispatch(BoardsActions.effect.update({}));
   };
 

[NoCoverage] ConditionalExpression
src/components/BoardContextMenu/index.tsx:54:7
 
   const handleMenuButtonClick = (action: EnumMenuActions, payload?: any) => {
     switch (action) {
-      case EnumMenuActions.EditBoard: {
-        dispatch(SystemActions.setEditableBoardId(boardId));
-        break;
-      }
+      case EnumMenuActions.EditBoard:
       case EnumMenuActions.CardStyle: {
         dispatch(BoardsActions.effect.update({ id: boardId, cardType: payload }));

[NoCoverage] BlockStatement
src/components/BoardContextMenu/index.tsx:54:39
 
   const handleMenuButtonClick = (action: EnumMenuActions, payload?: any) => {
     switch (action) {
-      case EnumMenuActions.EditBoard: {
-        dispatch(SystemActions.setEditableBoardId(boardId));
-        break;
-      }
+      case EnumMenuActions.EditBoard: {}
       case EnumMenuActions.CardStyle: {
         dispatch(BoardsActions.effect.update({ id: boardId, cardType: payload }));

[NoCoverage] BlockStatement
src/components/BoardContextMenu/index.tsx:58:39
         dispatch(SystemActions.setEditableBoardId(boardId));
         break;
       }
-      case EnumMenuActions.CardStyle: {
-        dispatch(BoardsActions.effect.update({ id: boardId, cardType: payload }));
-        break;
-      }
+      case EnumMenuActions.CardStyle: {}
       case EnumMenuActions.ReverseColumnOrder: {
         dispatch(ColumnsActions.effect.reverseOrder({ boardId }));

[NoCoverage] ConditionalExpression
src/components/BoardContextMenu/index.tsx:58:7
         dispatch(SystemActions.setEditableBoardId(boardId));
         break;
       }
-      case EnumMenuActions.CardStyle: {
-        dispatch(BoardsActions.effect.update({ id: boardId, cardType: payload }));
-        break;
-      }
+      case EnumMenuActions.CardStyle:
       case EnumMenuActions.ReverseColumnOrder: {
         dispatch(ColumnsActions.effect.reverseOrder({ boardId }));

[NoCoverage] ConditionalExpression
src/components/BoardContextMenu/index.tsx:62:7
         dispatch(BoardsActions.effect.update({ id: boardId, cardType: payload }));
         break;
       }
-      case EnumMenuActions.ReverseColumnOrder: {
-        dispatch(ColumnsActions.effect.reverseOrder({ boardId }));
-        break;
-      }
+      case EnumMenuActions.ReverseColumnOrder:
       case EnumMenuActions.CopyLink: {
         setIsCopied(true);

[NoCoverage] BlockStatement
src/components/BoardContextMenu/index.tsx:62:48
         dispatch(BoardsActions.effect.update({ id: boardId, cardType: payload }));
         break;
       }
-      case EnumMenuActions.ReverseColumnOrder: {
-        dispatch(ColumnsActions.effect.reverseOrder({ boardId }));
-        break;
-      }
+      case EnumMenuActions.ReverseColumnOrder: {}
       case EnumMenuActions.CopyLink: {
         setIsCopied(true);

[NoCoverage] ConditionalExpression
src/components/BoardContextMenu/index.tsx:66:7
         dispatch(ColumnsActions.effect.reverseOrder({ boardId }));
         break;
       }
-      case EnumMenuActions.CopyLink: {
-        setIsCopied(true);
-        setTimeout(() => {
-          setIsCopied(false);
-          dispatch(SystemActions.setActivePopupId(null));
-        }, 1000);
-        return;
-      }
+      case EnumMenuActions.CopyLink:
       case EnumMenuActions.AddBoardBelow: {
         dispatch(BoardsActions.removeTemp());

[NoCoverage] BlockStatement
src/components/BoardContextMenu/index.tsx:66:38
         dispatch(ColumnsActions.effect.reverseOrder({ boardId }));
         break;
       }
-      case EnumMenuActions.CopyLink: {
-        setIsCopied(true);
-        setTimeout(() => {
-          setIsCopied(false);
-          dispatch(SystemActions.setActivePopupId(null));
-        }, 1000);
-        return;
-      }
+      case EnumMenuActions.CopyLink: {}
       case EnumMenuActions.AddBoardBelow: {
         dispatch(BoardsActions.removeTemp());

[NoCoverage] BooleanLiteral
src/components/BoardContextMenu/index.tsx:67:21
         break;
       }
       case EnumMenuActions.CopyLink: {
-        setIsCopied(true);
+        setIsCopied(false);
         setTimeout(() => {
           setIsCopied(false);

[NoCoverage] BlockStatement
src/components/BoardContextMenu/index.tsx:68:26
       }
       case EnumMenuActions.CopyLink: {
         setIsCopied(true);
-        setTimeout(() => {
-          setIsCopied(false);
-          dispatch(SystemActions.setActivePopupId(null));
-        }, 1000);
+        setTimeout(() => {}, 1000);
         return;
       }

[NoCoverage] BooleanLiteral
src/components/BoardContextMenu/index.tsx:69:23
       case EnumMenuActions.CopyLink: {
         setIsCopied(true);
         setTimeout(() => {
-          setIsCopied(false);
+          setIsCopied(true);
           dispatch(SystemActions.setActivePopupId(null));
         }, 1000);

[NoCoverage] BlockStatement
src/components/BoardContextMenu/index.tsx:74:43
         }, 1000);
         return;
       }
-      case EnumMenuActions.AddBoardBelow: {
-        dispatch(BoardsActions.removeTemp());
-        dispatch(BoardsActions.drawBelow({ belowId: boardId }));
-        break;
-      }
+      case EnumMenuActions.AddBoardBelow: {}
       case EnumMenuActions.Delete: {
         dispatch(BoardsActions.effect.remove({ id: boardId }));

[NoCoverage] ConditionalExpression
src/components/BoardContextMenu/index.tsx:74:7
         }, 1000);
         return;
       }
-      case EnumMenuActions.AddBoardBelow: {
-        dispatch(BoardsActions.removeTemp());
-        dispatch(BoardsActions.drawBelow({ belowId: boardId }));
-        break;
-      }
+      case EnumMenuActions.AddBoardBelow:
       case EnumMenuActions.Delete: {
         dispatch(BoardsActions.effect.remove({ id: boardId }));

[NoCoverage] BlockStatement
src/components/BoardContextMenu/index.tsx:79:36
         dispatch(BoardsActions.drawBelow({ belowId: boardId }));
         break;
       }
-      case EnumMenuActions.Delete: {
-        dispatch(BoardsActions.effect.remove({ id: boardId }));
-        break;
-      }
+      case EnumMenuActions.Delete: {}
       default: break;
     }

[NoCoverage] ConditionalExpression
src/components/BoardContextMenu/index.tsx:79:7
         dispatch(BoardsActions.drawBelow({ belowId: boardId }));
         break;
       }
-      case EnumMenuActions.Delete: {
-        dispatch(BoardsActions.effect.remove({ id: boardId }));
-        break;
-      }
+      case EnumMenuActions.Delete:
       default: break;
     }

[NoCoverage] ConditionalExpression
src/components/BoardContextMenu/index.tsx:83:7
         dispatch(BoardsActions.effect.remove({ id: boardId }));
         break;
       }
-      default: break;
+      default:
     }
   };

[NoCoverage] StringLiteral
src/components/BoardContextMenu/index.tsx:98:19
       isInvisible
       isHoverBlock={isHover}
       style={{
-        position: 'absolute',
+        position: "",
         right: 6,
       }}

[NoCoverage] BooleanLiteral
src/components/BoardContextMenu/index.tsx:102:19
         right: 6,
       }}
       position="right"
-      isAbsolute={false}
+      isAbsolute={true}
       isInvertColor={isActive}
     >

[NoCoverage] StringLiteral
src/components/BoardContextMenu/index.tsx:114:17
       />
       <Divider verticalSpacer={7} horizontalSpacer={10} />
       <Submenu
-        text={t('Card style')}
+        text={t("")}
         imageSrc="/assets/svg/menu/rect.svg"
       >

[NoCoverage] StringLiteral
src/components/BoardContextMenu/index.tsx:136:19
           payload={EnumTodoType.Dots}
         />
         <MenuItem
-          text={t('Dashes')}
+          text={t("")}
           imageSrc="/assets/svg/menu/dash.svg"
           action={EnumMenuActions.CardStyle}

[NoCoverage] BlockStatement
src/components/BoardContextMenu/index.tsx:153:37
       >
         <div className="menu-item__icons-container">
           {
-            ICONS.map((filename) => {
-              const link = `/assets/svg/board/${filename}.svg`;
-              return (
-                <ControlButton
-                  key={filename}
-                  imageSrc={link}
-                  alt={filename}
-                  imageSize={24}
-                  size={36}
-                  onClick={() => {
-                    dispatch(BoardsActions.effect.update({ id: boardId, icon: link }));
-                  }}
-                />
-              );
-            })
+            ICONS.map((filename) => {})
           }
         </div>

[NoCoverage] BlockStatement
src/components/BoardContextMenu/index.tsx:162:34
                   alt={filename}
                   imageSize={24}
                   size={36}
-                  onClick={() => {
-                    dispatch(BoardsActions.effect.update({ id: boardId, icon: link }));
-                  }}
+                  onClick={() => {}}
                 />
               );

[NoCoverage] StringLiteral
src/components/BoardContextMenu/index.tsx:172:17
         </div>
       </Submenu>
       <MenuItem
-        text={t('Reverse column order')}
+        text={t("")}
         imageSrc="/assets/svg/menu/reverse.svg"
         action={EnumMenuActions.ReverseColumnOrder}

[NoCoverage] BlockStatement
src/components/BoardContextMenu/index.tsx:178:23
       />
       <CopyToClipboard
         text={`verticals.xom9ik.com/${username}/${toReadableId(title, boardId!)}`} // TODO: move to env
-        onCopy={() => {
-          handleMenuButtonClick(EnumMenuActions.CopyLink);
-        }}
+        onCopy={() => {}}
       >
         <MenuItem

[NoCoverage] StringLiteral
src/components/BoardContextMenu/index.tsx:183:30
         }}
       >
         <MenuItem
-          text={isCopied ? t('Copied!') : t('Copy link')}
+          text={isCopied ? t("") : t('Copy link')}
           imageSrc="/assets/svg/menu/copy-link.svg"
           isAutoClose={false}

[NoCoverage] BooleanLiteral
src/components/BoardContextMenu/index.tsx:185:24
         <MenuItem
           text={isCopied ? t('Copied!') : t('Copy link')}
           imageSrc="/assets/svg/menu/copy-link.svg"
-          isAutoClose={false}
+          isAutoClose={true}
         />
       </CopyToClipboard>
