[Survived] StringLiteral
src/store/actions/auth.ts:12:38
 
 const setAuthInfo = createAction<ISetAuthInfo>('AUTH/SET_AUTH_INFO');
 const signUp = createAction<ISignUp>('AUTH/SIGN_UP');
-const signIn = createAction<ISignIn>('AUTH/SIGN_IN');
+const signIn = createAction<ISignIn>("");
 const logout = createAction('AUTH/LOGOUT');
 const reset = createAction<IResetPassword>('AUTH/RESET');

[Survived] StringLiteral
src/store/actions/auth.ts:13:29
 const setAuthInfo = createAction<ISetAuthInfo>('AUTH/SET_AUTH_INFO');
 const signUp = createAction<ISignUp>('AUTH/SIGN_UP');
 const signIn = createAction<ISignIn>('AUTH/SIGN_IN');
-const logout = createAction('AUTH/LOGOUT');
+const logout = createAction("");
 const reset = createAction<IResetPassword>('AUTH/RESET');
 const changePassword = createAction<IChangePassword>('AUTH/CHANGE');
