[NoCoverage] StringLiteral
src/components/Bullet/Bullet.stories.tsx:10:15
   argTypes: {
     type: {
       control: {
-        type: 'select',
+        type: "",
         options: Object.values(EnumTodoType).filter((v) => typeof v === 'number'),
       },

[NoCoverage] ConditionalExpression
src/components/Bullet/Bullet.stories.tsx:11:60
     type: {
       control: {
         type: 'select',
-        options: Object.values(EnumTodoType).filter((v) => typeof v === 'number'),
+        options: Object.values(EnumTodoType).filter((v) => false),
       },
       defaultValue: EnumTodoType.Arrows,

[NoCoverage] ConditionalExpression
src/components/Bullet/Bullet.stories.tsx:11:60
     type: {
       control: {
         type: 'select',
-        options: Object.values(EnumTodoType).filter((v) => typeof v === 'number'),
+        options: Object.values(EnumTodoType).filter((v) => true),
       },
       defaultValue: EnumTodoType.Arrows,

[NoCoverage] ConditionalExpression
src/components/Bullet/Bullet.stories.tsx:18:62
     status: {
       control: {
         type: 'select',
-        options: Object.values(EnumTodoStatus).filter((v) => typeof v === 'number'),
+        options: Object.values(EnumTodoStatus).filter((v) => false),
       },
       defaultValue: EnumTodoStatus.Done,

[NoCoverage] ArrowFunction
src/components/Bullet/Bullet.stories.tsx:18:55
     status: {
       control: {
         type: 'select',
-        options: Object.values(EnumTodoStatus).filter((v) => typeof v === 'number'),
+        options: Object.values(EnumTodoStatus).filter(() => undefined),
       },
       defaultValue: EnumTodoStatus.Done,

[NoCoverage] StringLiteral
src/components/Bullet/Bullet.stories.tsx:22:95
       },
       defaultValue: EnumTodoStatus.Done,
     },
-    size: { control: { type: 'select', options: ['small', 'medium', 'large'] }, defaultValue: 'large' },
+    size: { control: { type: 'select', options: ['small', 'medium', 'large'] }, defaultValue: "" },
     onChangeStatus: { action: 'change status' },
   },

[NoCoverage] StringLiteral
src/components/Bullet/Bullet.stories.tsx:22:30
       },
       defaultValue: EnumTodoStatus.Done,
     },
-    size: { control: { type: 'select', options: ['small', 'medium', 'large'] }, defaultValue: 'large' },
+    size: { control: { type: "", options: ['small', 'medium', 'large'] }, defaultValue: 'large' },
     onChangeStatus: { action: 'change status' },
   },

[NoCoverage] StringLiteral
src/components/Bullet/Bullet.stories.tsx:23:31
       defaultValue: EnumTodoStatus.Done,
     },
     size: { control: { type: 'select', options: ['small', 'medium', 'large'] }, defaultValue: 'large' },
-    onChangeStatus: { action: 'change status' },
+    onChangeStatus: { action: "" },
   },
 };

[NoCoverage] ArrowFunction
src/components/Bullet/Bullet.stories.tsx:27:24
   },
 };
 
-export const Default = (args: any) => <Bullet {...args} />;
+export const Default = () => undefined;
 export const Checkbox = (args: any) => <Bullet {...args} type={EnumTodoType.Checkboxes} />;
 export const Arrow = (args: any) => <Bullet {...args} type={EnumTodoType.Arrows} />;

[NoCoverage] ArrowFunction
src/components/Bullet/Bullet.stories.tsx:28:25
 };
 
 export const Default = (args: any) => <Bullet {...args} />;
-export const Checkbox = (args: any) => <Bullet {...args} type={EnumTodoType.Checkboxes} />;
+export const Checkbox = () => undefined;
 export const Arrow = (args: any) => <Bullet {...args} type={EnumTodoType.Arrows} />;
 export const Dash = (args: any) => <Bullet {...args} type={EnumTodoType.Dashes} />;

[NoCoverage] ArrowFunction
src/components/Bullet/Bullet.stories.tsx:29:22
 
 export const Default = (args: any) => <Bullet {...args} />;
 export const Checkbox = (args: any) => <Bullet {...args} type={EnumTodoType.Checkboxes} />;
-export const Arrow = (args: any) => <Bullet {...args} type={EnumTodoType.Arrows} />;
+export const Arrow = () => undefined;
 export const Dash = (args: any) => <Bullet {...args} type={EnumTodoType.Dashes} />;
 export const Dots = (args: any) => <Bullet {...args} type={EnumTodoType.Dots} />;

[NoCoverage] ArrowFunction
src/components/Bullet/Bullet.stories.tsx:30:21
 export const Default = (args: any) => <Bullet {...args} />;
 export const Checkbox = (args: any) => <Bullet {...args} type={EnumTodoType.Checkboxes} />;
 export const Arrow = (args: any) => <Bullet {...args} type={EnumTodoType.Arrows} />;
-export const Dash = (args: any) => <Bullet {...args} type={EnumTodoType.Dashes} />;
+export const Dash = () => undefined;
 export const Dots = (args: any) => <Bullet {...args} type={EnumTodoType.Dots} />;
 

[NoCoverage] ArrowFunction
src/components/Bullet/Bullet.stories.tsx:31:21
 export const Checkbox = (args: any) => <Bullet {...args} type={EnumTodoType.Checkboxes} />;
 export const Arrow = (args: any) => <Bullet {...args} type={EnumTodoType.Arrows} />;
 export const Dash = (args: any) => <Bullet {...args} type={EnumTodoType.Dashes} />;
-export const Dots = (args: any) => <Bullet {...args} type={EnumTodoType.Dots} />;
+export const Dots = () => undefined;
 
