[NoCoverage] StringLiteral
src/components/Bullet/index.tsx:6:18
 import { Checkbox } from '@comp/Checkbox';
 import { EnumTodoStatus, EnumTodoType } from '@type/entities';
 
-const bullets = ['arrow', 'dot', 'dash'];
+const bullets = ["", 'dot', 'dash'];
 
 interface IBullet {

[NoCoverage] BlockStatement
src/components/Bullet/index.tsx:23:56
   size = 'small',
   style,
 }) => {
-  const handleChange = (event: React.KeyboardEvent) => {
-    const { shiftKey, metaKey } = event.nativeEvent;
-    let newStatus;
-    if (shiftKey) {
-      newStatus = EnumTodoStatus.Canceled;
-    } else if (metaKey) {
-      newStatus = EnumTodoStatus.Doing;
-    } else if (status === EnumTodoStatus.Done) {
-      newStatus = EnumTodoStatus.Todo;
-    } else {
-      newStatus = EnumTodoStatus.Done;
-    }
-    onChangeStatus(newStatus);
-  };
+  const handleChange = (event: React.KeyboardEvent) => {};
 
   const renderBullet = () => {

[NoCoverage] BlockStatement
src/components/Bullet/index.tsx:26:19
   const handleChange = (event: React.KeyboardEvent) => {
     const { shiftKey, metaKey } = event.nativeEvent;
     let newStatus;
-    if (shiftKey) {
-      newStatus = EnumTodoStatus.Canceled;
-    } else if (metaKey) {
+    if (shiftKey) {} else if (metaKey) {
       newStatus = EnumTodoStatus.Doing;
     } else if (status === EnumTodoStatus.Done) {

[NoCoverage] ConditionalExpression
src/components/Bullet/index.tsx:26:9
   const handleChange = (event: React.KeyboardEvent) => {
     const { shiftKey, metaKey } = event.nativeEvent;
     let newStatus;
-    if (shiftKey) {
+    if (false) {
       newStatus = EnumTodoStatus.Canceled;
     } else if (metaKey) {

[NoCoverage] ConditionalExpression
src/components/Bullet/index.tsx:28:16
     let newStatus;
     if (shiftKey) {
       newStatus = EnumTodoStatus.Canceled;
-    } else if (metaKey) {
+    } else if (false) {
       newStatus = EnumTodoStatus.Doing;
     } else if (status === EnumTodoStatus.Done) {

[NoCoverage] ConditionalExpression
src/components/Bullet/index.tsx:28:16
     let newStatus;
     if (shiftKey) {
       newStatus = EnumTodoStatus.Canceled;
-    } else if (metaKey) {
+    } else if (true) {
       newStatus = EnumTodoStatus.Doing;
     } else if (status === EnumTodoStatus.Done) {

[NoCoverage] ConditionalExpression
src/components/Bullet/index.tsx:30:16
       newStatus = EnumTodoStatus.Canceled;
     } else if (metaKey) {
       newStatus = EnumTodoStatus.Doing;
-    } else if (status === EnumTodoStatus.Done) {
+    } else if (true) {
       newStatus = EnumTodoStatus.Todo;
     } else {

[NoCoverage] EqualityOperator
src/components/Bullet/index.tsx:30:16
       newStatus = EnumTodoStatus.Canceled;
     } else if (metaKey) {
       newStatus = EnumTodoStatus.Doing;
-    } else if (status === EnumTodoStatus.Done) {
+    } else if (status !== EnumTodoStatus.Done) {
       newStatus = EnumTodoStatus.Todo;
     } else {

[NoCoverage] BlockStatement
src/components/Bullet/index.tsx:32:12
       newStatus = EnumTodoStatus.Doing;
     } else if (status === EnumTodoStatus.Done) {
       newStatus = EnumTodoStatus.Todo;
-    } else {
-      newStatus = EnumTodoStatus.Done;
-    }
+    } else {}
     onChangeStatus(newStatus);
   };

[NoCoverage] ConditionalExpression
src/components/Bullet/index.tsx:40:7
 
   const renderBullet = () => {
     switch (type) {
-      case EnumTodoType.Checkboxes:
-        return (
-          <div
-            className={`bullet__overlay bullet__overlay--${size}`}
-            style={style}
-          >
-            {
-              status === EnumTodoStatus.Doing ? (
-                <div className="bullet__overlay--doing" />
-              ) : status === EnumTodoStatus.Canceled ? (
-                <div className="bullet__overlay--canceled" />
-              ) : null
-            }
-            <Checkbox
-              isActive={status === EnumTodoStatus.Done}
-              onChange={handleChange}
-              size={size}
-            />
-          </div>
-        );
+      case EnumTodoType.Checkboxes:
       case EnumTodoType.Arrows:
       case EnumTodoType.Dots:

[NoCoverage] ConditionalExpression
src/components/Bullet/index.tsx:47:15
             style={style}
           >
             {
-              status === EnumTodoStatus.Doing ? (
+              false ? (
                 <div className="bullet__overlay--doing" />
               ) : status === EnumTodoStatus.Canceled ? (

[NoCoverage] ConditionalExpression
src/components/Bullet/index.tsx:47:15
             style={style}
           >
             {
-              status === EnumTodoStatus.Doing ? (
+              true ? (
                 <div className="bullet__overlay--doing" />
               ) : status === EnumTodoStatus.Canceled ? (

[NoCoverage] ConditionalExpression
src/components/Bullet/index.tsx:49:19
             {
               status === EnumTodoStatus.Doing ? (
                 <div className="bullet__overlay--doing" />
-              ) : status === EnumTodoStatus.Canceled ? (
+              ) : true ? (
                 <div className="bullet__overlay--canceled" />
               ) : null

[NoCoverage] ConditionalExpression
src/components/Bullet/index.tsx:49:19
             {
               status === EnumTodoStatus.Doing ? (
                 <div className="bullet__overlay--doing" />
-              ) : status === EnumTodoStatus.Canceled ? (
+              ) : false ? (
                 <div className="bullet__overlay--canceled" />
               ) : null

[NoCoverage] EqualityOperator
src/components/Bullet/index.tsx:54:25
               ) : null
             }
             <Checkbox
-              isActive={status === EnumTodoStatus.Done}
+              isActive={status !== EnumTodoStatus.Done}
               onChange={handleChange}
               size={size}

[NoCoverage] ConditionalExpression
src/components/Bullet/index.tsx:54:25
               ) : null
             }
             <Checkbox
-              isActive={status === EnumTodoStatus.Done}
+              isActive={false}
               onChange={handleChange}
               size={size}

[NoCoverage] ConditionalExpression
src/components/Bullet/index.tsx:62:7
         );
       case EnumTodoType.Arrows:
       case EnumTodoType.Dots:
-      case EnumTodoType.Dashes:
-        return (
-          <img
-            className="bullet__image"
-            src={`/assets/svg/card/${bullets[type - 1]}.svg`}
-            alt="bullet"
-          />
-        );
+      case EnumTodoType.Dashes:
       case EnumTodoType.Nothing:
         return null;

[NoCoverage] ArithmeticOperator
src/components/Bullet/index.tsx:66:46
         return (
           <img
             className="bullet__image"
-            src={`/assets/svg/card/${bullets[type - 1]}.svg`}
+            src={`/assets/svg/card/${bullets[type + 1]}.svg`}
             alt="bullet"
           />

[NoCoverage] ConditionalExpression
src/components/Bullet/index.tsx:70:7
             alt="bullet"
           />
         );
-      case EnumTodoType.Nothing:
-        return null;
+      case EnumTodoType.Nothing:
       default: return null;
     }

[NoCoverage] ConditionalExpression
src/components/Bullet/index.tsx:72:7
         );
       case EnumTodoType.Nothing:
         return null;
-      default: return null;
+      default:
     }
   };
