[NoCoverage] ObjectLiteral
src/components/Button/Button.stories.tsx:6:13
 
 export default {
   title: 'Button',
-  argTypes: {
-    type: {
-      control: {
-        type: 'select',
-        options: ['button', 'submit'],
-      },
-      defaultValue: 'button',
-    },
-    modificator: {
-      control: {
-        type: 'select',
-        options: ['primary', 'transparent', 'danger'],
-      },
-      defaultValue: 'transparent',
-    },
-    isMaxWidth: { control: { type: 'boolean' }, defaultValue: false },
-    children: { control: { type: 'text' }, defaultValue: 'Sign in with Google' },
-    onClick: { action: 'clicked' },
-  },
+  argTypes: {},
 };
 

[NoCoverage] ArrayDeclaration
src/components/Button/Button.stories.tsx:10:18
     type: {
       control: {
         type: 'select',
-        options: ['button', 'submit'],
+        options: [],
       },
       defaultValue: 'button',

[NoCoverage] StringLiteral
src/components/Button/Button.stories.tsx:10:19
     type: {
       control: {
         type: 'select',
-        options: ['button', 'submit'],
+        options: ["", 'submit'],
       },
       defaultValue: 'button',

[NoCoverage] StringLiteral
src/components/Button/Button.stories.tsx:17:19
     modificator: {
       control: {
         type: 'select',
-        options: ['primary', 'transparent', 'danger'],
+        options: ["", 'transparent', 'danger'],
       },
       defaultValue: 'transparent',

[NoCoverage] StringLiteral
src/components/Button/Button.stories.tsx:17:45
     modificator: {
       control: {
         type: 'select',
-        options: ['primary', 'transparent', 'danger'],
+        options: ['primary', 'transparent', ""],
       },
       defaultValue: 'transparent',

[NoCoverage] StringLiteral
src/components/Button/Button.stories.tsx:19:21
         type: 'select',
         options: ['primary', 'transparent', 'danger'],
       },
-      defaultValue: 'transparent',
+      defaultValue: "",
     },
     isMaxWidth: { control: { type: 'boolean' }, defaultValue: false },

[NoCoverage] BooleanLiteral
src/components/Button/Button.stories.tsx:21:63
       },
       defaultValue: 'transparent',
     },
-    isMaxWidth: { control: { type: 'boolean' }, defaultValue: false },
+    isMaxWidth: { control: { type: 'boolean' }, defaultValue: true },
     children: { control: { type: 'text' }, defaultValue: 'Sign in with Google' },
     onClick: { action: 'clicked' },

[NoCoverage] ObjectLiteral
src/components/Button/Button.stories.tsx:21:28
       },
       defaultValue: 'transparent',
     },
-    isMaxWidth: { control: { type: 'boolean' }, defaultValue: false },
+    isMaxWidth: { control: {}, defaultValue: false },
     children: { control: { type: 'text' }, defaultValue: 'Sign in with Google' },
     onClick: { action: 'clicked' },

[NoCoverage] StringLiteral
src/components/Button/Button.stories.tsx:22:34
       defaultValue: 'transparent',
     },
     isMaxWidth: { control: { type: 'boolean' }, defaultValue: false },
-    children: { control: { type: 'text' }, defaultValue: 'Sign in with Google' },
+    children: { control: { type: "" }, defaultValue: 'Sign in with Google' },
     onClick: { action: 'clicked' },
   },

[NoCoverage] ObjectLiteral
src/components/Button/Button.stories.tsx:22:26
       defaultValue: 'transparent',
     },
     isMaxWidth: { control: { type: 'boolean' }, defaultValue: false },
-    children: { control: { type: 'text' }, defaultValue: 'Sign in with Google' },
+    children: { control: {}, defaultValue: 'Sign in with Google' },
     onClick: { action: 'clicked' },
   },

[NoCoverage] ArrowFunction
src/components/Button/Button.stories.tsx:27:24
   },
 };
 
-export const Default = (args: any) => <Button {...args} />;
+export const Default = () => undefined;
 export const Transparent = (args: any) => <Button {...args} modificator="transparent">Sign In</Button>;
 export const Primary = (args: any) => <Button {...args} modificator="primary">OK</Button>;

[NoCoverage] ArrowFunction
src/components/Button/Button.stories.tsx:28:28
 };
 
 export const Default = (args: any) => <Button {...args} />;
-export const Transparent = (args: any) => <Button {...args} modificator="transparent">Sign In</Button>;
+export const Transparent = () => undefined;
 export const Primary = (args: any) => <Button {...args} modificator="primary">OK</Button>;
 export const Danger = (args: any) => <Button {...args} modificator="danger">Delete account</Button>;

[NoCoverage] ArrowFunction
src/components/Button/Button.stories.tsx:29:24
 
 export const Default = (args: any) => <Button {...args} />;
 export const Transparent = (args: any) => <Button {...args} modificator="transparent">Sign In</Button>;
-export const Primary = (args: any) => <Button {...args} modificator="primary">OK</Button>;
+export const Primary = () => undefined;
 export const Danger = (args: any) => <Button {...args} modificator="danger">Delete account</Button>;
 

[NoCoverage] ArrowFunction
src/components/Button/Button.stories.tsx:30:23
 export const Default = (args: any) => <Button {...args} />;
 export const Transparent = (args: any) => <Button {...args} modificator="transparent">Sign In</Button>;
 export const Primary = (args: any) => <Button {...args} modificator="primary">OK</Button>;
-export const Danger = (args: any) => <Button {...args} modificator="danger">Delete account</Button>;
+export const Danger = () => undefined;
 
