[NoCoverage] ArrowFunction
src/components/Button/index.tsx:12:36
   style?: React.CSSProperties,
 }
 
-export const Button: FC<IButton> = ({
-  type, modificator,
-  onClick, isMaxWidth, style, children, ...attrs
-}) => (
-  <button
-    {...attrs}
-    className={cn('button', {
-      [`button--${modificator}`]: modificator,
-      'button--max': isMaxWidth,
-    })}
-    type={type}
-    onClick={onClick}
-    style={style}
-  >
-    <span
-      className="button__content"
-    >
-      {children}
-    </span>
-  </button>
-);
+export const Button: FC<IButton> = () => undefined;
 

[NoCoverage] ObjectLiteral
src/components/Button/index.tsx:18:29
 }) => (
   <button
     {...attrs}
-    className={cn('button', {
-      [`button--${modificator}`]: modificator,
-      'button--max': isMaxWidth,
-    })}
+    className={cn('button', {})}
     type={type}
     onClick={onClick}

[NoCoverage] StringLiteral
src/components/Button/index.tsx:19:8
   <button
     {...attrs}
     className={cn('button', {
-      [`button--${modificator}`]: modificator,
+      [``]: modificator,
       'button--max': isMaxWidth,
     })}
