[NoCoverage] LogicalOperator
src/components/CardAttachments/index.tsx:19:10
   const { download } = useDownload();
   const attachments = useParamSelector(getCommentFileAttachmentsByTodoId, todoId);
 
-  return attachments && attachments.length ? (
+  return attachments || attachments.length ? (
     <div className={cn('card-attachments', {
       'card-attachments--collapse': isCollapse,

[NoCoverage] ConditionalExpression
src/components/CardAttachments/index.tsx:19:10
   const { download } = useDownload();
   const attachments = useParamSelector(getCommentFileAttachmentsByTodoId, todoId);
 
-  return attachments && attachments.length ? (
+  return true ? (
     <div className={cn('card-attachments', {
       'card-attachments--collapse': isCollapse,

[NoCoverage] ObjectLiteral
src/components/CardAttachments/index.tsx:20:44
   const attachments = useParamSelector(getCommentFileAttachmentsByTodoId, todoId);
 
   return attachments && attachments.length ? (
-    <div className={cn('card-attachments', {
-      'card-attachments--collapse': isCollapse,
-    })}
+    <div className={cn('card-attachments', {})}
     >
       <div className="card-attachments__inner">

[NoCoverage] ArrowFunction
src/components/CardAttachments/index.tsx:26:27
     >
       <div className="card-attachments__inner">
         {
-          attachments.map((attachment) => (
-            <button
-              key={attachment.path}
-              className="card-attachment"
-              onClick={(e) => {
-                e.stopPropagation();
-                download(attachment.path);
-              }}
-            >
-              <div className="comment-file__extension">
-                <img src="/assets/svg/extension.svg" alt="extension" />
-                <span>
-                  {attachment.extension.substring(0, 4)}
-                </span>
-              </div>
-              <span className="card-attachment__name">
-                {attachment.name}
-              </span>
-            </button>
-          ))
+          attachments.map(() => undefined)
         }
       </div>

[NoCoverage] BlockStatement
src/components/CardAttachments/index.tsx:30:31
             <button
               key={attachment.path}
               className="card-attachment"
-              onClick={(e) => {
-                e.stopPropagation();
-                download(attachment.path);
-              }}
+              onClick={(e) => {}}
             >
               <div className="comment-file__extension">
