[NoCoverage] ConditionalExpression
src/components/CardAttachmentsPreview/index.tsx:47:34
   const fileAttachments = useParamSelector(getCommentFileAttachmentsByTodoId, todoId);
   const columnWidth = useParamSelector(getWidthByColumnId, columnId);
 
-  const commentsCountWithCache = comments?.length || commentsCount;
+  const commentsCountWithCache = false;
   const imagesCountWithCache = imageAttachments?.length || imagesCount;
   const filesCountWithCache = fileAttachments?.length || attachmentsCount;

[NoCoverage] LogicalOperator
src/components/CardAttachmentsPreview/index.tsx:47:34
   const fileAttachments = useParamSelector(getCommentFileAttachmentsByTodoId, todoId);
   const columnWidth = useParamSelector(getWidthByColumnId, columnId);
 
-  const commentsCountWithCache = comments?.length || commentsCount;
+  const commentsCountWithCache = comments?.length && commentsCount;
   const imagesCountWithCache = imageAttachments?.length || imagesCount;
   const filesCountWithCache = fileAttachments?.length || attachmentsCount;

[NoCoverage] ConditionalExpression
src/components/CardAttachmentsPreview/index.tsx:48:32
   const columnWidth = useParamSelector(getWidthByColumnId, columnId);
 
   const commentsCountWithCache = comments?.length || commentsCount;
-  const imagesCountWithCache = imageAttachments?.length || imagesCount;
+  const imagesCountWithCache = false;
   const filesCountWithCache = fileAttachments?.length || attachmentsCount;
 

[NoCoverage] ConditionalExpression
src/components/CardAttachmentsPreview/index.tsx:48:32
   const columnWidth = useParamSelector(getWidthByColumnId, columnId);
 
   const commentsCountWithCache = comments?.length || commentsCount;
-  const imagesCountWithCache = imageAttachments?.length || imagesCount;
+  const imagesCountWithCache = true;
   const filesCountWithCache = fileAttachments?.length || attachmentsCount;
 

[NoCoverage] LogicalOperator
src/components/CardAttachmentsPreview/index.tsx:49:31
 
   const commentsCountWithCache = comments?.length || commentsCount;
   const imagesCountWithCache = imageAttachments?.length || imagesCount;
-  const filesCountWithCache = fileAttachments?.length || attachmentsCount;
+  const filesCountWithCache = fileAttachments?.length && attachmentsCount;
 
   const [isShowFiles, setIsShowFiles] = useState<boolean>(false);

[NoCoverage] ConditionalExpression
src/components/CardAttachmentsPreview/index.tsx:49:31
 
   const commentsCountWithCache = comments?.length || commentsCount;
   const imagesCountWithCache = imageAttachments?.length || imagesCount;
-  const filesCountWithCache = fileAttachments?.length || attachmentsCount;
+  const filesCountWithCache = false;
 
   const [isShowFiles, setIsShowFiles] = useState<boolean>(false);

[NoCoverage] BooleanLiteral
src/components/CardAttachmentsPreview/index.tsx:51:59
   const imagesCountWithCache = imageAttachments?.length || imagesCount;
   const filesCountWithCache = fileAttachments?.length || attachmentsCount;
 
-  const [isShowFiles, setIsShowFiles] = useState<boolean>(false);
+  const [isShowFiles, setIsShowFiles] = useState<boolean>(true);
   const [isShowGallery, setIsShowGallery] = useState<boolean>(false);
 

[NoCoverage] BooleanLiteral
src/components/CardAttachmentsPreview/index.tsx:52:63
   const filesCountWithCache = fileAttachments?.length || attachmentsCount;
 
   const [isShowFiles, setIsShowFiles] = useState<boolean>(false);
-  const [isShowGallery, setIsShowGallery] = useState<boolean>(false);
+  const [isShowGallery, setIsShowGallery] = useState<boolean>(true);
 
   const renderIcon = (

[NoCoverage] EqualityOperator
src/components/CardAttachmentsPreview/index.tsx:61:8
     onClick: (e: React.SyntheticEvent) => void,
     isColored: boolean,
     text?: string,
-  ) => count !== undefined && count > 0 && (
+  ) => count === undefined && count > 0 && (
   <ControlButton
     imageSrc={`/assets/svg/${name}.svg`}

[NoCoverage] ConditionalExpression
src/components/CardAttachmentsPreview/index.tsx:61:31
     onClick: (e: React.SyntheticEvent) => void,
     isColored: boolean,
     text?: string,
-  ) => count !== undefined && count > 0 && (
+  ) => count !== undefined && true && (
   <ControlButton
     imageSrc={`/assets/svg/${name}.svg`}

[NoCoverage] ArrowFunction
src/components/CardAttachmentsPreview/index.tsx:72:20
     isTextable
     text={text}
     onClick={onClick}
-    onDoubleClick={(e) => e.stopPropagation()}
+    onDoubleClick={() => undefined}
     isColored={isColored}
     isStopPropagation={false}

[NoCoverage] BooleanLiteral
src/components/CardAttachmentsPreview/index.tsx:74:24
     onClick={onClick}
     onDoubleClick={(e) => e.stopPropagation()}
     isColored={isColored}
-    isStopPropagation={false}
+    isStopPropagation={true}
     style={{
       borderRadius: 4,

[NoCoverage] BlockStatement
src/components/CardAttachmentsPreview/index.tsx:81:79
   />
   );
 
-  const handleToggle = (event: React.SyntheticEvent, type: EnumToggleType) => {
-    switch (type) {
-      case EnumToggleType.Files: {
-        event.stopPropagation();
-        setTimeout(() => setIsShowFiles((prev) => {
-          if (!prev) {
-            dispatch(CommentAttachmentsActions.fetchByTodoId({ todoId: todoId! }));
-          }
-          return !prev;
-        }), 400);
-        setIsShowGallery(false); break;
-      }
-      case EnumToggleType.Gallery: {
-        event.stopPropagation();
-        setTimeout(() => setIsShowGallery((prev) => {
-          if (!prev) {
-            dispatch(CommentAttachmentsActions.fetchByTodoId({ todoId: todoId! }));
-          }
-          return !prev;
-        }), 300);
-        setIsShowFiles(false); break;
-      }
-      default: break;
-    }
-  };
+  const handleToggle = (event: React.SyntheticEvent, type: EnumToggleType) => {};
 
   return (

[NoCoverage] BlockStatement
src/components/CardAttachmentsPreview/index.tsx:83:34
 
   const handleToggle = (event: React.SyntheticEvent, type: EnumToggleType) => {
     switch (type) {
-      case EnumToggleType.Files: {
-        event.stopPropagation();
-        setTimeout(() => setIsShowFiles((prev) => {
-          if (!prev) {
-            dispatch(CommentAttachmentsActions.fetchByTodoId({ todoId: todoId! }));
-          }
-          return !prev;
-        }), 400);
-        setIsShowGallery(false); break;
-      }
+      case EnumToggleType.Files: {}
       case EnumToggleType.Gallery: {
         event.stopPropagation();

[NoCoverage] ConditionalExpression
src/components/CardAttachmentsPreview/index.tsx:83:7
 
   const handleToggle = (event: React.SyntheticEvent, type: EnumToggleType) => {
     switch (type) {
-      case EnumToggleType.Files: {
-        event.stopPropagation();
-        setTimeout(() => setIsShowFiles((prev) => {
-          if (!prev) {
-            dispatch(CommentAttachmentsActions.fetchByTodoId({ todoId: todoId! }));
-          }
-          return !prev;
-        }), 400);
-        setIsShowGallery(false); break;
-      }
+      case EnumToggleType.Files:
       case EnumToggleType.Gallery: {
         event.stopPropagation();

[NoCoverage] ArrowFunction
src/components/CardAttachmentsPreview/index.tsx:85:20
     switch (type) {
       case EnumToggleType.Files: {
         event.stopPropagation();
-        setTimeout(() => setIsShowFiles((prev) => {
-          if (!prev) {
-            dispatch(CommentAttachmentsActions.fetchByTodoId({ todoId: todoId! }));
-          }
-          return !prev;
-        }), 400);
+        setTimeout(() => undefined, 400);
         setIsShowGallery(false); break;
       }

[NoCoverage] BlockStatement
src/components/CardAttachmentsPreview/index.tsx:85:51
     switch (type) {
       case EnumToggleType.Files: {
         event.stopPropagation();
-        setTimeout(() => setIsShowFiles((prev) => {
-          if (!prev) {
-            dispatch(CommentAttachmentsActions.fetchByTodoId({ todoId: todoId! }));
-          }
-          return !prev;
-        }), 400);
+        setTimeout(() => setIsShowFiles((prev) => {}), 400);
         setIsShowGallery(false); break;
       }

[NoCoverage] BooleanLiteral
src/components/CardAttachmentsPreview/index.tsx:86:15
       case EnumToggleType.Files: {
         event.stopPropagation();
         setTimeout(() => setIsShowFiles((prev) => {
-          if (!prev) {
+          if (prev) {
             dispatch(CommentAttachmentsActions.fetchByTodoId({ todoId: todoId! }));
           }

[NoCoverage] ConditionalExpression
src/components/CardAttachmentsPreview/index.tsx:86:15
       case EnumToggleType.Files: {
         event.stopPropagation();
         setTimeout(() => setIsShowFiles((prev) => {
-          if (!prev) {
+          if (true) {
             dispatch(CommentAttachmentsActions.fetchByTodoId({ todoId: todoId! }));
           }

[NoCoverage] ObjectLiteral
src/components/CardAttachmentsPreview/index.tsx:87:62
         event.stopPropagation();
         setTimeout(() => setIsShowFiles((prev) => {
           if (!prev) {
-            dispatch(CommentAttachmentsActions.fetchByTodoId({ todoId: todoId! }));
+            dispatch(CommentAttachmentsActions.fetchByTodoId({}));
           }
           return !prev;

[NoCoverage] BooleanLiteral
src/components/CardAttachmentsPreview/index.tsx:89:18
           if (!prev) {
             dispatch(CommentAttachmentsActions.fetchByTodoId({ todoId: todoId! }));
           }
-          return !prev;
+          return prev;
         }), 400);
         setIsShowGallery(false); break;

[NoCoverage] BooleanLiteral
src/components/CardAttachmentsPreview/index.tsx:91:26
           }
           return !prev;
         }), 400);
-        setIsShowGallery(false); break;
+        setIsShowGallery(true); break;
       }
       case EnumToggleType.Gallery: {

[NoCoverage] BlockStatement
src/components/CardAttachmentsPreview/index.tsx:93:36
         }), 400);
         setIsShowGallery(false); break;
       }
-      case EnumToggleType.Gallery: {
-        event.stopPropagation();
-        setTimeout(() => setIsShowGallery((prev) => {
-          if (!prev) {
-            dispatch(CommentAttachmentsActions.fetchByTodoId({ todoId: todoId! }));
-          }
-          return !prev;
-        }), 300);
-        setIsShowFiles(false); break;
-      }
+      case EnumToggleType.Gallery: {}
       default: break;
     }

[NoCoverage] ConditionalExpression
src/components/CardAttachmentsPreview/index.tsx:93:7
         }), 400);
         setIsShowGallery(false); break;
       }
-      case EnumToggleType.Gallery: {
-        event.stopPropagation();
-        setTimeout(() => setIsShowGallery((prev) => {
-          if (!prev) {
-            dispatch(CommentAttachmentsActions.fetchByTodoId({ todoId: todoId! }));
-          }
-          return !prev;
-        }), 300);
-        setIsShowFiles(false); break;
-      }
+      case EnumToggleType.Gallery:
       default: break;
     }

[NoCoverage] BlockStatement
src/components/CardAttachmentsPreview/index.tsx:95:53
       }
       case EnumToggleType.Gallery: {
         event.stopPropagation();
-        setTimeout(() => setIsShowGallery((prev) => {
-          if (!prev) {
-            dispatch(CommentAttachmentsActions.fetchByTodoId({ todoId: todoId! }));
-          }
-          return !prev;
-        }), 300);
+        setTimeout(() => setIsShowGallery((prev) => {}), 300);
         setIsShowFiles(false); break;
       }

[NoCoverage] ArrowFunction
src/components/CardAttachmentsPreview/index.tsx:95:20
       }
       case EnumToggleType.Gallery: {
         event.stopPropagation();
-        setTimeout(() => setIsShowGallery((prev) => {
-          if (!prev) {
-            dispatch(CommentAttachmentsActions.fetchByTodoId({ todoId: todoId! }));
-          }
-          return !prev;
-        }), 300);
+        setTimeout(() => undefined, 300);
         setIsShowFiles(false); break;
       }

[NoCoverage] BooleanLiteral
src/components/CardAttachmentsPreview/index.tsx:96:15
       case EnumToggleType.Gallery: {
         event.stopPropagation();
         setTimeout(() => setIsShowGallery((prev) => {
-          if (!prev) {
+          if (prev) {
             dispatch(CommentAttachmentsActions.fetchByTodoId({ todoId: todoId! }));
           }

[NoCoverage] ConditionalExpression
src/components/CardAttachmentsPreview/index.tsx:96:15
       case EnumToggleType.Gallery: {
         event.stopPropagation();
         setTimeout(() => setIsShowGallery((prev) => {
-          if (!prev) {
+          if (false) {
             dispatch(CommentAttachmentsActions.fetchByTodoId({ todoId: todoId! }));
           }

[NoCoverage] BooleanLiteral
src/components/CardAttachmentsPreview/index.tsx:101:24
           }
           return !prev;
         }), 300);
-        setIsShowFiles(false); break;
+        setIsShowFiles(true); break;
       }
       default: break;

[NoCoverage] ArrowFunction
src/components/CardAttachmentsPreview/index.tsx:112:11
       <div className="card__toggle-container">
         {renderIcon(
           filesCountWithCache, 'files', t('Show Files'),
-          (e) => handleToggle(e, EnumToggleType.Files), isShowFiles,
+          () => undefined, isShowFiles,
         )}
         {renderIcon(

[NoCoverage] ArrowFunction
src/components/CardAttachmentsPreview/index.tsx:116:11
         )}
         {renderIcon(
           imagesCountWithCache, 'images', t('Show Gallery'),
-          (e) => handleToggle(e, EnumToggleType.Gallery), isShowGallery,
+          () => undefined, isShowGallery,
         )}
         {renderIcon(

[NoCoverage] BooleanLiteral
src/components/CardAttachmentsPreview/index.tsx:120:60
         )}
         {renderIcon(
           commentsCountWithCache, 'bubble', t('{{count}} comment', { count: commentsCountWithCache }),
-          (e) => handleToggle(e, EnumToggleType.Comments), false, String(commentsCountWithCache),
+          (e) => handleToggle(e, EnumToggleType.Comments), true, String(commentsCountWithCache),
         )}
       </div>

[NoCoverage] ArrowFunction
src/components/CardAttachmentsPreview/index.tsx:120:11
         )}
         {renderIcon(
           commentsCountWithCache, 'bubble', t('{{count}} comment', { count: commentsCountWithCache }),
-          (e) => handleToggle(e, EnumToggleType.Comments), false, String(commentsCountWithCache),
+          () => undefined, false, String(commentsCountWithCache),
         )}
       </div>

[NoCoverage] BooleanLiteral
src/components/CardAttachmentsPreview/index.tsx:125:21
       </div>
       <MiniGallery
         todoId={todoId}
-        isCollapse={!isShowGallery}
+        isCollapse={isShowGallery}
         width={columnWidth === null ? DEFAULT_COLUMN_WIDTH : columnWidth}
       />

[NoCoverage] ConditionalExpression
src/components/CardAttachmentsPreview/index.tsx:126:16
       <MiniGallery
         todoId={todoId}
         isCollapse={!isShowGallery}
-        width={columnWidth === null ? DEFAULT_COLUMN_WIDTH : columnWidth}
+        width={true ? DEFAULT_COLUMN_WIDTH : columnWidth}
       />
       <CardAttachments

[NoCoverage] ConditionalExpression
src/components/CardAttachmentsPreview/index.tsx:126:16
       <MiniGallery
         todoId={todoId}
         isCollapse={!isShowGallery}
-        width={columnWidth === null ? DEFAULT_COLUMN_WIDTH : columnWidth}
+        width={false ? DEFAULT_COLUMN_WIDTH : columnWidth}
       />
       <CardAttachments

[NoCoverage] BooleanLiteral
src/components/CardAttachmentsPreview/index.tsx:130:21
       />
       <CardAttachments
         todoId={todoId}
-        isCollapse={!isShowFiles}
+        isCollapse={isShowFiles}
       />
     </>
