[NoCoverage] BooleanLiteral
src/components/CardContextMenu/index.tsx:75:27
   isColored,
   onStartEdit,
   onChangeColor,
-  isTransformedPosition = true,
+  isTransformedPosition = false,
 }) => {
   const { t } = useTranslation();

[NoCoverage] BooleanLiteral
src/components/CardContextMenu/index.tsx:85:53
   const username = useSelector(getUsername);
   const activeBoardReadableId = useSelector(getActiveBoardReadableId);
 
-  const [isCopied, setIsCopied] = useState<boolean>(false);
+  const [isCopied, setIsCopied] = useState<boolean>(true);
   const [isOpenDatePicker, setIsOpenDatePicker] = useState<boolean>(false);
 

[NoCoverage] BooleanLiteral
src/components/CardContextMenu/index.tsx:86:69
   const activeBoardReadableId = useSelector(getActiveBoardReadableId);
 
   const [isCopied, setIsCopied] = useState<boolean>(false);
-  const [isOpenDatePicker, setIsOpenDatePicker] = useState<boolean>(false);
+  const [isOpenDatePicker, setIsOpenDatePicker] = useState<boolean>(true);
 
   const menuButtonRef = useRef<any>();

[NoCoverage] BlockStatement
src/components/CardContextMenu/index.tsx:90:41
 
   const menuButtonRef = useRef<any>();
 
-  const handleUploadFiles = async () => {
-    const openedFiles = await openFiles('*', true);
-    dispatch(CommentsActions.effect.create({
-      todoId: todoId!,
-      text: '',
-      files: openedFiles,
-    }));
-  };
+  const handleUploadFiles = async () => {};
 
   const handleMenuButtonClick = (action: EnumCardActions, payload?: any) => {

[NoCoverage] BooleanLiteral
src/components/CardContextMenu/index.tsx:91:46
   const menuButtonRef = useRef<any>();
 
   const handleUploadFiles = async () => {
-    const openedFiles = await openFiles('*', true);
+    const openedFiles = await openFiles('*', false);
     dispatch(CommentsActions.effect.create({
       todoId: todoId!,

[NoCoverage] ConditionalExpression
src/components/CardContextMenu/index.tsx:101:7
 
   const handleMenuButtonClick = (action: EnumCardActions, payload?: any) => {
     switch (action) {
-      case EnumCardActions.ChangeColor: {
-        onChangeColor(payload);
-        break;
-      }
+      case EnumCardActions.ChangeColor:
       case EnumCardActions.EditCard: {
         onStartEdit();

[NoCoverage] BlockStatement
src/components/CardContextMenu/index.tsx:101:41
 
   const handleMenuButtonClick = (action: EnumCardActions, payload?: any) => {
     switch (action) {
-      case EnumCardActions.ChangeColor: {
-        onChangeColor(payload);
-        break;
-      }
+      case EnumCardActions.ChangeColor: {}
       case EnumCardActions.EditCard: {
         onStartEdit();

[NoCoverage] BlockStatement
src/components/CardContextMenu/index.tsx:105:38
         onChangeColor(payload);
         break;
       }
-      case EnumCardActions.EditCard: {
-        onStartEdit();
-        break;
-      }
+      case EnumCardActions.EditCard: {}
       case EnumCardActions.AttachFile: {
         handleUploadFiles();

[NoCoverage] ConditionalExpression
src/components/CardContextMenu/index.tsx:105:7
         onChangeColor(payload);
         break;
       }
-      case EnumCardActions.EditCard: {
-        onStartEdit();
-        break;
-      }
+      case EnumCardActions.EditCard:
       case EnumCardActions.AttachFile: {
         handleUploadFiles();

[NoCoverage] BlockStatement
src/components/CardContextMenu/index.tsx:109:40
         onStartEdit();
         break;
       }
-      case EnumCardActions.AttachFile: {
-        handleUploadFiles();
-        break;
-      }
+      case EnumCardActions.AttachFile: {}
       case EnumCardActions.AddDate: {
         setIsOpenDatePicker(true);

[NoCoverage] ConditionalExpression
src/components/CardContextMenu/index.tsx:109:7
         onStartEdit();
         break;
       }
-      case EnumCardActions.AttachFile: {
-        handleUploadFiles();
-        break;
-      }
+      case EnumCardActions.AttachFile:
       case EnumCardActions.AddDate: {
         setIsOpenDatePicker(true);

[NoCoverage] BlockStatement
src/components/CardContextMenu/index.tsx:113:37
         handleUploadFiles();
         break;
       }
-      case EnumCardActions.AddDate: {
-        setIsOpenDatePicker(true);
-        break;
-      }
+      case EnumCardActions.AddDate: {}
       case EnumCardActions.CompleteStatus: {
         dispatch(TodosActions.effect.update({

[NoCoverage] ConditionalExpression
src/components/CardContextMenu/index.tsx:113:7
         handleUploadFiles();
         break;
       }
-      case EnumCardActions.AddDate: {
-        setIsOpenDatePicker(true);
-        break;
-      }
+      case EnumCardActions.AddDate:
       case EnumCardActions.CompleteStatus: {
         dispatch(TodosActions.effect.update({

[NoCoverage] BooleanLiteral
src/components/CardContextMenu/index.tsx:114:29
         break;
       }
       case EnumCardActions.AddDate: {
-        setIsOpenDatePicker(true);
+        setIsOpenDatePicker(false);
         break;
       }

[NoCoverage] ConditionalExpression
src/components/CardContextMenu/index.tsx:117:7
         setIsOpenDatePicker(true);
         break;
       }
-      case EnumCardActions.CompleteStatus: {
-        dispatch(TodosActions.effect.update({
-          id: todoId!,
-          status: payload,
-        }));
-        break;
-      }
+      case EnumCardActions.CompleteStatus:
       case EnumCardActions.Notifications: {
         dispatch(TodosActions.effect.update({

[NoCoverage] BlockStatement
src/components/CardContextMenu/index.tsx:117:44
         setIsOpenDatePicker(true);
         break;
       }
-      case EnumCardActions.CompleteStatus: {
-        dispatch(TodosActions.effect.update({
-          id: todoId!,
-          status: payload,
-        }));
-        break;
-      }
+      case EnumCardActions.CompleteStatus: {}
       case EnumCardActions.Notifications: {
         dispatch(TodosActions.effect.update({

[NoCoverage] ObjectLiteral
src/components/CardContextMenu/index.tsx:118:45
         break;
       }
       case EnumCardActions.CompleteStatus: {
-        dispatch(TodosActions.effect.update({
-          id: todoId!,
-          status: payload,
-        }));
+        dispatch(TodosActions.effect.update({}));
         break;
       }

[NoCoverage] BlockStatement
src/components/CardContextMenu/index.tsx:124:43
         }));
         break;
       }
-      case EnumCardActions.Notifications: {
-        dispatch(TodosActions.effect.update({
-          id: todoId!,
-          isNotificationsEnabled: !isNotificationsEnabled,
-        }));
-        break;
-      }
+      case EnumCardActions.Notifications: {}
       case EnumCardActions.CopyLink: {
         setIsCopied(true);

[NoCoverage] ConditionalExpression
src/components/CardContextMenu/index.tsx:124:7
         }));
         break;
       }
-      case EnumCardActions.Notifications: {
-        dispatch(TodosActions.effect.update({
-          id: todoId!,
-          isNotificationsEnabled: !isNotificationsEnabled,
-        }));
-        break;
-      }
+      case EnumCardActions.Notifications:
       case EnumCardActions.CopyLink: {
         setIsCopied(true);

[NoCoverage] ObjectLiteral
src/components/CardContextMenu/index.tsx:125:45
         break;
       }
       case EnumCardActions.Notifications: {
-        dispatch(TodosActions.effect.update({
-          id: todoId!,
-          isNotificationsEnabled: !isNotificationsEnabled,
-        }));
+        dispatch(TodosActions.effect.update({}));
         break;
       }

[NoCoverage] BooleanLiteral
src/components/CardContextMenu/index.tsx:127:35
       case EnumCardActions.Notifications: {
         dispatch(TodosActions.effect.update({
           id: todoId!,
-          isNotificationsEnabled: !isNotificationsEnabled,
+          isNotificationsEnabled: isNotificationsEnabled,
         }));
         break;

[NoCoverage] ConditionalExpression
src/components/CardContextMenu/index.tsx:131:7
         }));
         break;
       }
-      case EnumCardActions.CopyLink: {
-        setIsCopied(true);
-        setTimeout(() => {
-          setIsCopied(false);
-          dispatch(SystemActions.setActivePopupId(null));
-        }, 1000);
-        return;
-      }
+      case EnumCardActions.CopyLink:
       case EnumCardActions.Duplicate: {
         dispatch(TodosActions.effect.duplicate({ todoId: todoId! }));

[NoCoverage] BlockStatement
src/components/CardContextMenu/index.tsx:131:38
         }));
         break;
       }
-      case EnumCardActions.CopyLink: {
-        setIsCopied(true);
-        setTimeout(() => {
-          setIsCopied(false);
-          dispatch(SystemActions.setActivePopupId(null));
-        }, 1000);
-        return;
-      }
+      case EnumCardActions.CopyLink: {}
       case EnumCardActions.Duplicate: {
         dispatch(TodosActions.effect.duplicate({ todoId: todoId! }));

[NoCoverage] BooleanLiteral
src/components/CardContextMenu/index.tsx:132:21
         break;
       }
       case EnumCardActions.CopyLink: {
-        setIsCopied(true);
+        setIsCopied(false);
         setTimeout(() => {
           setIsCopied(false);

[NoCoverage] ConditionalExpression
src/components/CardContextMenu/index.tsx:139:7
         }, 1000);
         return;
       }
-      case EnumCardActions.Duplicate: {
-        dispatch(TodosActions.effect.duplicate({ todoId: todoId! }));
-        break;
-      }
+      case EnumCardActions.Duplicate:
       case EnumCardActions.AddCardBelow: {
         dispatch(TodosActions.removeTemp());

[NoCoverage] BlockStatement
src/components/CardContextMenu/index.tsx:139:39
         }, 1000);
         return;
       }
-      case EnumCardActions.Duplicate: {
-        dispatch(TodosActions.effect.duplicate({ todoId: todoId! }));
-        break;
-      }
+      case EnumCardActions.Duplicate: {}
       case EnumCardActions.AddCardBelow: {
         dispatch(TodosActions.removeTemp());

[NoCoverage] BlockStatement
src/components/CardContextMenu/index.tsx:143:42
         dispatch(TodosActions.effect.duplicate({ todoId: todoId! }));
         break;
       }
-      case EnumCardActions.AddCardBelow: {
-        dispatch(TodosActions.removeTemp());
-        dispatch(TodosActions.drawBelow({
-          belowId: todoId!,
-          columnId: columnId!,
-        }));
-        break;
-      }
+      case EnumCardActions.AddCardBelow: {}
       case EnumCardActions.Archive: {
         dispatch(TodosActions.effect.update({

[NoCoverage] ConditionalExpression
src/components/CardContextMenu/index.tsx:143:7
         dispatch(TodosActions.effect.duplicate({ todoId: todoId! }));
         break;
       }
-      case EnumCardActions.AddCardBelow: {
-        dispatch(TodosActions.removeTemp());
-        dispatch(TodosActions.drawBelow({
-          belowId: todoId!,
-          columnId: columnId!,
-        }));
-        break;
-      }
+      case EnumCardActions.AddCardBelow:
       case EnumCardActions.Archive: {
         dispatch(TodosActions.effect.update({

[NoCoverage] ConditionalExpression
src/components/CardContextMenu/index.tsx:151:7
         }));
         break;
       }
-      case EnumCardActions.Archive: {
-        dispatch(TodosActions.effect.update({
-          id: todoId!,
-          isArchived: !isArchived,
-        }));
-        break;
-      }
+      case EnumCardActions.Archive:
       case EnumCardActions.Delete: {
         dispatch(TodosActions.effect.update({ id: todoId!, isRemoved: true }));

[NoCoverage] BlockStatement
src/components/CardContextMenu/index.tsx:151:37
         }));
         break;
       }
-      case EnumCardActions.Archive: {
-        dispatch(TodosActions.effect.update({
-          id: todoId!,
-          isArchived: !isArchived,
-        }));
-        break;
-      }
+      case EnumCardActions.Archive: {}
       case EnumCardActions.Delete: {
         dispatch(TodosActions.effect.update({ id: todoId!, isRemoved: true }));

[NoCoverage] BooleanLiteral
src/components/CardContextMenu/index.tsx:154:23
       case EnumCardActions.Archive: {
         dispatch(TodosActions.effect.update({
           id: todoId!,
-          isArchived: !isArchived,
+          isArchived: isArchived,
         }));
         break;

[NoCoverage] ConditionalExpression
src/components/CardContextMenu/index.tsx:158:7
         }));
         break;
       }
-      case EnumCardActions.Delete: {
-        dispatch(TodosActions.effect.update({ id: todoId!, isRemoved: true }));
-        dispatch(TodosActions.remove({ id: todoId! }));
-        break;
-      }
+      case EnumCardActions.Delete:
       case EnumCardActions.Restore: {
         dispatch(TodosActions.effect.update({ id: todoId!, isRemoved: false }));

[NoCoverage] BlockStatement
src/components/CardContextMenu/index.tsx:158:36
         }));
         break;
       }
-      case EnumCardActions.Delete: {
-        dispatch(TodosActions.effect.update({ id: todoId!, isRemoved: true }));
-        dispatch(TodosActions.remove({ id: todoId! }));
-        break;
-      }
+      case EnumCardActions.Delete: {}
       case EnumCardActions.Restore: {
         dispatch(TodosActions.effect.update({ id: todoId!, isRemoved: false }));

[NoCoverage] BooleanLiteral
src/components/CardContextMenu/index.tsx:159:71
         break;
       }
       case EnumCardActions.Delete: {
-        dispatch(TodosActions.effect.update({ id: todoId!, isRemoved: true }));
+        dispatch(TodosActions.effect.update({ id: todoId!, isRemoved: false }));
         dispatch(TodosActions.remove({ id: todoId! }));
         break;

[NoCoverage] ConditionalExpression
src/components/CardContextMenu/index.tsx:163:7
         dispatch(TodosActions.remove({ id: todoId! }));
         break;
       }
-      case EnumCardActions.Restore: {
-        dispatch(TodosActions.effect.update({ id: todoId!, isRemoved: false }));
-        dispatch(TodosActions.remove({ id: todoId! }));
-        break;
-      }
+      case EnumCardActions.Restore:
       default: break;
     }

[NoCoverage] BlockStatement
src/components/CardContextMenu/index.tsx:163:37
         dispatch(TodosActions.remove({ id: todoId! }));
         break;
       }
-      case EnumCardActions.Restore: {
-        dispatch(TodosActions.effect.update({ id: todoId!, isRemoved: false }));
-        dispatch(TodosActions.remove({ id: todoId! }));
-        break;
-      }
+      case EnumCardActions.Restore: {}
       default: break;
     }

[NoCoverage] BooleanLiteral
src/components/CardContextMenu/index.tsx:164:71
         break;
       }
       case EnumCardActions.Restore: {
-        dispatch(TodosActions.effect.update({ id: todoId!, isRemoved: false }));
+        dispatch(TodosActions.effect.update({ id: todoId!, isRemoved: true }));
         dispatch(TodosActions.remove({ id: todoId! }));
         break;

[NoCoverage] BlockStatement
src/components/CardContextMenu/index.tsx:174:19
 
   const activePopupId = useSelector(getActivePopupId);
 
-  useEffect(() => {
-    setIsOpenDatePicker(false);
-  }, [activePopupId]);
+  useEffect(() => {}, [activePopupId]);
 
   const handleSelectDate = (selectedDate: Date | null) => {

[NoCoverage] BooleanLiteral
src/components/CardContextMenu/index.tsx:175:25
   const activePopupId = useSelector(getActivePopupId);
 
   useEffect(() => {
-    setIsOpenDatePicker(false);
+    setIsOpenDatePicker(true);
   }, [activePopupId]);
 

[NoCoverage] BlockStatement
src/components/CardContextMenu/index.tsx:178:59
     setIsOpenDatePicker(false);
   }, [activePopupId]);
 
-  const handleSelectDate = (selectedDate: Date | null) => {
-    dispatch(SystemActions.setActivePopupId(null));
-    dispatch(TodosActions.effect.update({
-      id: todoId!,
-      expirationDate: selectedDate,
-    }));
-  };
+  const handleSelectDate = (selectedDate: Date | null) => {};
 
   const buttons = isRemoved ? [

[NoCoverage] ObjectLiteral
src/components/CardContextMenu/index.tsx:180:41
 
   const handleSelectDate = (selectedDate: Date | null) => {
     dispatch(SystemActions.setActivePopupId(null));
-    dispatch(TodosActions.effect.update({
-      id: todoId!,
-      expirationDate: selectedDate,
-    }));
+    dispatch(TodosActions.effect.update({}));
   };
 

[NoCoverage] StringLiteral
src/components/CardContextMenu/index.tsx:189:15
   const buttons = isRemoved ? [
     <MenuItem
       key={15}
-      text={t('Restore')}
+      text={t("")}
       imageSrc="/assets/svg/menu/restore.svg"
       action={EnumCardActions.Restore}

[NoCoverage] ArrowFunction
src/components/CardContextMenu/index.tsx:194:15
       action={EnumCardActions.Restore}
     />] : [<ColorPicker
       key={0}
-      onPick={(newColor) => handleMenuButtonClick(EnumCardActions.ChangeColor, newColor)}
+      onPick={() => undefined}
       activeColor={color}
     />,

[NoCoverage] StringLiteral
src/components/CardContextMenu/index.tsx:211:17
       />,
       <MenuItem
         key={3}
-        text={t('Add date')}
+        text={t("")}
         imageSrc="/assets/svg/menu/add-date.svg"
         action={EnumCardActions.AddDate}

[NoCoverage] BooleanLiteral
src/components/CardContextMenu/index.tsx:214:22
         text={t('Add date')}
         imageSrc="/assets/svg/menu/add-date.svg"
         action={EnumCardActions.AddDate}
-        isAutoClose={false}
+        isAutoClose={true}
       />,
       <Submenu

[NoCoverage] StringLiteral
src/components/CardContextMenu/index.tsx:222:19
         imageSrc="/assets/svg/menu/complete.svg"
       >
         <MenuItem
-          text={t('Mark as to do')}
+          text={t("")}
           imageSrc="/assets/svg/menu/rounded-square.svg"
           hintImageSrc={`${status === EnumTodoStatus.Todo ? '/assets/svg/menu/tick.svg' : ''}`}

[NoCoverage] ConditionalExpression
src/components/CardContextMenu/index.tsx:224:28
         <MenuItem
           text={t('Mark as to do')}
           imageSrc="/assets/svg/menu/rounded-square.svg"
-          hintImageSrc={`${status === EnumTodoStatus.Todo ? '/assets/svg/menu/tick.svg' : ''}`}
+          hintImageSrc={`${true ? '/assets/svg/menu/tick.svg' : ''}`}
           isColoredHintImage
           action={EnumCardActions.CompleteStatus}

[NoCoverage] ConditionalExpression
src/components/CardContextMenu/index.tsx:224:28
         <MenuItem
           text={t('Mark as to do')}
           imageSrc="/assets/svg/menu/rounded-square.svg"
-          hintImageSrc={`${status === EnumTodoStatus.Todo ? '/assets/svg/menu/tick.svg' : ''}`}
+          hintImageSrc={`${false ? '/assets/svg/menu/tick.svg' : ''}`}
           isColoredHintImage
           action={EnumCardActions.CompleteStatus}

[NoCoverage] EqualityOperator
src/components/CardContextMenu/index.tsx:232:28
         <MenuItem
           text={t('Mark as doing')}
           imageSrc="/assets/svg/menu/rounded-square-half-filled.svg"
-          hintImageSrc={`${status === EnumTodoStatus.Doing ? '/assets/svg/menu/tick.svg' : ''}`}
+          hintImageSrc={`${status !== EnumTodoStatus.Doing ? '/assets/svg/menu/tick.svg' : ''}`}
           isColoredHintImage
           action={EnumCardActions.CompleteStatus}

[NoCoverage] ConditionalExpression
src/components/CardContextMenu/index.tsx:232:28
         <MenuItem
           text={t('Mark as doing')}
           imageSrc="/assets/svg/menu/rounded-square-half-filled.svg"
-          hintImageSrc={`${status === EnumTodoStatus.Doing ? '/assets/svg/menu/tick.svg' : ''}`}
+          hintImageSrc={`${true ? '/assets/svg/menu/tick.svg' : ''}`}
           isColoredHintImage
           action={EnumCardActions.CompleteStatus}

[NoCoverage] StringLiteral
src/components/CardContextMenu/index.tsx:239:20
         >
           <span>Alt</span>
           +
-          <span>{t('Click')}</span>
+          <span>{t("")}</span>
           {t('on a checkbox to mark as doing')}
         </MenuItem>

[NoCoverage] ConditionalExpression
src/components/CardContextMenu/index.tsx:246:28
           key={5}
           text={t('Mark as done')}
           imageSrc="/assets/svg/menu/rounded-square-check.svg"
-          hintImageSrc={`${status === EnumTodoStatus.Done ? '/assets/svg/menu/tick.svg' : ''}`}
+          hintImageSrc={`${true ? '/assets/svg/menu/tick.svg' : ''}`}
           isColoredHintImage
           action={EnumCardActions.CompleteStatus}

[NoCoverage] EqualityOperator
src/components/CardContextMenu/index.tsx:246:28
           key={5}
           text={t('Mark as done')}
           imageSrc="/assets/svg/menu/rounded-square-check.svg"
-          hintImageSrc={`${status === EnumTodoStatus.Done ? '/assets/svg/menu/tick.svg' : ''}`}
+          hintImageSrc={`${status !== EnumTodoStatus.Done ? '/assets/svg/menu/tick.svg' : ''}`}
           isColoredHintImage
           action={EnumCardActions.CompleteStatus}

[NoCoverage] ConditionalExpression
src/components/CardContextMenu/index.tsx:255:28
           key={6}
           text={t('Mark as canceled')}
           imageSrc="/assets/svg/menu/rounded-square-canceled.svg"
-          hintImageSrc={`${status === EnumTodoStatus.Canceled ? '/assets/svg/menu/tick.svg' : ''}`}
+          hintImageSrc={`${false ? '/assets/svg/menu/tick.svg' : ''}`}
           isColoredHintImage
           action={EnumCardActions.CompleteStatus}

[NoCoverage] EqualityOperator
src/components/CardContextMenu/index.tsx:255:28
           key={6}
           text={t('Mark as canceled')}
           imageSrc="/assets/svg/menu/rounded-square-canceled.svg"
-          hintImageSrc={`${status === EnumTodoStatus.Canceled ? '/assets/svg/menu/tick.svg' : ''}`}
+          hintImageSrc={`${status !== EnumTodoStatus.Canceled ? '/assets/svg/menu/tick.svg' : ''}`}
           isColoredHintImage
           action={EnumCardActions.CompleteStatus}

[NoCoverage] StringLiteral
src/components/CardContextMenu/index.tsx:263:14
           <span>Shift</span>
           +
           <span>{t('Click')}</span>
-          {t('on a checkbox to mark as canceled')}
+          {t("")}
         </MenuItem>
       </Submenu>,

[NoCoverage] BlockStatement
src/components/CardContextMenu/index.tsx:284:23
         text={`verticals.xom9ik.com/${username}/${activeBoardReadableId}/card/${toReadableId(
           title, todoId,
         )}`} // TODO: move to env
-        onCopy={() => {
-          handleMenuButtonClick(EnumCardActions.CopyLink);
-        }}
+        onCopy={() => {}}
       >
         <MenuItem

[NoCoverage] StringLiteral
src/components/CardContextMenu/index.tsx:318:30
       />,
       <MenuItem
         key={14}
-        text={isArchived ? t('Unarchive') : t('Archive')}
+        text={isArchived ? t("") : t('Archive')}
         imageSrc={`/assets/svg/menu/archive${isArchived ? '' : '-close'}.svg`}
         action={EnumCardActions.Archive}

[NoCoverage] StringLiteral
src/components/CardContextMenu/index.tsx:324:17
       />,
       <MenuItem
         key={15}
-        text={t('Delete')}
+        text={t("")}
         imageSrc="/assets/svg/menu/remove.svg"
         hintText="⌫"

[NoCoverage] ConditionalExpression
src/components/CardContextMenu/index.tsx:331:25
       />,
   ];
 
-  return useMemo(() => (todoId && title ? (
+  return useMemo(() => (true ? (
     <Menu
       ref={menuButtonRef}

[NoCoverage] ConditionalExpression
src/components/CardContextMenu/index.tsx:331:25
       />,
   ];
 
-  return useMemo(() => (todoId && title ? (
+  return useMemo(() => (false ? (
     <Menu
       ref={menuButtonRef}

[NoCoverage] StringLiteral
src/components/CardContextMenu/index.tsx:334:11
   return useMemo(() => (todoId && title ? (
     <Menu
       ref={menuButtonRef}
-      id={`${menuId}-card-${todoId}`}
+      id={``}
       imageSrc={`/assets/svg/dots${isPrimary ? '-primary' : ''}.svg`}
       alt="menu"

[NoCoverage] StringLiteral
src/components/CardContextMenu/index.tsx:335:17
     <Menu
       ref={menuButtonRef}
       id={`${menuId}-card-${todoId}`}
-      imageSrc={`/assets/svg/dots${isPrimary ? '-primary' : ''}.svg`}
+      imageSrc={``}
       alt="menu"
       imageSize={imageSize || 22}

[NoCoverage] LogicalOperator
src/components/CardContextMenu/index.tsx:337:18
       id={`${menuId}-card-${todoId}`}
       imageSrc={`/assets/svg/dots${isPrimary ? '-primary' : ''}.svg`}
       alt="menu"
-      imageSize={imageSize || 22}
+      imageSize={imageSize && 22}
       size={size || 24}
       isInvisible

[NoCoverage] ConditionalExpression
src/components/CardContextMenu/index.tsx:337:18
       id={`${menuId}-card-${todoId}`}
       imageSrc={`/assets/svg/dots${isPrimary ? '-primary' : ''}.svg`}
       alt="menu"
-      imageSize={imageSize || 22}
+      imageSize={false}
       size={size || 24}
       isInvisible

[NoCoverage] ConditionalExpression
src/components/CardContextMenu/index.tsx:338:13
       imageSrc={`/assets/svg/dots${isPrimary ? '-primary' : ''}.svg`}
       alt="menu"
       imageSize={imageSize || 22}
-      size={size || 24}
+      size={true}
       isInvisible
       isColored={isColored}

[NoCoverage] ConditionalExpression
src/components/CardContextMenu/index.tsx:338:13
       imageSrc={`/assets/svg/dots${isPrimary ? '-primary' : ''}.svg`}
       alt="menu"
       imageSize={imageSize || 22}
-      size={size || 24}
+      size={false}
       isInvisible
       isColored={isColored}

[NoCoverage] StringLiteral
src/components/CardContextMenu/index.tsx:345:16
       isHoverBlock={isHover}
       position="right"
       style={isTransformedPosition ? {
-        float: 'right',
+        float: "",
       } : {}}
       width={isOpenDatePicker ? 328 : undefined}
