[NoCoverage] ArrowFunction
src/components/CardsContainer/index.tsx:49:31
 
   const todosCount = todos?.length;
 
-  const memoAddCard = useMemo(() => (
-    (!isDraggingCard && mode !== EnumColumnMode.New) && (
-      <ControlButton
-        imageSrc="/assets/svg/add.svg"
-        alt="add"
-        text={t('Add card')}
-        isInvisible
-        isMaxWidth
-        isHoverBlock={isHovering || todosCount === 0}
-        onClick={onAddCard}
-      />
-    )
-  ), [t, isHovering, isDraggingCard, isOpenNewCard, mode, todosCount]);
+  const memoAddCard = useMemo(() => undefined, [t, isHovering, isDraggingCard, isOpenNewCard, mode, todosCount]);
 
   const memoNewCard = useMemo(() => (

[NoCoverage] EqualityOperator
src/components/CardsContainer/index.tsx:50:25
   const todosCount = todos?.length;
 
   const memoAddCard = useMemo(() => (
-    (!isDraggingCard && mode !== EnumColumnMode.New) && (
+    (!isDraggingCard && mode === EnumColumnMode.New) && (
       <ControlButton
         imageSrc="/assets/svg/add.svg"

[NoCoverage] ConditionalExpression
src/components/CardsContainer/index.tsx:50:25
   const todosCount = todos?.length;
 
   const memoAddCard = useMemo(() => (
-    (!isDraggingCard && mode !== EnumColumnMode.New) && (
+    (!isDraggingCard && true) && (
       <ControlButton
         imageSrc="/assets/svg/add.svg"

[NoCoverage] EqualityOperator
src/components/CardsContainer/index.tsx:57:37
         text={t('Add card')}
         isInvisible
         isMaxWidth
-        isHoverBlock={isHovering || todosCount === 0}
+        isHoverBlock={isHovering || todosCount !== 0}
         onClick={onAddCard}
       />

[NoCoverage] ConditionalExpression
src/components/CardsContainer/index.tsx:57:37
         text={t('Add card')}
         isInvisible
         isMaxWidth
-        isHoverBlock={isHovering || todosCount === 0}
+        isHoverBlock={isHovering || false}
         onClick={onAddCard}
       />

[NoCoverage] ArrayDeclaration
src/components/CardsContainer/index.tsx:61:6
         onClick={onAddCard}
       />
     )
-  ), [t, isHovering, isDraggingCard, isOpenNewCard, mode, todosCount]);
+  ), []);
 
   const memoNewCard = useMemo(() => (

[NoCoverage] ArrowFunction
src/components/CardsContainer/index.tsx:63:31
     )
   ), [t, isHovering, isDraggingCard, isOpenNewCard, mode, todosCount]);
 
-  const memoNewCard = useMemo(() => (
-    <Card
-      todoId={NEW_TODO_ID}
-      columnId={columnId}
-      cardType={cardType}
-      isEditable
-      scrollToBottom={scrollToBottom}
-    />
-  ), [editableCardId]);
+  const memoNewCard = useMemo(() => undefined, [editableCardId]);
 
   return (

[NoCoverage] ArrayDeclaration
src/components/CardsContainer/index.tsx:71:6
       isEditable
       scrollToBottom={scrollToBottom}
     />
-  ), [editableCardId]);
+  ), []);
 
   return (

[NoCoverage] StringLiteral
src/components/CardsContainer/index.tsx:82:28
           ?.map((todo, index) => (
             <Draggable
               key={todo.id}
-              draggableId={`todo-${todo.id}`}
+              draggableId={``}
               index={index}
               isDragDisabled={isSearchMode || todo.belowId !== undefined}

[NoCoverage] ConditionalExpression
src/components/CardsContainer/index.tsx:84:47
               key={todo.id}
               draggableId={`todo-${todo.id}`}
               index={index}
-              isDragDisabled={isSearchMode || todo.belowId !== undefined}
+              isDragDisabled={isSearchMode || false}
             >
               {(

[NoCoverage] ConditionalExpression
src/components/CardsContainer/index.tsx:84:47
               key={todo.id}
               draggableId={`todo-${todo.id}`}
               index={index}
-              isDragDisabled={isSearchMode || todo.belowId !== undefined}
+              isDragDisabled={isSearchMode || true}
             >
               {(

[NoCoverage] EqualityOperator
src/components/CardsContainer/index.tsx:109:29
                   commentsCount={todo.commentsCount}
                   imagesCount={todo.imagesCount}
                   attachmentsCount={todo.attachmentsCount}
-                  isActive={activeTodoId === todo.id}
+                  isActive={activeTodoId !== todo.id}
                   isEditable={todo.id === editableCardId}
                   scrollToBottom={scrollToBottom}

[NoCoverage] ConditionalExpression
src/components/CardsContainer/index.tsx:109:29
                   commentsCount={todo.commentsCount}
                   imagesCount={todo.imagesCount}
                   attachmentsCount={todo.attachmentsCount}
-                  isActive={activeTodoId === todo.id}
+                  isActive={true}
                   isEditable={todo.id === editableCardId}
                   scrollToBottom={scrollToBottom}

[NoCoverage] ConditionalExpression
src/components/CardsContainer/index.tsx:110:31
                   imagesCount={todo.imagesCount}
                   attachmentsCount={todo.attachmentsCount}
                   isActive={activeTodoId === todo.id}
-                  isEditable={todo.id === editableCardId}
+                  isEditable={false}
                   scrollToBottom={scrollToBottom}
                 />

[NoCoverage] EqualityOperator
src/components/CardsContainer/index.tsx:110:31
                   imagesCount={todo.imagesCount}
                   attachmentsCount={todo.attachmentsCount}
                   isActive={activeTodoId === todo.id}
-                  isEditable={todo.id === editableCardId}
+                  isEditable={todo.id !== editableCardId}
                   scrollToBottom={scrollToBottom}
                 />

[NoCoverage] BooleanLiteral
src/components/CardsContainer/index.tsx:120:20
       <FallbackLoader
         isAbsolute
         size="small"
-        isLoading={!isLoadedTodos}
+        isLoading={isLoadedTodos}
       />
       {

[NoCoverage] ConditionalExpression
src/components/CardsContainer/index.tsx:123:9
         isLoading={!isLoadedTodos}
       />
       {
-        mode !== EnumColumnMode.Deleted && (
-        <>
-          {isOpenNewCard ? memoNewCard : memoAddCard}
-          {isDraggingCard && <div style={{ height: 78 }} />}
-        </>
-        )
+        false
       }
     </div>

[NoCoverage] ConditionalExpression
src/components/CardsContainer/index.tsx:123:9
         isLoading={!isLoadedTodos}
       />
       {
-        mode !== EnumColumnMode.Deleted && (
+        false && (
         <>
           {isOpenNewCard ? memoNewCard : memoAddCard}

[NoCoverage] LogicalOperator
src/components/CardsContainer/index.tsx:126:12
         mode !== EnumColumnMode.Deleted && (
         <>
           {isOpenNewCard ? memoNewCard : memoAddCard}
-          {isDraggingCard && <div style={{ height: 78 }} />}
+          {isDraggingCard || <div style={{
+  height: 78
+}} />}
         </>
         )

[NoCoverage] ConditionalExpression
src/components/CardsContainer/index.tsx:126:12
         mode !== EnumColumnMode.Deleted && (
         <>
           {isOpenNewCard ? memoNewCard : memoAddCard}
-          {isDraggingCard && <div style={{ height: 78 }} />}
+          {false}
         </>
         )
