[NoCoverage] ObjectLiteral
src/components/ColorPicker/ColorPicker.stories.tsx:7:13
 
 export default {
   title: 'ColorPicker',
-  argTypes: {
-    activeColor: {
-      control: {
-        type: 'select',
-        options: [...Object.values(EnumColors).filter((v) => typeof v === 'number'), null],
-      },
-      defaultValue: EnumColors.Turquoise,
-    },
-    onPick: { action: 'change color' },
-  },
+  argTypes: {},
 };
 

[NoCoverage] EqualityOperator
src/components/ColorPicker/ColorPicker.stories.tsx:11:62
     activeColor: {
       control: {
         type: 'select',
-        options: [...Object.values(EnumColors).filter((v) => typeof v === 'number'), null],
+        options: [...Object.values(EnumColors).filter((v) => typeof v !== 'number'), null],
       },
       defaultValue: EnumColors.Turquoise,

[NoCoverage] ArrowFunction
src/components/ColorPicker/ColorPicker.stories.tsx:11:55
     activeColor: {
       control: {
         type: 'select',
-        options: [...Object.values(EnumColors).filter((v) => typeof v === 'number'), null],
+        options: [...Object.values(EnumColors).filter(() => undefined), null],
       },
       defaultValue: EnumColors.Turquoise,

[NoCoverage] StringLiteral
src/components/ColorPicker/ColorPicker.stories.tsx:15:23
       },
       defaultValue: EnumColors.Turquoise,
     },
-    onPick: { action: 'change color' },
+    onPick: { action: "" },
   },
 };

[NoCoverage] ArrowFunction
src/components/ColorPicker/ColorPicker.stories.tsx:19:24
   },
 };
 
-export const Default = (args: any) => <ColorPicker {...args} />;
+export const Default = () => undefined;
 
