[NoCoverage] ArrowFunction
src/components/ColorPicker/index.tsx:11:35
 }
 
 export const ColorPicker: FC<IColorPicker> = ({ onPick, activeColor }) => {
-  const memoColorPicker = useMemo(() => (
-    <div className="color-picker">
-      {
-        Object.values(EnumColors)
-          .filter((v) => Number.isFinite(v))
-          .map((color, index) => {
-            const isActive = activeColor === index;
-            return (
-              <ColorSelector
-                key={colors[Number(color)]}
-                color={colors[Number(color)]}
-                isActive={isActive}
-                onClick={() => {
-                  onPick(isActive ? null : index);
-                }}
-              />
-            );
-          })
-        }
-    </div>
-  ), [activeColor, onPick]);
+  const memoColorPicker = useMemo(() => undefined, [activeColor, onPick]);
 
   return (

[NoCoverage] ArrowFunction
src/components/ColorPicker/index.tsx:15:19
     <div className="color-picker">
       {
         Object.values(EnumColors)
-          .filter((v) => Number.isFinite(v))
+          .filter(() => undefined)
           .map((color, index) => {
             const isActive = activeColor === index;

[NoCoverage] BlockStatement
src/components/ColorPicker/index.tsx:16:34
       {
         Object.values(EnumColors)
           .filter((v) => Number.isFinite(v))
-          .map((color, index) => {
-            const isActive = activeColor === index;
-            return (
-              <ColorSelector
-                key={colors[Number(color)]}
-                color={colors[Number(color)]}
-                isActive={isActive}
-                onClick={() => {
-                  onPick(isActive ? null : index);
-                }}
-              />
-            );
-          })
+          .map((color, index) => {})
         }
     </div>

[NoCoverage] ConditionalExpression
src/components/ColorPicker/index.tsx:17:30
         Object.values(EnumColors)
           .filter((v) => Number.isFinite(v))
           .map((color, index) => {
-            const isActive = activeColor === index;
+            const isActive = true;
             return (
               <ColorSelector

[NoCoverage] ConditionalExpression
src/components/ColorPicker/index.tsx:17:30
         Object.values(EnumColors)
           .filter((v) => Number.isFinite(v))
           .map((color, index) => {
-            const isActive = activeColor === index;
+            const isActive = false;
             return (
               <ColorSelector

[NoCoverage] BlockStatement
src/components/ColorPicker/index.tsx:23:32
                 key={colors[Number(color)]}
                 color={colors[Number(color)]}
                 isActive={isActive}
-                onClick={() => {
-                  onPick(isActive ? null : index);
-                }}
+                onClick={() => {}}
               />
             );
