[NoCoverage] StringLiteral
src/components/ColorSelector/ColorSelector.stories.tsx:6:10
 import { colors } from '@type/entities';
 
 export default {
-  title: 'ColorSelector',
+  title: "",
   argTypes: {
     color: {

[NoCoverage] ObjectLiteral
src/components/ColorSelector/ColorSelector.stories.tsx:8:12
 export default {
   title: 'ColorSelector',
   argTypes: {
-    color: {
-      control: {
-        type: 'color',
-      },
-      defaultValue: colors[2],
-    },
+    color: {},
     isActive: { control: { type: 'boolean' }, defaultValue: false },
     onClick: { action: 'pick color' },

[NoCoverage] ObjectLiteral
src/components/ColorSelector/ColorSelector.stories.tsx:9:16
   title: 'ColorSelector',
   argTypes: {
     color: {
-      control: {
-        type: 'color',
-      },
+      control: {},
       defaultValue: colors[2],
     },

[NoCoverage] ObjectLiteral
src/components/ColorSelector/ColorSelector.stories.tsx:14:26
       },
       defaultValue: colors[2],
     },
-    isActive: { control: { type: 'boolean' }, defaultValue: false },
+    isActive: { control: {}, defaultValue: false },
     onClick: { action: 'pick color' },
   },

[NoCoverage] ObjectLiteral
src/components/ColorSelector/ColorSelector.stories.tsx:15:14
       defaultValue: colors[2],
     },
     isActive: { control: { type: 'boolean' }, defaultValue: false },
-    onClick: { action: 'pick color' },
+    onClick: {},
   },
 };

[NoCoverage] StringLiteral
src/components/ColorSelector/ColorSelector.stories.tsx:15:24
       defaultValue: colors[2],
     },
     isActive: { control: { type: 'boolean' }, defaultValue: false },
-    onClick: { action: 'pick color' },
+    onClick: { action: "" },
   },
 };

[NoCoverage] ArrowFunction
src/components/ColorSelector/ColorSelector.stories.tsx:19:24
   },
 };
 
-export const Default = (args: any) => <ColorSelector {...args} />;
+export const Default = () => undefined;
 
