[NoCoverage] BlockStatement
src/components/Column/index.tsx:52:29
   const cardType = useParamSelector(getBoardCardType, boardId);
   const isSearchMode = useSelector(getIsSearchMode);
 
-  const handleClick = () => {
-    if (mode === EnumColumnMode.Normal) {
-      dispatch(ColumnsActions.effect.update({
-        id: columnId!,
-        isCollapsed: !isCollapsed,
-      }));
-    }
-  };
+  const handleClick = () => {};
 
   const draggableId = `column-${columnId || 'undraggable'}`;

[NoCoverage] ConditionalExpression
src/components/Column/index.tsx:53:9
   const isSearchMode = useSelector(getIsSearchMode);
 
   const handleClick = () => {
-    if (mode === EnumColumnMode.Normal) {
+    if (true) {
       dispatch(ColumnsActions.effect.update({
         id: columnId!,

[NoCoverage] EqualityOperator
src/components/Column/index.tsx:53:9
   const isSearchMode = useSelector(getIsSearchMode);
 
   const handleClick = () => {
-    if (mode === EnumColumnMode.Normal) {
+    if (mode !== EnumColumnMode.Normal) {
       dispatch(ColumnsActions.effect.update({
         id: columnId!,

[NoCoverage] BooleanLiteral
src/components/Column/index.tsx:56:22
     if (mode === EnumColumnMode.Normal) {
       dispatch(ColumnsActions.effect.update({
         id: columnId!,
-        isCollapsed: !isCollapsed,
+        isCollapsed: isCollapsed,
       }));
     }

[NoCoverage] ConditionalExpression
src/components/Column/index.tsx:61:33
     }
   };
 
-  const draggableId = `column-${columnId || 'undraggable'}`;
+  const draggableId = `column-${true}`;
   const isDragDisabled = mode !== EnumColumnMode.Normal || isSearchMode;
 

[NoCoverage] LogicalOperator
src/components/Column/index.tsx:61:33
     }
   };
 
-  const draggableId = `column-${columnId || 'undraggable'}`;
+  const draggableId = `column-${columnId && 'undraggable'}`;
   const isDragDisabled = mode !== EnumColumnMode.Normal || isSearchMode;
 

[NoCoverage] EqualityOperator
src/components/Column/index.tsx:62:26
   };
 
   const draggableId = `column-${columnId || 'undraggable'}`;
-  const isDragDisabled = mode !== EnumColumnMode.Normal || isSearchMode;
+  const isDragDisabled = mode === EnumColumnMode.Normal || isSearchMode;
 
   const memoColumn = useMemo(() => (

[NoCoverage] LogicalOperator
src/components/Column/index.tsx:62:26
   };
 
   const draggableId = `column-${columnId || 'undraggable'}`;
-  const isDragDisabled = mode !== EnumColumnMode.Normal || isSearchMode;
+  const isDragDisabled = mode !== EnumColumnMode.Normal && isSearchMode;
 
   const memoColumn = useMemo(() => (
