[NoCoverage] BooleanLiteral
src/components/ColumnContextMenu/index.tsx:31:15
 }
 
 export const ColumnContextMenu: FC<IColumnContextMenu> = ({
-  isEnabled = true,
+  isEnabled = false,
   columnId,
   boardId,

[NoCoverage] BlockStatement
src/components/ColumnContextMenu/index.tsx:42:49
   const { t } = useTranslation();
   const dispatch = useDispatch();
 
-  const handleColorPick = (newColor: IColor) => {
-    dispatch(ColumnsActions.effect.update({ id: columnId, color: newColor }));
-  };
+  const handleColorPick = (newColor: IColor) => {};
 
   const handleMenuButtonClick = (action: EnumMenuActions) => {

[NoCoverage] BlockStatement
src/components/ColumnContextMenu/index.tsx:48:40
 
   const handleMenuButtonClick = (action: EnumMenuActions) => {
     switch (action) {
-      case EnumMenuActions.EditColumn: {
-        dispatch(SystemActions.setEditableColumnId(columnId));
-        break;
-      }
+      case EnumMenuActions.EditColumn: {}
       case EnumMenuActions.Duplicate: {
         dispatch(ColumnsActions.effect.duplicate({

[NoCoverage] ConditionalExpression
src/components/ColumnContextMenu/index.tsx:48:7
 
   const handleMenuButtonClick = (action: EnumMenuActions) => {
     switch (action) {
-      case EnumMenuActions.EditColumn: {
-        dispatch(SystemActions.setEditableColumnId(columnId));
-        break;
-      }
+      case EnumMenuActions.EditColumn:
       case EnumMenuActions.Duplicate: {
         dispatch(ColumnsActions.effect.duplicate({

[NoCoverage] ConditionalExpression
src/components/ColumnContextMenu/index.tsx:52:7
         dispatch(SystemActions.setEditableColumnId(columnId));
         break;
       }
-      case EnumMenuActions.Duplicate: {
-        dispatch(ColumnsActions.effect.duplicate({
-          columnId: columnId!,
-        }));
-        break;
-      }
+      case EnumMenuActions.Duplicate:
       case EnumMenuActions.AddCard: {
         onAddCard();

[NoCoverage] BlockStatement
src/components/ColumnContextMenu/index.tsx:52:39
         dispatch(SystemActions.setEditableColumnId(columnId));
         break;
       }
-      case EnumMenuActions.Duplicate: {
-        dispatch(ColumnsActions.effect.duplicate({
-          columnId: columnId!,
-        }));
-        break;
-      }
+      case EnumMenuActions.Duplicate: {}
       case EnumMenuActions.AddCard: {
         onAddCard();

[NoCoverage] BlockStatement
src/components/ColumnContextMenu/index.tsx:58:37
         }));
         break;
       }
-      case EnumMenuActions.AddCard: {
-        onAddCard();
-        break;
-      }
+      case EnumMenuActions.AddCard: {}
       case EnumMenuActions.AddHeading: {
         // TODO:

[NoCoverage] ConditionalExpression
src/components/ColumnContextMenu/index.tsx:58:7
         }));
         break;
       }
-      case EnumMenuActions.AddCard: {
-        onAddCard();
-        break;
-      }
+      case EnumMenuActions.AddCard:
       case EnumMenuActions.AddHeading: {
         // TODO:

[NoCoverage] ConditionalExpression
src/components/ColumnContextMenu/index.tsx:62:7
         onAddCard();
         break;
       }
-      case EnumMenuActions.AddHeading: {
-        // TODO:
-        break;
-      }
+      case EnumMenuActions.AddHeading:
       case EnumMenuActions.AddColumnAfter: {
         dispatch(ColumnsActions.removeTemp());

[NoCoverage] BlockStatement
src/components/ColumnContextMenu/index.tsx:62:40
         onAddCard();
         break;
       }
-      case EnumMenuActions.AddHeading: {
-        // TODO:
-        break;
-      }
+      case EnumMenuActions.AddHeading: {}
       case EnumMenuActions.AddColumnAfter: {
         dispatch(ColumnsActions.removeTemp());

[NoCoverage] ConditionalExpression
src/components/ColumnContextMenu/index.tsx:66:7
         // TODO:
         break;
       }
-      case EnumMenuActions.AddColumnAfter: {
-        dispatch(ColumnsActions.removeTemp());
-        dispatch(ColumnsActions.drawBelow({
-          belowId: columnId,
-          boardId: boardId!,
-        }));
-        break;
-      }
+      case EnumMenuActions.AddColumnAfter:
       case EnumMenuActions.Delete: {
         dispatch(ColumnsActions.effect.remove({ id: columnId }));

[NoCoverage] BlockStatement
src/components/ColumnContextMenu/index.tsx:66:44
         // TODO:
         break;
       }
-      case EnumMenuActions.AddColumnAfter: {
-        dispatch(ColumnsActions.removeTemp());
-        dispatch(ColumnsActions.drawBelow({
-          belowId: columnId,
-          boardId: boardId!,
-        }));
-        break;
-      }
+      case EnumMenuActions.AddColumnAfter: {}
       case EnumMenuActions.Delete: {
         dispatch(ColumnsActions.effect.remove({ id: columnId }));

[NoCoverage] ConditionalExpression
src/components/ColumnContextMenu/index.tsx:74:7
         }));
         break;
       }
-      case EnumMenuActions.Delete: {
-        dispatch(ColumnsActions.effect.remove({ id: columnId }));
-        break;
-      }
+      case EnumMenuActions.Delete:
       default: break;
     }

[NoCoverage] BlockStatement
src/components/ColumnContextMenu/index.tsx:74:36
         }));
         break;
       }
-      case EnumMenuActions.Delete: {
-        dispatch(ColumnsActions.effect.remove({ id: columnId }));
-        break;
-      }
+      case EnumMenuActions.Delete: {}
       default: break;
     }

[NoCoverage] StringLiteral
src/components/ColumnContextMenu/index.tsx:84:11
 
   return useMemo(() => (isEnabled ? (
     <Menu
-      id={`column-${columnId}`}
+      id={``}
       imageSrc="/assets/svg/dots.svg"
       alt="menu"

[NoCoverage] StringLiteral
src/components/ColumnContextMenu/index.tsx:124:17
         action={EnumMenuActions.AddHeading}
       />
       <MenuItem
-        text={t('Add column after')}
+        text={t("")}
         imageSrc="/assets/svg/menu/add-column.svg"
         action={EnumMenuActions.AddColumnAfter}

[NoCoverage] StringLiteral
src/components/ColumnContextMenu/index.tsx:130:17
       />
       <Divider verticalSpacer={7} horizontalSpacer={10} />
       <MenuItem
-        text={t('Delete')}
+        text={t("")}
         imageSrc="/assets/svg/menu/remove.svg"
         hintText="⌫"

[NoCoverage] ArrayDeclaration
src/components/ColumnContextMenu/index.tsx:137:3
       />
     </Menu>
   ) : null),
-  [t, columnId, isEnabled, isHide, isHover, color]);
+  []);
 };
 
