[NoCoverage] ConditionalExpression
src/components/ColumnHeader/index.tsx:65:9
   useFocus(titleInputRef, [isEditable]);
 
   const saveColumnHeader = () => {
-    if (!isEditable) return;
+    if (true) return;
     const normalizedTitleValue = titleValue.trim();
     const normalizedDescriptionValue = descriptionValue?.trim();

[NoCoverage] BooleanLiteral
src/components/ColumnHeader/index.tsx:65:9
   useFocus(titleInputRef, [isEditable]);
 
   const saveColumnHeader = () => {
-    if (!isEditable) return;
+    if (isEditable) return;
     const normalizedTitleValue = titleValue.trim();
     const normalizedDescriptionValue = descriptionValue?.trim();

[NoCoverage] LogicalOperator
src/components/ColumnHeader/index.tsx:69:9
     const normalizedTitleValue = titleValue.trim();
     const normalizedDescriptionValue = descriptionValue?.trim();
 
-    if (mode === EnumColumnMode.Normal && belowId === undefined) {
+    if (mode === EnumColumnMode.Normal || belowId === undefined) {
       const isNew = isNewValues([title, normalizedTitleValue], [description, normalizedDescriptionValue]);
       if (normalizedTitleValue && isNew) {

[NoCoverage] ConditionalExpression
src/components/ColumnHeader/index.tsx:69:43
     const normalizedTitleValue = titleValue.trim();
     const normalizedDescriptionValue = descriptionValue?.trim();
 
-    if (mode === EnumColumnMode.Normal && belowId === undefined) {
+    if (mode === EnumColumnMode.Normal && false) {
       const isNew = isNewValues([title, normalizedTitleValue], [description, normalizedDescriptionValue]);
       if (normalizedTitleValue && isNew) {

[NoCoverage] BlockStatement
src/components/ColumnHeader/index.tsx:71:42
 
     if (mode === EnumColumnMode.Normal && belowId === undefined) {
       const isNew = isNewValues([title, normalizedTitleValue], [description, normalizedDescriptionValue]);
-      if (normalizedTitleValue && isNew) {
-        dispatch(ColumnsActions.effect.update({
-          id: columnId,
-          title: normalizedTitleValue,
-          description: normalizedDescriptionValue,
-        }));
-      } else {
+      if (normalizedTitleValue && isNew) {} else {
         setTitleValue(title);
         setDescriptionValue(description);

[NoCoverage] ObjectLiteral
src/components/ColumnHeader/index.tsx:72:47
     if (mode === EnumColumnMode.Normal && belowId === undefined) {
       const isNew = isNewValues([title, normalizedTitleValue], [description, normalizedDescriptionValue]);
       if (normalizedTitleValue && isNew) {
-        dispatch(ColumnsActions.effect.update({
-          id: columnId,
-          title: normalizedTitleValue,
-          description: normalizedDescriptionValue,
-        }));
+        dispatch(ColumnsActions.effect.update({}));
       } else {
         setTitleValue(title);

[NoCoverage] EqualityOperator
src/components/ColumnHeader/index.tsx:83:9
       }
       dispatch(SystemActions.setEditableColumnId(null));
     }
-    if (mode === EnumColumnMode.New || belowId !== undefined) {
+    if (mode !== EnumColumnMode.New || belowId !== undefined) {
       if (normalizedTitleValue) {
         dispatch(ColumnsActions.effect.create({

[NoCoverage] ConditionalExpression
src/components/ColumnHeader/index.tsx:83:40
       }
       dispatch(SystemActions.setEditableColumnId(null));
     }
-    if (mode === EnumColumnMode.New || belowId !== undefined) {
+    if (mode === EnumColumnMode.New || true) {
       if (normalizedTitleValue) {
         dispatch(ColumnsActions.effect.create({

[NoCoverage] ConditionalExpression
src/components/ColumnHeader/index.tsx:84:11
       dispatch(SystemActions.setEditableColumnId(null));
     }
     if (mode === EnumColumnMode.New || belowId !== undefined) {
-      if (normalizedTitleValue) {
+      if (false) {
         dispatch(ColumnsActions.effect.create({
           title: normalizedTitleValue,

[NoCoverage] ConditionalExpression
src/components/ColumnHeader/index.tsx:84:11
       dispatch(SystemActions.setEditableColumnId(null));
     }
     if (mode === EnumColumnMode.New || belowId !== undefined) {
-      if (normalizedTitleValue) {
+      if (true) {
         dispatch(ColumnsActions.effect.create({
           title: normalizedTitleValue,

[NoCoverage] ObjectLiteral
src/components/ColumnHeader/index.tsx:85:47
     }
     if (mode === EnumColumnMode.New || belowId !== undefined) {
       if (normalizedTitleValue) {
-        dispatch(ColumnsActions.effect.create({
-          title: normalizedTitleValue,
-          description: normalizedDescriptionValue,
-          boardId,
-          belowId,
-        }));
+        dispatch(ColumnsActions.effect.create({}));
       } else {
         dispatch(SystemActions.setEditableColumnId(null));

[NoCoverage] BlockStatement
src/components/ColumnHeader/index.tsx:91:14
           boardId,
           belowId,
         }));
-      } else {
-        dispatch(SystemActions.setEditableColumnId(null));
-      }
+      } else {}
       if (belowId !== undefined) {
         dispatch(SystemActions.setEditableColumnId(null));

[NoCoverage] BlockStatement
src/components/ColumnHeader/index.tsx:96:14
       }
       if (belowId !== undefined) {
         dispatch(SystemActions.setEditableColumnId(null));
-      } else {
-        setTitleValue('');
-        setDescriptionValue('');
-        setTimeout(() => {
-          scrollToRight?.();
-        }, 200);
-      }
+      } else {}
     }
   };

[NoCoverage] StringLiteral
src/components/ColumnHeader/index.tsx:98:29
         dispatch(SystemActions.setEditableColumnId(null));
       } else {
         setTitleValue('');
-        setDescriptionValue('');
+        setDescriptionValue("Stryker was here!");
         setTimeout(() => {
           scrollToRight?.();

[NoCoverage] BlockStatement
src/components/ColumnHeader/index.tsx:99:26
       } else {
         setTitleValue('');
         setDescriptionValue('');
-        setTimeout(() => {
-          scrollToRight?.();
-        }, 200);
+        setTimeout(() => {}, 200);
       }
     }

[NoCoverage] BlockStatement
src/components/ColumnHeader/index.tsx:106:27
     }
   };
 
-  const handleEsc = () => {
-    dispatch(SystemActions.setEditableColumnId(null));
-    saveColumnHeader();
-  };
+  const handleEsc = () => {};
 
   const [headerRef] = useOutsideClickRef(saveColumnHeader, isEditable);

[NoCoverage] BlockStatement
src/components/ColumnHeader/index.tsx:119:51
     when: isEditable,
   });
 
-  const handleKeyDown = (event: KeyboardEvent) => {
-    const { key, ctrlKey, shiftKey } = event;
-    if (key === 'Enter' && !ctrlKey && !shiftKey) {
-      saveColumnHeader();
-    }
-  };
+  const handleKeyDown = (event: KeyboardEvent) => {};
 
   const handleChange = (event: any, isDescription: boolean) => {

[NoCoverage] BooleanLiteral
src/components/ColumnHeader/index.tsx:121:40
 
   const handleKeyDown = (event: KeyboardEvent) => {
     const { key, ctrlKey, shiftKey } = event;
-    if (key === 'Enter' && !ctrlKey && !shiftKey) {
+    if (key === 'Enter' && !ctrlKey && shiftKey) {
       saveColumnHeader();
     }

[NoCoverage] ArrowFunction
src/components/ColumnHeader/index.tsx:133:29
       : setTitleValue(value);
   };
 
-  const memoTitle = useMemo(() => (
-    (mode !== EnumColumnMode.New || isEditable) && (
-      <div className="column__header-container">
-        {
-          isEditable ? (
-            <TextArea
-              ref={titleInputRef}
-              className="column__title column__title--editable"
-              value={titleValue}
-              placeholder={t('New column')}
-              minRows={1}
-              maxRows={4}
-              onKeyDown={shiftEnterRestriction}
-              onKeyDownCapture={(event) => handleKeyDown(event)}
-              onChange={(event) => handleChange(event, false)}
-            />
-          ) : (
-            <span className={cn('column__title', { 'column__title--empty': !titleValue })}>
-              {titleValue || t('New column')}
-            </span>
-          )
-        }
-      </div>
-    )
-  ), [t, mode, isEditable, titleValue]);
+  const memoTitle = useMemo(() => undefined, [t, mode, isEditable, titleValue]);
 
   const memoDescription = useMemo(() => (mode !== EnumColumnMode.New || isEditable) && (

[NoCoverage] ConditionalExpression
src/components/ColumnHeader/index.tsx:134:6
   };
 
   const memoTitle = useMemo(() => (
-    (mode !== EnumColumnMode.New || isEditable) && (
+    (true) && (
       <div className="column__header-container">
         {

[NoCoverage] ConditionalExpression
src/components/ColumnHeader/index.tsx:134:6
   };
 
   const memoTitle = useMemo(() => (
-    (mode !== EnumColumnMode.New || isEditable) && (
+    (true || isEditable) && (
       <div className="column__header-container">
         {

[NoCoverage] ArrowFunction
src/components/ColumnHeader/index.tsx:146:33
               minRows={1}
               maxRows={4}
               onKeyDown={shiftEnterRestriction}
-              onKeyDownCapture={(event) => handleKeyDown(event)}
+              onKeyDownCapture={() => undefined}
               onChange={(event) => handleChange(event, false)}
             />

[NoCoverage] BooleanLiteral
src/components/ColumnHeader/index.tsx:147:56
               maxRows={4}
               onKeyDown={shiftEnterRestriction}
               onKeyDownCapture={(event) => handleKeyDown(event)}
-              onChange={(event) => handleChange(event, false)}
+              onChange={(event) => handleChange(event, true)}
             />
           ) : (

[NoCoverage] ArrowFunction
src/components/ColumnHeader/index.tsx:147:25
               maxRows={4}
               onKeyDown={shiftEnterRestriction}
               onKeyDownCapture={(event) => handleKeyDown(event)}
-              onChange={(event) => handleChange(event, false)}
+              onChange={() => undefined}
             />
           ) : (

[NoCoverage] BooleanLiteral
src/components/ColumnHeader/index.tsx:150:76
               onChange={(event) => handleChange(event, false)}
             />
           ) : (
-            <span className={cn('column__title', { 'column__title--empty': !titleValue })}>
+            <span className={cn('column__title', { 'column__title--empty': titleValue })}>
               {titleValue || t('New column')}
             </span>

[NoCoverage] ConditionalExpression
src/components/ColumnHeader/index.tsx:151:16
             />
           ) : (
             <span className={cn('column__title', { 'column__title--empty': !titleValue })}>
-              {titleValue || t('New column')}
+              {true}
             </span>
           )

[NoCoverage] LogicalOperator
src/components/ColumnHeader/index.tsx:151:16
             />
           ) : (
             <span className={cn('column__title', { 'column__title--empty': !titleValue })}>
-              {titleValue || t('New column')}
+              {titleValue && t('New column')}
             </span>
           )

[NoCoverage] ConditionalExpression
src/components/ColumnHeader/index.tsx:159:42
     )
   ), [t, mode, isEditable, titleValue]);
 
-  const memoDescription = useMemo(() => (mode !== EnumColumnMode.New || isEditable) && (
+  const memoDescription = useMemo(() => (false) && (
     isEditable ? (
       <TextArea

[NoCoverage] ConditionalExpression
src/components/ColumnHeader/index.tsx:159:42
     )
   ), [t, mode, isEditable, titleValue]);
 
-  const memoDescription = useMemo(() => (mode !== EnumColumnMode.New || isEditable) && (
+  const memoDescription = useMemo(() => (false || isEditable) && (
     isEditable ? (
       <TextArea

[NoCoverage] StringLiteral
src/components/ColumnHeader/index.tsx:164:24
       <TextArea
         className="column__description column__description--editable"
         value={descriptionValue}
-        placeholder={t('Notes')}
+        placeholder={t("")}
         minRows={1}
         maxRows={4}

[NoCoverage] ArrowFunction
src/components/ColumnHeader/index.tsx:169:19
         maxRows={4}
         onKeyDown={shiftEnterRestriction}
         onKeyDownCapture={(event) => handleKeyDown(event)}
-        onChange={(event) => handleChange(event, true)}
+        onChange={() => undefined}
       />
     ) : (

[NoCoverage] BooleanLiteral
src/components/ColumnHeader/index.tsx:169:50
         maxRows={4}
         onKeyDown={shiftEnterRestriction}
         onKeyDownCapture={(event) => handleKeyDown(event)}
-        onChange={(event) => handleChange(event, true)}
+        onChange={(event) => handleChange(event, false)}
       />
     ) : (

[NoCoverage] StringLiteral
src/components/ColumnHeader/index.tsx:173:23
       />
     ) : (
       <span
-        className={cn('column__description', {
+        className={cn("", {
           'column__description--empty': !descriptionValue,
         })}

[NoCoverage] ObjectLiteral
src/components/ColumnHeader/index.tsx:173:46
       />
     ) : (
       <span
-        className={cn('column__description', {
-          'column__description--empty': !descriptionValue,
-        })}
+        className={cn('column__description', {})}
       >
         {descriptionValue || t('Notes')}

[NoCoverage] BooleanLiteral
src/components/ColumnHeader/index.tsx:174:41
     ) : (
       <span
         className={cn('column__description', {
-          'column__description--empty': !descriptionValue,
+          'column__description--empty': descriptionValue,
         })}
       >

[NoCoverage] ConditionalExpression
src/components/ColumnHeader/index.tsx:177:10
           'column__description--empty': !descriptionValue,
         })}
       >
-        {descriptionValue || t('Notes')}
+        {false}
       </span>
     )

[NoCoverage] ConditionalExpression
src/components/ColumnHeader/index.tsx:177:10
           'column__description--empty': !descriptionValue,
         })}
       >
-        {descriptionValue || t('Notes')}
+        {true}
       </span>
     )

[NoCoverage] ArrayDeclaration
src/components/ColumnHeader/index.tsx:181:3
       </span>
     )
   ),
-  [t, isEditable, descriptionValue, t]);
+  []);
 
   return (

[NoCoverage] ObjectLiteral
src/components/ColumnHeader/index.tsx:188:51
       ref={headerRef}
       role="button"
       tabIndex={0}
-      className={cn('column__header', colorClass, {
-        'column__header--editable': isEditable,
-      })}
+      className={cn('column__header', colorClass, {})}
       onMouseEnter={() => onHover(true)}
       onMouseLeave={() => onHover(false)}

[NoCoverage] ArrowFunction
src/components/ColumnHeader/index.tsx:191:21
       className={cn('column__header', colorClass, {
         'column__header--editable': isEditable,
       })}
-      onMouseEnter={() => onHover(true)}
+      onMouseEnter={() => undefined}
       onMouseLeave={() => onHover(false)}
       onClick={onClick}

[NoCoverage] BooleanLiteral
src/components/ColumnHeader/index.tsx:191:35
       className={cn('column__header', colorClass, {
         'column__header--editable': isEditable,
       })}
-      onMouseEnter={() => onHover(true)}
+      onMouseEnter={() => onHover(false)}
       onMouseLeave={() => onHover(false)}
       onClick={onClick}

[NoCoverage] BooleanLiteral
src/components/ColumnHeader/index.tsx:192:35
         'column__header--editable': isEditable,
       })}
       onMouseEnter={() => onHover(true)}
-      onMouseLeave={() => onHover(false)}
+      onMouseLeave={() => onHover(true)}
       onClick={onClick}
       onDoubleClick={onDoubleClick}

[NoCoverage] ArrowFunction
src/components/ColumnHeader/index.tsx:192:21
         'column__header--editable': isEditable,
       })}
       onMouseEnter={() => onHover(true)}
-      onMouseLeave={() => onHover(false)}
+      onMouseLeave={() => undefined}
       onClick={onClick}
       onDoubleClick={onDoubleClick}
