[NoCoverage] ObjectLiteral
src/components/ColumnToolbar/ColumnToolbar.stories.tsx:4:16
 import React from 'react';
 import { ColumnToolbar } from '@comp/ColumnToolbar';
 
-export default {
-  title: 'ColumnToolbar',
-  argTypes: {
-    isEnabled: { control: { type: 'boolean' }, defaultValue: true },
-    isHoverBlock: { control: { type: 'boolean' }, defaultValue: true },
-    onAddCard: { action: 'add card' },
-    onAddHeading: { action: 'add heading' },
-  },
-  parameters: { loki: { skip: true } },
-};
+export default {};
 
 export const Default = (args: any) => <ColumnToolbar {...args} />;

[NoCoverage] ObjectLiteral
src/components/ColumnToolbar/ColumnToolbar.stories.tsx:6:13
 
 export default {
   title: 'ColumnToolbar',
-  argTypes: {
-    isEnabled: { control: { type: 'boolean' }, defaultValue: true },
-    isHoverBlock: { control: { type: 'boolean' }, defaultValue: true },
-    onAddCard: { action: 'add card' },
-    onAddHeading: { action: 'add heading' },
-  },
+  argTypes: {},
   parameters: { loki: { skip: true } },
 };

[NoCoverage] BooleanLiteral
src/components/ColumnToolbar/ColumnToolbar.stories.tsx:7:62
 export default {
   title: 'ColumnToolbar',
   argTypes: {
-    isEnabled: { control: { type: 'boolean' }, defaultValue: true },
+    isEnabled: { control: { type: 'boolean' }, defaultValue: false },
     isHoverBlock: { control: { type: 'boolean' }, defaultValue: true },
     onAddCard: { action: 'add card' },

[NoCoverage] ObjectLiteral
src/components/ColumnToolbar/ColumnToolbar.stories.tsx:7:27
 export default {
   title: 'ColumnToolbar',
   argTypes: {
-    isEnabled: { control: { type: 'boolean' }, defaultValue: true },
+    isEnabled: { control: {}, defaultValue: true },
     isHoverBlock: { control: { type: 'boolean' }, defaultValue: true },
     onAddCard: { action: 'add card' },

[NoCoverage] BooleanLiteral
src/components/ColumnToolbar/ColumnToolbar.stories.tsx:8:65
   title: 'ColumnToolbar',
   argTypes: {
     isEnabled: { control: { type: 'boolean' }, defaultValue: true },
-    isHoverBlock: { control: { type: 'boolean' }, defaultValue: true },
+    isHoverBlock: { control: { type: 'boolean' }, defaultValue: false },
     onAddCard: { action: 'add card' },
     onAddHeading: { action: 'add heading' },

[NoCoverage] ObjectLiteral
src/components/ColumnToolbar/ColumnToolbar.stories.tsx:9:16
   argTypes: {
     isEnabled: { control: { type: 'boolean' }, defaultValue: true },
     isHoverBlock: { control: { type: 'boolean' }, defaultValue: true },
-    onAddCard: { action: 'add card' },
+    onAddCard: {},
     onAddHeading: { action: 'add heading' },
   },

[NoCoverage] StringLiteral
src/components/ColumnToolbar/ColumnToolbar.stories.tsx:10:29
     isEnabled: { control: { type: 'boolean' }, defaultValue: true },
     isHoverBlock: { control: { type: 'boolean' }, defaultValue: true },
     onAddCard: { action: 'add card' },
-    onAddHeading: { action: 'add heading' },
+    onAddHeading: { action: "" },
   },
   parameters: { loki: { skip: true } },

[NoCoverage] ObjectLiteral
src/components/ColumnToolbar/ColumnToolbar.stories.tsx:10:19
     isEnabled: { control: { type: 'boolean' }, defaultValue: true },
     isHoverBlock: { control: { type: 'boolean' }, defaultValue: true },
     onAddCard: { action: 'add card' },
-    onAddHeading: { action: 'add heading' },
+    onAddHeading: {},
   },
   parameters: { loki: { skip: true } },

[NoCoverage] BooleanLiteral
src/components/ColumnToolbar/ColumnToolbar.stories.tsx:12:31
     onAddCard: { action: 'add card' },
     onAddHeading: { action: 'add heading' },
   },
-  parameters: { loki: { skip: true } },
+  parameters: { loki: { skip: false } },
 };
 

[NoCoverage] ObjectLiteral
src/components/ColumnToolbar/ColumnToolbar.stories.tsx:12:23
     onAddCard: { action: 'add card' },
     onAddHeading: { action: 'add heading' },
   },
-  parameters: { loki: { skip: true } },
+  parameters: { loki: {} },
 };
 

[NoCoverage] ArrowFunction
src/components/ColumnToolbar/ColumnToolbar.stories.tsx:15:24
   parameters: { loki: { skip: true } },
 };
 
-export const Default = (args: any) => <ColumnToolbar {...args} />;
+export const Default = () => undefined;
 
