[NoCoverage] StringLiteral
src/components/ColumnToolbar/index.tsx:23:21
 
   return isEnabled ? (
     <div
-      className={cn('column-toolbar', {
+      className={cn("", {
         'column-toolbar--invisible': !isHoverBlock,
       })}

[NoCoverage] BooleanLiteral
src/components/ColumnToolbar/index.tsx:24:38
   return isEnabled ? (
     <div
       className={cn('column-toolbar', {
-        'column-toolbar--invisible': !isHoverBlock,
+        'column-toolbar--invisible': isHoverBlock,
       })}
     >
