[NoCoverage] EqualityOperator
src/components/CommentFormAttachments/index.tsx:14:31
   files,
   isListView,
   onRemove,
-}) => useMemo(() => (files && files.length > 0 ? (
+}) => useMemo(() => (files && files.length >= 0 ? (
   <div className={
     `comment-form-attachments

[NoCoverage] ConditionalExpression
src/components/CommentFormAttachments/index.tsx:14:22
   files,
   isListView,
   onRemove,
-}) => useMemo(() => (files && files.length > 0 ? (
+}) => useMemo(() => (true ? (
   <div className={
     `comment-form-attachments

[NoCoverage] StringLiteral
src/components/CommentFormAttachments/index.tsx:17:20
 }) => useMemo(() => (files && files.length > 0 ? (
   <div className={
     `comment-form-attachments
-    ${isListView ? 'comment-form-attachments--list-view' : ''}`
+    ${isListView ? "" : ''}`
   }
   >

[NoCoverage] ArrayDeclaration
src/components/CommentFormAttachments/index.tsx:21:9
   }
   >
     {
-        [...files].map((file, index) => (
+        [].map((file, index) => (
           <div
             key={`${file.name}-${file.lastModified}`}

[NoCoverage] StringLiteral
src/components/CommentFormAttachments/index.tsx:23:18
     {
         [...files].map((file, index) => (
           <div
-            key={`${file.name}-${file.lastModified}`}
+            key={``}
             className="comment-form-attachments__item"
           >

[NoCoverage] ArrowFunction
src/components/CommentFormAttachments/index.tsx:47:24
               imageSize={10}
               size={16}
               style={{ padding: 8, borderRadius: 4 }}
-              onClick={() => onRemove(index)}
+              onClick={() => undefined}
             />
           </div>
