[NoCoverage] StringLiteral
src/components/CommentList/index.tsx:17:19
 }: ICommentList, ref: any) => (
   <div
     ref={ref}
-    className={cn('comment-list', {
+    className={cn("", {
       'comment-list--empty': !comments?.length,
     })}

[NoCoverage] BooleanLiteral
src/components/CommentList/index.tsx:18:30
   <div
     ref={ref}
     className={cn('comment-list', {
-      'comment-list--empty': !comments?.length,
+      'comment-list--empty': comments?.length,
     })}
   >

[NoCoverage] ConditionalExpression
src/components/CommentList/index.tsx:22:7
     })}
   >
     {
-      comments.length > 0 ? comments.map((comment: IComment) => (
+      false ? comments.map((comment: IComment) => (
         <CommentItem
           key={comment.id}

[NoCoverage] ConditionalExpression
src/components/CommentList/index.tsx:22:7
     })}
   >
     {
-      comments.length > 0 ? comments.map((comment: IComment) => (
+      true ? comments.map((comment: IComment) => (
         <CommentItem
           key={comment.id}
