[NoCoverage] ObjectLiteral
src/components/ControlButton/ControlButton.stories.tsx:8:26
 export default {
   title: 'ControlButton',
   argTypes: {
-    imageSrc: { control: { type: 'text' }, defaultValue: '/assets/svg/add.svg' },
+    imageSrc: { control: {}, defaultValue: '/assets/svg/add.svg' },
     text: { control: { type: 'text' }, defaultValue: 'New workspace' },
     alt: { control: { type: 'text' }, defaultValue: 'add' },

[NoCoverage] ObjectLiteral
src/components/ControlButton/ControlButton.stories.tsx:9:11
   title: 'ControlButton',
   argTypes: {
     imageSrc: { control: { type: 'text' }, defaultValue: '/assets/svg/add.svg' },
-    text: { control: { type: 'text' }, defaultValue: 'New workspace' },
+    text: {},
     alt: { control: { type: 'text' }, defaultValue: 'add' },
     tooltip: { control: { type: 'text' }, defaultValue: undefined },

[NoCoverage] StringLiteral
src/components/ControlButton/ControlButton.stories.tsx:9:30
   title: 'ControlButton',
   argTypes: {
     imageSrc: { control: { type: 'text' }, defaultValue: '/assets/svg/add.svg' },
-    text: { control: { type: 'text' }, defaultValue: 'New workspace' },
+    text: { control: { type: "" }, defaultValue: 'New workspace' },
     alt: { control: { type: 'text' }, defaultValue: 'add' },
     tooltip: { control: { type: 'text' }, defaultValue: undefined },

[NoCoverage] ObjectLiteral
src/components/ControlButton/ControlButton.stories.tsx:11:14
     imageSrc: { control: { type: 'text' }, defaultValue: '/assets/svg/add.svg' },
     text: { control: { type: 'text' }, defaultValue: 'New workspace' },
     alt: { control: { type: 'text' }, defaultValue: 'add' },
-    tooltip: { control: { type: 'text' }, defaultValue: undefined },
+    tooltip: {},
     imageSize: { control: { type: 'range', min: 1, max: 500 }, defaultValue: 12 },
     animationDuration: { control: { type: 'range', min: 1, max: 1000 }, defaultValue: 100 },

[NoCoverage] ObjectLiteral
src/components/ControlButton/ControlButton.stories.tsx:11:25
     imageSrc: { control: { type: 'text' }, defaultValue: '/assets/svg/add.svg' },
     text: { control: { type: 'text' }, defaultValue: 'New workspace' },
     alt: { control: { type: 'text' }, defaultValue: 'add' },
-    tooltip: { control: { type: 'text' }, defaultValue: undefined },
+    tooltip: { control: {}, defaultValue: undefined },
     imageSize: { control: { type: 'range', min: 1, max: 500 }, defaultValue: 12 },
     animationDuration: { control: { type: 'range', min: 1, max: 1000 }, defaultValue: 100 },

[NoCoverage] StringLiteral
src/components/ControlButton/ControlButton.stories.tsx:12:35
     text: { control: { type: 'text' }, defaultValue: 'New workspace' },
     alt: { control: { type: 'text' }, defaultValue: 'add' },
     tooltip: { control: { type: 'text' }, defaultValue: undefined },
-    imageSize: { control: { type: 'range', min: 1, max: 500 }, defaultValue: 12 },
+    imageSize: { control: { type: "", min: 1, max: 500 }, defaultValue: 12 },
     animationDuration: { control: { type: 'range', min: 1, max: 1000 }, defaultValue: 100 },
     size: { control: { type: 'range', min: 1, max: 500 }, defaultValue: undefined },

[NoCoverage] ObjectLiteral
src/components/ControlButton/ControlButton.stories.tsx:14:22
     tooltip: { control: { type: 'text' }, defaultValue: undefined },
     imageSize: { control: { type: 'range', min: 1, max: 500 }, defaultValue: 12 },
     animationDuration: { control: { type: 'range', min: 1, max: 1000 }, defaultValue: 100 },
-    size: { control: { type: 'range', min: 1, max: 500 }, defaultValue: undefined },
+    size: { control: {}, defaultValue: undefined },
     isHide: { control: { type: 'boolean' }, defaultValue: false },
     isInvisible: { control: { type: 'boolean' }, defaultValue: false },

[NoCoverage] BooleanLiteral
src/components/ControlButton/ControlButton.stories.tsx:15:59
     imageSize: { control: { type: 'range', min: 1, max: 500 }, defaultValue: 12 },
     animationDuration: { control: { type: 'range', min: 1, max: 1000 }, defaultValue: 100 },
     size: { control: { type: 'range', min: 1, max: 500 }, defaultValue: undefined },
-    isHide: { control: { type: 'boolean' }, defaultValue: false },
+    isHide: { control: { type: 'boolean' }, defaultValue: true },
     isInvisible: { control: { type: 'boolean' }, defaultValue: false },
     isHoverBlock: { control: { type: 'boolean' }, defaultValue: true },

[NoCoverage] ObjectLiteral
src/components/ControlButton/ControlButton.stories.tsx:15:24
     imageSize: { control: { type: 'range', min: 1, max: 500 }, defaultValue: 12 },
     animationDuration: { control: { type: 'range', min: 1, max: 1000 }, defaultValue: 100 },
     size: { control: { type: 'range', min: 1, max: 500 }, defaultValue: undefined },
-    isHide: { control: { type: 'boolean' }, defaultValue: false },
+    isHide: { control: {}, defaultValue: false },
     isInvisible: { control: { type: 'boolean' }, defaultValue: false },
     isHoverBlock: { control: { type: 'boolean' }, defaultValue: true },

[NoCoverage] BooleanLiteral
src/components/ControlButton/ControlButton.stories.tsx:16:64
     animationDuration: { control: { type: 'range', min: 1, max: 1000 }, defaultValue: 100 },
     size: { control: { type: 'range', min: 1, max: 500 }, defaultValue: undefined },
     isHide: { control: { type: 'boolean' }, defaultValue: false },
-    isInvisible: { control: { type: 'boolean' }, defaultValue: false },
+    isInvisible: { control: { type: 'boolean' }, defaultValue: true },
     isHoverBlock: { control: { type: 'boolean' }, defaultValue: true },
     isMaxWidth: { control: { type: 'boolean' }, defaultValue: true },

[NoCoverage] ObjectLiteral
src/components/ControlButton/ControlButton.stories.tsx:16:18
     animationDuration: { control: { type: 'range', min: 1, max: 1000 }, defaultValue: 100 },
     size: { control: { type: 'range', min: 1, max: 500 }, defaultValue: undefined },
     isHide: { control: { type: 'boolean' }, defaultValue: false },
-    isInvisible: { control: { type: 'boolean' }, defaultValue: false },
+    isInvisible: {},
     isHoverBlock: { control: { type: 'boolean' }, defaultValue: true },
     isMaxWidth: { control: { type: 'boolean' }, defaultValue: true },

[NoCoverage] BooleanLiteral
src/components/ControlButton/ControlButton.stories.tsx:17:65
     size: { control: { type: 'range', min: 1, max: 500 }, defaultValue: undefined },
     isHide: { control: { type: 'boolean' }, defaultValue: false },
     isInvisible: { control: { type: 'boolean' }, defaultValue: false },
-    isHoverBlock: { control: { type: 'boolean' }, defaultValue: true },
+    isHoverBlock: { control: { type: 'boolean' }, defaultValue: false },
     isMaxWidth: { control: { type: 'boolean' }, defaultValue: true },
     isInvertColor: { control: { type: 'boolean' }, defaultValue: false },

[NoCoverage] ObjectLiteral
src/components/ControlButton/ControlButton.stories.tsx:17:30
     size: { control: { type: 'range', min: 1, max: 500 }, defaultValue: undefined },
     isHide: { control: { type: 'boolean' }, defaultValue: false },
     isInvisible: { control: { type: 'boolean' }, defaultValue: false },
-    isHoverBlock: { control: { type: 'boolean' }, defaultValue: true },
+    isHoverBlock: { control: {}, defaultValue: true },
     isMaxWidth: { control: { type: 'boolean' }, defaultValue: true },
     isInvertColor: { control: { type: 'boolean' }, defaultValue: false },

[NoCoverage] BooleanLiteral
src/components/ControlButton/ControlButton.stories.tsx:18:63
     isHide: { control: { type: 'boolean' }, defaultValue: false },
     isInvisible: { control: { type: 'boolean' }, defaultValue: false },
     isHoverBlock: { control: { type: 'boolean' }, defaultValue: true },
-    isMaxWidth: { control: { type: 'boolean' }, defaultValue: true },
+    isMaxWidth: { control: { type: 'boolean' }, defaultValue: false },
     isInvertColor: { control: { type: 'boolean' }, defaultValue: false },
     isPrimary: { control: { type: 'boolean' }, defaultValue: false },

[NoCoverage] ObjectLiteral
src/components/ControlButton/ControlButton.stories.tsx:18:28
     isHide: { control: { type: 'boolean' }, defaultValue: false },
     isInvisible: { control: { type: 'boolean' }, defaultValue: false },
     isHoverBlock: { control: { type: 'boolean' }, defaultValue: true },
-    isMaxWidth: { control: { type: 'boolean' }, defaultValue: true },
+    isMaxWidth: { control: {}, defaultValue: true },
     isInvertColor: { control: { type: 'boolean' }, defaultValue: false },
     isPrimary: { control: { type: 'boolean' }, defaultValue: false },

[NoCoverage] BooleanLiteral
src/components/ControlButton/ControlButton.stories.tsx:19:66
     isInvisible: { control: { type: 'boolean' }, defaultValue: false },
     isHoverBlock: { control: { type: 'boolean' }, defaultValue: true },
     isMaxWidth: { control: { type: 'boolean' }, defaultValue: true },
-    isInvertColor: { control: { type: 'boolean' }, defaultValue: false },
+    isInvertColor: { control: { type: 'boolean' }, defaultValue: true },
     isPrimary: { control: { type: 'boolean' }, defaultValue: false },
     isColored: { control: { type: 'boolean' }, defaultValue: false },

[NoCoverage] ObjectLiteral
src/components/ControlButton/ControlButton.stories.tsx:19:20
     isInvisible: { control: { type: 'boolean' }, defaultValue: false },
     isHoverBlock: { control: { type: 'boolean' }, defaultValue: true },
     isMaxWidth: { control: { type: 'boolean' }, defaultValue: true },
-    isInvertColor: { control: { type: 'boolean' }, defaultValue: false },
+    isInvertColor: {},
     isPrimary: { control: { type: 'boolean' }, defaultValue: false },
     isColored: { control: { type: 'boolean' }, defaultValue: false },

[NoCoverage] BooleanLiteral
src/components/ControlButton/ControlButton.stories.tsx:20:62
     isHoverBlock: { control: { type: 'boolean' }, defaultValue: true },
     isMaxWidth: { control: { type: 'boolean' }, defaultValue: true },
     isInvertColor: { control: { type: 'boolean' }, defaultValue: false },
-    isPrimary: { control: { type: 'boolean' }, defaultValue: false },
+    isPrimary: { control: { type: 'boolean' }, defaultValue: true },
     isColored: { control: { type: 'boolean' }, defaultValue: false },
     isTextable: { control: { type: 'boolean' }, defaultValue: false },

[NoCoverage] BooleanLiteral
src/components/ControlButton/ControlButton.stories.tsx:21:62
     isMaxWidth: { control: { type: 'boolean' }, defaultValue: true },
     isInvertColor: { control: { type: 'boolean' }, defaultValue: false },
     isPrimary: { control: { type: 'boolean' }, defaultValue: false },
-    isColored: { control: { type: 'boolean' }, defaultValue: false },
+    isColored: { control: { type: 'boolean' }, defaultValue: true },
     isTextable: { control: { type: 'boolean' }, defaultValue: false },
     isStopPropagation: { control: { type: 'boolean' }, defaultValue: false },

[NoCoverage] StringLiteral
src/components/ControlButton/ControlButton.stories.tsx:21:35
     isMaxWidth: { control: { type: 'boolean' }, defaultValue: true },
     isInvertColor: { control: { type: 'boolean' }, defaultValue: false },
     isPrimary: { control: { type: 'boolean' }, defaultValue: false },
-    isColored: { control: { type: 'boolean' }, defaultValue: false },
+    isColored: { control: { type: "" }, defaultValue: false },
     isTextable: { control: { type: 'boolean' }, defaultValue: false },
     isStopPropagation: { control: { type: 'boolean' }, defaultValue: false },

[NoCoverage] BooleanLiteral
src/components/ControlButton/ControlButton.stories.tsx:22:63
     isInvertColor: { control: { type: 'boolean' }, defaultValue: false },
     isPrimary: { control: { type: 'boolean' }, defaultValue: false },
     isColored: { control: { type: 'boolean' }, defaultValue: false },
-    isTextable: { control: { type: 'boolean' }, defaultValue: false },
+    isTextable: { control: { type: 'boolean' }, defaultValue: true },
     isStopPropagation: { control: { type: 'boolean' }, defaultValue: false },
     onClick: { action: 'clicked' },

[NoCoverage] BooleanLiteral
src/components/ControlButton/ControlButton.stories.tsx:23:70
     isPrimary: { control: { type: 'boolean' }, defaultValue: false },
     isColored: { control: { type: 'boolean' }, defaultValue: false },
     isTextable: { control: { type: 'boolean' }, defaultValue: false },
-    isStopPropagation: { control: { type: 'boolean' }, defaultValue: false },
+    isStopPropagation: { control: { type: 'boolean' }, defaultValue: true },
     onClick: { action: 'clicked' },
     onDoubleClick: { action: 'double clicked' },

[NoCoverage] ObjectLiteral
src/components/ControlButton/ControlButton.stories.tsx:23:35
     isPrimary: { control: { type: 'boolean' }, defaultValue: false },
     isColored: { control: { type: 'boolean' }, defaultValue: false },
     isTextable: { control: { type: 'boolean' }, defaultValue: false },
-    isStopPropagation: { control: { type: 'boolean' }, defaultValue: false },
+    isStopPropagation: { control: {}, defaultValue: false },
     onClick: { action: 'clicked' },
     onDoubleClick: { action: 'double clicked' },

[NoCoverage] ObjectLiteral
src/components/ControlButton/ControlButton.stories.tsx:38:49
           effect="solid"
           multiline
           arrowColor="transparent"
-          overridePosition={({ left, top }) => ({ left, top })}
+          overridePosition={({ left, top }) => ({})}
         />
         <Story />

[NoCoverage] ArrowFunction
src/components/ControlButton/ControlButton.stories.tsx:46:24
   ],
 };
 
-export const Default = (args: any) => <ControlButton {...args} />;
+export const Default = () => undefined;
 export const AddDate = (args: any) => (
   <ControlButton

[NoCoverage] ArrowFunction
src/components/ControlButton/ControlButton.stories.tsx:47:24
 };
 
 export const Default = (args: any) => <ControlButton {...args} />;
-export const AddDate = (args: any) => (
-  <ControlButton
-    {...args}
-    text={undefined}
-    imageSrc="/assets/svg/calendar.svg"
-    tooltip="Date"
-    alt="date"
-    imageSize={24}
-    size={36}
-    isColored
-    isMaxWidth={false}
-  />
-);
+export const AddDate = () => undefined;
 export const AttachFile = (args: any) => (
   <ControlButton

[NoCoverage] BooleanLiteral
src/components/ControlButton/ControlButton.stories.tsx:57:17
     imageSize={24}
     size={36}
     isColored
-    isMaxWidth={false}
+    isMaxWidth={true}
   />
 );

[NoCoverage] ArrowFunction
src/components/ControlButton/ControlButton.stories.tsx:60:27
     isMaxWidth={false}
   />
 );
-export const AttachFile = (args: any) => (
-  <ControlButton
-    {...args}
-    text={undefined}
-    imageSrc="/assets/svg/attach.svg"
-    tooltip="Attach a file"
-    alt="file"
-    imageSize={16}
-    size={20}
-    isColored
-    isMaxWidth={false}
-  />
-);
+export const AttachFile = () => undefined;
 export const MenuDots = (args: any) => (
   <ControlButton

[NoCoverage] ArrowFunction
src/components/ControlButton/ControlButton.stories.tsx:73:25
     isMaxWidth={false}
   />
 );
-export const MenuDots = (args: any) => (
-  <ControlButton
-    {...args}
-    text={undefined}
-    imageSrc="/assets/svg/dots.svg"
-    alt="menu"
-    imageSize={16}
-    size={22}
-    isMaxWidth={false}
-  />
-);
+export const MenuDots = () => undefined;
 

[NoCoverage] BooleanLiteral
src/components/ControlButton/ControlButton.stories.tsx:81:17
     alt="menu"
     imageSize={16}
     size={22}
-    isMaxWidth={false}
+    isMaxWidth={true}
   />
 );
