[NoCoverage] ObjectLiteral
components/DatePicker/Calendar/Calendar.stories.tsx:4:16
 import React from 'react';
 import { Calendar } from '@comp/DatePicker/Calendar';
 
-export default {
-  title: 'Calendar',
-  argTypes: {
-    medianDate: { control: { type: 'date' }, defaultValue: new Date(2020, 11, 11) },
-    selectedDates: { control: { type: 'date' }, defaultValue: new Date(2020, 11, 11) },
-    highlightDate: { control: { type: 'date' }, defaultValue: undefined },
-    onSelectDate: { action: 'select' },
-  },
-  parameters: {
-    backgrounds: {
-      default: null,
-    },
-  },
-};
+export default {};
 
 export const Default = (args: any) => <Calendar {...args} />;

[NoCoverage] StringLiteral
components/DatePicker/Calendar/Calendar.stories.tsx:5:10
 import { Calendar } from '@comp/DatePicker/Calendar';
 
 export default {
-  title: 'Calendar',
+  title: "",
   argTypes: {
     medianDate: { control: { type: 'date' }, defaultValue: new Date(2020, 11, 11) },

[NoCoverage] ObjectLiteral
components/DatePicker/Calendar/Calendar.stories.tsx:7:17
 export default {
   title: 'Calendar',
   argTypes: {
-    medianDate: { control: { type: 'date' }, defaultValue: new Date(2020, 11, 11) },
+    medianDate: {},
     selectedDates: { control: { type: 'date' }, defaultValue: new Date(2020, 11, 11) },
     highlightDate: { control: { type: 'date' }, defaultValue: undefined },

[NoCoverage] ObjectLiteral
components/DatePicker/Calendar/Calendar.stories.tsx:8:20
   title: 'Calendar',
   argTypes: {
     medianDate: { control: { type: 'date' }, defaultValue: new Date(2020, 11, 11) },
-    selectedDates: { control: { type: 'date' }, defaultValue: new Date(2020, 11, 11) },
+    selectedDates: {},
     highlightDate: { control: { type: 'date' }, defaultValue: undefined },
     onSelectDate: { action: 'select' },

[NoCoverage] ObjectLiteral
components/DatePicker/Calendar/Calendar.stories.tsx:12:15
     highlightDate: { control: { type: 'date' }, defaultValue: undefined },
     onSelectDate: { action: 'select' },
   },
-  parameters: {
-    backgrounds: {
-      default: null,
-    },
-  },
+  parameters: {},
 };
 

[NoCoverage] ArrowFunction
components/DatePicker/Calendar/Calendar.stories.tsx:19:24
   },
 };
 
-export const Default = (args: any) => <Calendar {...args} />;
+export const Default = () => undefined;
 export const WithHighlightedDateInPast = (args: any) => (
   <Calendar

[NoCoverage] ArrowFunction
components/DatePicker/Calendar/Calendar.stories.tsx:20:42
 };
 
 export const Default = (args: any) => <Calendar {...args} />;
-export const WithHighlightedDateInPast = (args: any) => (
-  <Calendar
-    {...args}
-    highlightDate={new Date(2020, 11, 10)}
-  />
-);
+export const WithHighlightedDateInPast = () => undefined;
 export const WithHighlightedDateInFuture = (args: any) => (
   <Calendar

[NoCoverage] ArrowFunction
components/DatePicker/Calendar/Calendar.stories.tsx:26:44
     highlightDate={new Date(2020, 11, 10)}
   />
 );
-export const WithHighlightedDateInFuture = (args: any) => (
-  <Calendar
-    {...args}
-    medianDate={new Date(2031, 11, 10)}
-    highlightDate={new Date(2031, 11, 10)}
-  />
-);
+export const WithHighlightedDateInFuture = () => undefined;
 export const WithSelectedDatesInPast = (args: any) => (
   <Calendar

[NoCoverage] ArrowFunction
components/DatePicker/Calendar/Calendar.stories.tsx:33:40
     highlightDate={new Date(2031, 11, 10)}
   />
 );
-export const WithSelectedDatesInPast = (args: any) => (
-  <Calendar
-    {...args}
-    medianDate={new Date(2020, 11, 10)}
-    selectedDates={[new Date(2020, 11, 10), new Date(2020, 11, 11)]}
-  />
-);
+export const WithSelectedDatesInPast = () => undefined;
 export const WithSelectedDatesInFuture = (args: any) => (
   <Calendar

[NoCoverage] ArrowFunction
components/DatePicker/Calendar/Calendar.stories.tsx:40:42
     selectedDates={[new Date(2020, 11, 10), new Date(2020, 11, 11)]}
   />
 );
-export const WithSelectedDatesInFuture = (args: any) => (
-  <Calendar
-    {...args}
-    medianDate={new Date(2031, 11, 10)}
-    selectedDates={[new Date(2031, 11, 10), new Date(2031, 11, 11)]}
-  />
-);
+export const WithSelectedDatesInFuture = () => undefined;
 
