[NoCoverage] BooleanLiteral
DatePicker/Calendar/Day/CalendarDay.stories.tsx:8:63
   title: 'CalendarDay',
   argTypes: {
     date: { control: { type: 'date' }, defaultValue: new Date(2020, 11, 11) },
-    isSelected: { control: { type: 'boolean' }, defaultValue: false },
+    isSelected: { control: { type: 'boolean' }, defaultValue: true },
     highlightDate: { control: { type: 'date' }, defaultValue: undefined },
     onSelectDate: { action: 'select' },

[NoCoverage] ObjectLiteral
DatePicker/Calendar/Day/CalendarDay.stories.tsx:9:20
   argTypes: {
     date: { control: { type: 'date' }, defaultValue: new Date(2020, 11, 11) },
     isSelected: { control: { type: 'boolean' }, defaultValue: false },
-    highlightDate: { control: { type: 'date' }, defaultValue: undefined },
+    highlightDate: {},
     onSelectDate: { action: 'select' },
   },

[NoCoverage] ObjectLiteral
DatePicker/Calendar/Day/CalendarDay.stories.tsx:10:19
     date: { control: { type: 'date' }, defaultValue: new Date(2020, 11, 11) },
     isSelected: { control: { type: 'boolean' }, defaultValue: false },
     highlightDate: { control: { type: 'date' }, defaultValue: undefined },
-    onSelectDate: { action: 'select' },
+    onSelectDate: {},
   },
   parameters: {

[NoCoverage] ObjectLiteral
DatePicker/Calendar/Day/CalendarDay.stories.tsx:13:18
     onSelectDate: { action: 'select' },
   },
   parameters: {
-    backgrounds: {
-      default: null,
-    },
+    backgrounds: {},
   },
 };

[NoCoverage] ArrowFunction
DatePicker/Calendar/Day/CalendarDay.stories.tsx:19:24
   },
 };
 
-export const Default = (args: any) => <CalendarDay {...args} />;
+export const Default = () => undefined;
 export const SelectedDay = (args: any) => <CalendarDay {...args} isSelected />;
 export const DayInFuture = (args: any) => <CalendarDay {...args} date={new Date(2222, 1, 7)} />;

[NoCoverage] ArrowFunction
DatePicker/Calendar/Day/CalendarDay.stories.tsx:20:28
 };
 
 export const Default = (args: any) => <CalendarDay {...args} />;
-export const SelectedDay = (args: any) => <CalendarDay {...args} isSelected />;
+export const SelectedDay = () => undefined;
 export const DayInFuture = (args: any) => <CalendarDay {...args} date={new Date(2222, 1, 7)} />;
 export const WeekendDay = (args: any) => <CalendarDay {...args} date={new Date(2222, 1, 2)} />;

[NoCoverage] ArrowFunction
DatePicker/Calendar/Day/CalendarDay.stories.tsx:21:28
 
 export const Default = (args: any) => <CalendarDay {...args} />;
 export const SelectedDay = (args: any) => <CalendarDay {...args} isSelected />;
-export const DayInFuture = (args: any) => <CalendarDay {...args} date={new Date(2222, 1, 7)} />;
+export const DayInFuture = () => undefined;
 export const WeekendDay = (args: any) => <CalendarDay {...args} date={new Date(2222, 1, 2)} />;
 

[NoCoverage] ArrowFunction
DatePicker/Calendar/Day/CalendarDay.stories.tsx:22:27
 export const Default = (args: any) => <CalendarDay {...args} />;
 export const SelectedDay = (args: any) => <CalendarDay {...args} isSelected />;
 export const DayInFuture = (args: any) => <CalendarDay {...args} date={new Date(2222, 1, 7)} />;
-export const WeekendDay = (args: any) => <CalendarDay {...args} date={new Date(2222, 1, 2)} />;
+export const WeekendDay = () => undefined;
 
