[NoCoverage] ArrowFunction
DatePicker/Calendar/Day/index.tsx:15:46
   onSelectDate: (date: Date) => void;
 }
 
-export const CalendarDay: FC<ICalendarDay> = ({
-  date,
-  isSelected,
-  highlightDate = null,
-  onSelectDate,
-}) => useMemo(() => (
-  <div
-    className={cn('calendar-day', {
-      'calendar-day--weekend': isWeekend(date),
-      'calendar-day--past': isPast(date),
-      'calendar-day--today': isToday(date),
-      'calendar-day--highlighted': highlightDate && isSameDay(date, highlightDate),
-      'calendar-day--selected': isSelected,
-    })}
-    onClick={() => onSelectDate(date)}
-  >
-    {date.getDate()}
-  </div>
-),
-[date, isSelected, highlightDate]);
+export const CalendarDay: FC<ICalendarDay> = () => undefined;
 

[NoCoverage] ArrowFunction
DatePicker/Calendar/Day/index.tsx:20:15
   isSelected,
   highlightDate = null,
   onSelectDate,
-}) => useMemo(() => (
-  <div
-    className={cn('calendar-day', {
-      'calendar-day--weekend': isWeekend(date),
-      'calendar-day--past': isPast(date),
-      'calendar-day--today': isToday(date),
-      'calendar-day--highlighted': highlightDate && isSameDay(date, highlightDate),
-      'calendar-day--selected': isSelected,
-    })}
-    onClick={() => onSelectDate(date)}
-  >
-    {date.getDate()}
-  </div>
-),
+}) => useMemo(() => undefined,
 [date, isSelected, highlightDate]);
 

[NoCoverage] ConditionalExpression
DatePicker/Calendar/Day/index.tsx:26:36
       'calendar-day--weekend': isWeekend(date),
       'calendar-day--past': isPast(date),
       'calendar-day--today': isToday(date),
-      'calendar-day--highlighted': highlightDate && isSameDay(date, highlightDate),
+      'calendar-day--highlighted': false,
       'calendar-day--selected': isSelected,
     })}

[NoCoverage] ConditionalExpression
DatePicker/Calendar/Day/index.tsx:26:36
       'calendar-day--weekend': isWeekend(date),
       'calendar-day--past': isPast(date),
       'calendar-day--today': isToday(date),
-      'calendar-day--highlighted': highlightDate && isSameDay(date, highlightDate),
+      'calendar-day--highlighted': true,
       'calendar-day--selected': isSelected,
     })}

[NoCoverage] ArrowFunction
DatePicker/Calendar/Day/index.tsx:29:14
       'calendar-day--highlighted': highlightDate && isSameDay(date, highlightDate),
       'calendar-day--selected': isSelected,
     })}
-    onClick={() => onSelectDate(date)}
+    onClick={() => undefined}
   >
     {date.getDate()}

[NoCoverage] ArrayDeclaration
DatePicker/Calendar/Day/index.tsx:34:1
     {date.getDate()}
   </div>
 ),
-[date, isSelected, highlightDate]);
+[]);
 
