[NoCoverage] ArithmeticOperator
components/DatePicker/Calendar/index.tsx:19:21
   onSelectDate: (date: Date) => void;
 }
 
-const WEEKS_RANGE = 4 * 12;
+const WEEKS_RANGE = 4 / 12;
 const WEEK_HEIGHT = 30;
 const MONTH_HEIGHT = WEEK_HEIGHT * 4;

[NoCoverage] ArithmeticOperator
components/DatePicker/Calendar/index.tsx:21:22
 
 const WEEKS_RANGE = 4 * 12;
 const WEEK_HEIGHT = 30;
-const MONTH_HEIGHT = WEEK_HEIGHT * 4;
+const MONTH_HEIGHT = WEEK_HEIGHT / 4;
 const HALF_YEAR_HEIGHT = MONTH_HEIGHT * 6;
 

[NoCoverage] ArithmeticOperator
components/DatePicker/Calendar/index.tsx:22:26
 const WEEKS_RANGE = 4 * 12;
 const WEEK_HEIGHT = 30;
 const MONTH_HEIGHT = WEEK_HEIGHT * 4;
-const HALF_YEAR_HEIGHT = MONTH_HEIGHT * 6;
+const HALF_YEAR_HEIGHT = MONTH_HEIGHT / 6;
 
 export const Calendar: FC<ICalendar> = ({

[NoCoverage] ArrayDeclaration
components/DatePicker/Calendar/index.tsx:32:51
 }) => {
   const [startDate, setStartDate] = useState<Date>(new Date());
   const [endDate, setEndDate] = useState<Date>(new Date());
-  const [weeks, setWeeks] = useState<Array<Date>>([]);
+  const [weeks, setWeeks] = useState<Array<Date>>(["Stryker was here"]);
 
   const containerRef = useRef<any>();

[NoCoverage] BlockStatement
components/DatePicker/Calendar/index.tsx:36:19
 
   const containerRef = useRef<any>();
 
-  useEffect(() => {
-    const today = medianDate;
-    setStartDate(subWeeks(today, WEEKS_RANGE));
-    setEndDate(addWeeks(today, WEEKS_RANGE));
-  }, []);
+  useEffect(() => {}, []);
 
   const recalculateCalendar = () => {

[NoCoverage] ArrayDeclaration
components/DatePicker/Calendar/index.tsx:40:6
     const today = medianDate;
     setStartDate(subWeeks(today, WEEKS_RANGE));
     setEndDate(addWeeks(today, WEEKS_RANGE));
-  }, []);
+  }, ["Stryker was here"]);
 
   const recalculateCalendar = () => {

[NoCoverage] BlockStatement
components/DatePicker/Calendar/index.tsx:42:37
     setEndDate(addWeeks(today, WEEKS_RANGE));
   }, []);
 
-  const recalculateCalendar = () => {
-    const start = startOfMonth(startDate);
-    const end = endOfMonth(endDate);
-    setWeeks(eachWeekOfInterval({
-      start,
-      end,
-    }));
-  };
+  const recalculateCalendar = () => {};
 
   useEffect(() => {

[NoCoverage] BlockStatement
components/DatePicker/Calendar/index.tsx:51:19
     }));
   };
 
-  useEffect(() => {
-    setTimeout(() => {
-      if (containerRef.current) {
-        containerRef.current.scrollTop = WEEK_HEIGHT * WEEKS_RANGE - 1.5 * WEEK_HEIGHT;
-      }
-    });
-
-    recalculateCalendar();
-  }, [startDate]);
+  useEffect(() => {}, [startDate]);
 
   useEffect(() => {

[NoCoverage] BlockStatement
components/DatePicker/Calendar/index.tsx:52:22
   };
 
   useEffect(() => {
-    setTimeout(() => {
-      if (containerRef.current) {
-        containerRef.current.scrollTop = WEEK_HEIGHT * WEEKS_RANGE - 1.5 * WEEK_HEIGHT;
-      }
-    });
+    setTimeout(() => {});
 
     recalculateCalendar();

[NoCoverage] BlockStatement
components/DatePicker/Calendar/index.tsx:53:33
 
   useEffect(() => {
     setTimeout(() => {
-      if (containerRef.current) {
-        containerRef.current.scrollTop = WEEK_HEIGHT * WEEKS_RANGE - 1.5 * WEEK_HEIGHT;
-      }
+      if (containerRef.current) {}
     });
 

[NoCoverage] ArithmeticOperator
components/DatePicker/Calendar/index.tsx:54:42
   useEffect(() => {
     setTimeout(() => {
       if (containerRef.current) {
-        containerRef.current.scrollTop = WEEK_HEIGHT * WEEKS_RANGE - 1.5 * WEEK_HEIGHT;
+        containerRef.current.scrollTop = WEEK_HEIGHT * WEEKS_RANGE + 1.5 * WEEK_HEIGHT;
       }
     });

[NoCoverage] ArithmeticOperator
components/DatePicker/Calendar/index.tsx:54:70
   useEffect(() => {
     setTimeout(() => {
       if (containerRef.current) {
-        containerRef.current.scrollTop = WEEK_HEIGHT * WEEKS_RANGE - 1.5 * WEEK_HEIGHT;
+        containerRef.current.scrollTop = WEEK_HEIGHT * WEEKS_RANGE - 1.5 / WEEK_HEIGHT;
       }
     });

[NoCoverage] ArrayDeclaration
components/DatePicker/Calendar/index.tsx:59:6
     });
 
     recalculateCalendar();
-  }, [startDate]);
+  }, []);
 
   useEffect(() => {

[NoCoverage] BlockStatement
components/DatePicker/Calendar/index.tsx:61:19
     recalculateCalendar();
   }, [startDate]);
 
-  useEffect(() => {
-    recalculateCalendar();
-  }, [endDate]);
+  useEffect(() => {}, [endDate]);
 
   const handleScroll = useDebounce((e) => {

[NoCoverage] BlockStatement
components/DatePicker/Calendar/index.tsx:65:43
     recalculateCalendar();
   }, [endDate]);
 
-  const handleScroll = useDebounce((e) => {
-    const { scrollTop: currentPosition, scrollHeight: max } = e.target;
-
-    const minThreshold = HALF_YEAR_HEIGHT;
-    const maxThreshold = max - HALF_YEAR_HEIGHT;
-
-    if (currentPosition < minThreshold) {
-      setStartDate(subWeeks(startDate, WEEKS_RANGE));
-      setEndDate(subWeeks(endDate, WEEKS_RANGE));
-    }
-
-    if (currentPosition > maxThreshold) {
-      setStartDate(addWeeks(startDate, WEEKS_RANGE));
-      setEndDate(addWeeks(endDate, WEEKS_RANGE));
-    }
-  }, 100, [startDate, endDate]);
+  const handleScroll = useDebounce((e) => {}, 100, [startDate, endDate]);
 
   return (

[NoCoverage] ArithmeticOperator
components/DatePicker/Calendar/index.tsx:69:26
     const { scrollTop: currentPosition, scrollHeight: max } = e.target;
 
     const minThreshold = HALF_YEAR_HEIGHT;
-    const maxThreshold = max - HALF_YEAR_HEIGHT;
+    const maxThreshold = max + HALF_YEAR_HEIGHT;
 
     if (currentPosition < minThreshold) {

[NoCoverage] EqualityOperator
components/DatePicker/Calendar/index.tsx:71:9
     const minThreshold = HALF_YEAR_HEIGHT;
     const maxThreshold = max - HALF_YEAR_HEIGHT;
 
-    if (currentPosition < minThreshold) {
+    if (currentPosition >= minThreshold) {
       setStartDate(subWeeks(startDate, WEEKS_RANGE));
       setEndDate(subWeeks(endDate, WEEKS_RANGE));

[NoCoverage] ConditionalExpression
components/DatePicker/Calendar/index.tsx:71:9
     const minThreshold = HALF_YEAR_HEIGHT;
     const maxThreshold = max - HALF_YEAR_HEIGHT;
 
-    if (currentPosition < minThreshold) {
+    if (true) {
       setStartDate(subWeeks(startDate, WEEKS_RANGE));
       setEndDate(subWeeks(endDate, WEEKS_RANGE));

[NoCoverage] EqualityOperator
components/DatePicker/Calendar/index.tsx:76:9
       setEndDate(subWeeks(endDate, WEEKS_RANGE));
     }
 
-    if (currentPosition > maxThreshold) {
+    if (currentPosition <= maxThreshold) {
       setStartDate(addWeeks(startDate, WEEKS_RANGE));
       setEndDate(addWeeks(endDate, WEEKS_RANGE));

[NoCoverage] ConditionalExpression
components/DatePicker/Calendar/index.tsx:76:9
       setEndDate(subWeeks(endDate, WEEKS_RANGE));
     }
 
-    if (currentPosition > maxThreshold) {
+    if (false) {
       setStartDate(addWeeks(startDate, WEEKS_RANGE));
       setEndDate(addWeeks(endDate, WEEKS_RANGE));

[NoCoverage] ArrayDeclaration
components/DatePicker/Calendar/index.tsx:80:11
       setStartDate(addWeeks(startDate, WEEKS_RANGE));
       setEndDate(addWeeks(endDate, WEEKS_RANGE));
     }
-  }, 100, [startDate, endDate]);
+  }, 100, []);
 
   return (

[NoCoverage] ArrowFunction
components/DatePicker/Calendar/index.tsx:88:18
       className="calendar"
       onScroll={handleScroll}
     >
-      {weeks.map((start) => (
-        <CalendarWeek
-          key={start.getTime()}
-          highlightDate={highlightDate}
-          selectedDates={selectedDates}
-          startDate={start}
-          onSelectDate={onSelectDate}
-        />
-      ))}
+      {weeks.map(() => undefined)}
     </div>
   );
