[NoCoverage] ObjectLiteral
src/components/DatePicker/DatePicker.stories.tsx:7:19
 export default {
   title: 'DatePicker',
   argTypes: {
-    selectedDate: { control: { type: 'date' }, defaultValue: new Date(2031, 11, 7) },
+    selectedDate: {},
     isOpen: { control: { type: 'boolean' }, defaultValue: true },
     onSelectDate: { action: 'select' },

[NoCoverage] ObjectLiteral
src/components/DatePicker/DatePicker.stories.tsx:7:30
 export default {
   title: 'DatePicker',
   argTypes: {
-    selectedDate: { control: { type: 'date' }, defaultValue: new Date(2031, 11, 7) },
+    selectedDate: { control: {}, defaultValue: new Date(2031, 11, 7) },
     isOpen: { control: { type: 'boolean' }, defaultValue: true },
     onSelectDate: { action: 'select' },

[NoCoverage] BooleanLiteral
src/components/DatePicker/DatePicker.stories.tsx:8:59
   title: 'DatePicker',
   argTypes: {
     selectedDate: { control: { type: 'date' }, defaultValue: new Date(2031, 11, 7) },
-    isOpen: { control: { type: 'boolean' }, defaultValue: true },
+    isOpen: { control: { type: 'boolean' }, defaultValue: false },
     onSelectDate: { action: 'select' },
   },

[NoCoverage] ArrowFunction
src/components/DatePicker/DatePicker.stories.tsx:18:24
   },
 };
 
-export const Default = (args: any) => <DatePicker {...args} medianDate={new Date(2031, 11, 11)} />;
+export const Default = () => undefined;
 
