[NoCoverage] BlockStatement
components/DatePicker/Input/index.tsx:13:7
 export const DatePickerInput: FC<IDatePickerInput> = ({
   isOpen,
   onChange,
-}) => {
-  const { t } = useTranslation();
-  const ref = useRef<HTMLInputElement>(null);
-
-  useFocus(ref, [isOpen]);
-
-  return (
-    <div className="datepicker-input__wrapper">
-      <input
-        ref={ref}
-        className="datepicker-input"
-        placeholder={t('When')}
-        onChange={onChange}
-      />
-    </div>
-  );
-};
+}) => {};
 

[NoCoverage] StringLiteral
components/DatePicker/Input/index.tsx:24:24
       <input
         ref={ref}
         className="datepicker-input"
-        placeholder={t('When')}
+        placeholder={t("")}
         onChange={onChange}
       />
