[NoCoverage] ObjectLiteral
components/DatePicker/Tag/DatePickerTag.stories.tsx:4:16
 import React from 'react';
 import { DatePickerTag } from '@comp/DatePicker/Tag';
 
-export default {
-  title: 'DatePickerTag',
-  argTypes: {
-    date: { control: { type: 'date' }, defaultValue: new Date(2021, 2, 7) },
-    onRemove: { action: 'remove' },
-  },
-  parameters: {
-    backgrounds: {
-      default: null,
-    },
-  },
-};
+export default {};
 
 export const Default = (args: any) => <DatePickerTag {...args} />;

[NoCoverage] ObjectLiteral
components/DatePicker/Tag/DatePickerTag.stories.tsx:7:11
 export default {
   title: 'DatePickerTag',
   argTypes: {
-    date: { control: { type: 'date' }, defaultValue: new Date(2021, 2, 7) },
+    date: {},
     onRemove: { action: 'remove' },
   },

[NoCoverage] ArrowFunction
components/DatePicker/Tag/DatePickerTag.stories.tsx:17:24
   },
 };
 
-export const Default = (args: any) => <DatePickerTag {...args} />;
+export const Default = () => undefined;
 
