[NoCoverage] ArrowFunction
components/DatePicker/WeekDays/index.tsx:10:24
 export const DatePickerWeekDays: FC = () => {
   const { t } = useTranslation();
 
-  const days = useMemo(() => [
-    t('Sun'),
-    t('Mon'),
-    t('Tue'),
-    t('Wed'),
-    t('Thu'),
-    t('Fri'),
-    t('Sat'),
-  ], [t]);
+  const days = useMemo(() => undefined, [t]);
 
   return (

[NoCoverage] ArrayDeclaration
components/DatePicker/WeekDays/index.tsx:10:30
 export const DatePickerWeekDays: FC = () => {
   const { t } = useTranslation();
 
-  const days = useMemo(() => [
-    t('Sun'),
-    t('Mon'),
-    t('Tue'),
-    t('Wed'),
-    t('Thu'),
-    t('Fri'),
-    t('Sat'),
-  ], [t]);
+  const days = useMemo(() => [], [t]);
 
   return (

[NoCoverage] StringLiteral
components/DatePicker/WeekDays/index.tsx:11:7
   const { t } = useTranslation();
 
   const days = useMemo(() => [
-    t('Sun'),
+    t(""),
     t('Mon'),
     t('Tue'),

[NoCoverage] StringLiteral
components/DatePicker/WeekDays/index.tsx:14:7
     t('Sun'),
     t('Mon'),
     t('Tue'),
-    t('Wed'),
+    t(""),
     t('Thu'),
     t('Fri'),

[NoCoverage] StringLiteral
components/DatePicker/WeekDays/index.tsx:15:7
     t('Mon'),
     t('Tue'),
     t('Wed'),
-    t('Thu'),
+    t(""),
     t('Fri'),
     t('Sat'),

[NoCoverage] StringLiteral
components/DatePicker/WeekDays/index.tsx:16:7
     t('Tue'),
     t('Wed'),
     t('Thu'),
-    t('Fri'),
+    t(""),
     t('Sat'),
   ], [t]);

[NoCoverage] ArrowFunction
components/DatePicker/WeekDays/index.tsx:23:18
   return (
     <div className="datepicker-weekdays">
       {
-        days.map((day, index) => (
-          <div
-            key={day}
-            className={cn('datepicker-weekdays__day', {
-              'datepicker-weekdays__day--weekend': weekend.includes(index),
-            })}
-          >
-            {day}
-          </div>
-        ))
+        days.map(() => undefined)
       }
     </div>

[NoCoverage] ObjectLiteral
components/DatePicker/WeekDays/index.tsx:26:55
         days.map((day, index) => (
           <div
             key={day}
-            className={cn('datepicker-weekdays__day', {
-              'datepicker-weekdays__day--weekend': weekend.includes(index),
-            })}
+            className={cn('datepicker-weekdays__day', {})}
           >
             {day}
