[NoCoverage] BlockStatement
src/components/DatePicker/index.tsx:31:53
   const [date, setDate] = useEffectState<Date | null>(selectedDate);
   const [highlightDate, setHighlightDate] = useState<Date | null>(null);
 
-  const postHandlerSelectDate = (d: Date | null) => {
-    const normalizedDate = normalizeDate(d);
-    onSelectDate(normalizedDate);
-  };
+  const postHandlerSelectDate = (d: Date | null) => {};
 
   const handleSelectDate = (d: Date) => {

[NoCoverage] BlockStatement
src/components/DatePicker/index.tsx:36:41
     onSelectDate(normalizedDate);
   };
 
-  const handleSelectDate = (d: Date) => {
-    setDate(d);
-    postHandlerSelectDate(d);
-  };
+  const handleSelectDate = (d: Date) => {};
 
   const handleInput = (e: React.BaseSyntheticEvent) => {

[NoCoverage] BlockStatement
src/components/DatePicker/index.tsx:41:56
     postHandlerSelectDate(d);
   };
 
-  const handleInput = (e: React.BaseSyntheticEvent) => {
-    const inputValue = e.target.value;
-    setHighlightDate(createDate(inputValue));
-  };
+  const handleInput = (e: React.BaseSyntheticEvent) => {};
 
   const handleRemove = () => {

[NoCoverage] BlockStatement
src/components/DatePicker/index.tsx:46:30
     setHighlightDate(createDate(inputValue));
   };
 
-  const handleRemove = () => {
-    setDate(null);
-    postHandlerSelectDate(null);
-  };
+  const handleRemove = () => {};
 
   const handleSubmit = () => {

[NoCoverage] BlockStatement
src/components/DatePicker/index.tsx:51:30
     postHandlerSelectDate(null);
   };
 
-  const handleSubmit = () => {
-    console.log(highlightDate);
-    if (highlightDate !== undefined && isValid(highlightDate)) {
-      setDate(highlightDate);
-      postHandlerSelectDate(highlightDate);
-      setHighlightDate(null);
-    }
-  };
+  const handleSubmit = () => {};
 
   useKeys(['Enter'], handleSubmit, {

[NoCoverage] ConditionalExpression
src/components/DatePicker/index.tsx:53:9
 
   const handleSubmit = () => {
     console.log(highlightDate);
-    if (highlightDate !== undefined && isValid(highlightDate)) {
+    if (true) {
       setDate(highlightDate);
       postHandlerSelectDate(highlightDate);

[NoCoverage] ConditionalExpression
src/components/DatePicker/index.tsx:53:9
 
   const handleSubmit = () => {
     console.log(highlightDate);
-    if (highlightDate !== undefined && isValid(highlightDate)) {
+    if (true && isValid(highlightDate)) {
       setDate(highlightDate);
       postHandlerSelectDate(highlightDate);
