[NoCoverage] ObjectLiteral
src/components/Divider/Divider.stories.tsx:6:13
 
 export default {
   title: 'Divider',
-  argTypes: {
-    verticalSpacer: { control: { type: 'range', min: 1, max: 500 }, defaultValue: 10 },
-    horizontalSpacer: { control: { type: 'range', min: 1, max: 500 }, defaultValue: 30 },
-  },
+  argTypes: {},
   parameters: {
     backgrounds: {

[NoCoverage] ObjectLiteral
src/components/Divider/Divider.stories.tsx:7:21
 export default {
   title: 'Divider',
   argTypes: {
-    verticalSpacer: { control: { type: 'range', min: 1, max: 500 }, defaultValue: 10 },
+    verticalSpacer: {},
     horizontalSpacer: { control: { type: 'range', min: 1, max: 500 }, defaultValue: 30 },
   },

[NoCoverage] StringLiteral
src/components/Divider/Divider.stories.tsx:8:42
   title: 'Divider',
   argTypes: {
     verticalSpacer: { control: { type: 'range', min: 1, max: 500 }, defaultValue: 10 },
-    horizontalSpacer: { control: { type: 'range', min: 1, max: 500 }, defaultValue: 30 },
+    horizontalSpacer: { control: { type: "", min: 1, max: 500 }, defaultValue: 30 },
   },
   parameters: {

[NoCoverage] ArrowFunction
src/components/Divider/Divider.stories.tsx:17:24
   },
 };
 
-export const Default = (args: any) => <Divider {...args} />;
+export const Default = () => undefined;
 export const CustomHeight = (args: any) => <Divider {...args} style={{ height: 2 }} />;
 

[NoCoverage] ArrowFunction
src/components/Divider/Divider.stories.tsx:18:29
 };
 
 export const Default = (args: any) => <Divider {...args} />;
-export const CustomHeight = (args: any) => <Divider {...args} style={{ height: 2 }} />;
+export const CustomHeight = () => undefined;
 
