[NoCoverage] ArrowFunction
src/components/Divider/index.tsx:9:38
   style?: React.CSSProperties;
 }
 
-export const Divider: FC<IDivider> = ({
-  verticalSpacer,
-  horizontalSpacer,
-  style,
-}) => useMemo(() => (
-  <div
-    className="divider"
-    style={{
-      marginTop: typeof verticalSpacer === 'number' ? verticalSpacer : 10,
-      marginBottom: typeof verticalSpacer === 'number' ? verticalSpacer : 30,
-      marginLeft: typeof horizontalSpacer === 'number' ? horizontalSpacer : 0,
-      marginRight: typeof horizontalSpacer === 'number' ? horizontalSpacer : 0,
-      ...style,
-    }}
-  />
-), [verticalSpacer, horizontalSpacer]);
+export const Divider: FC<IDivider> = () => undefined;
 

[NoCoverage] ArrowFunction
src/components/Divider/index.tsx:13:15
   verticalSpacer,
   horizontalSpacer,
   style,
-}) => useMemo(() => (
-  <div
-    className="divider"
-    style={{
-      marginTop: typeof verticalSpacer === 'number' ? verticalSpacer : 10,
-      marginBottom: typeof verticalSpacer === 'number' ? verticalSpacer : 30,
-      marginLeft: typeof horizontalSpacer === 'number' ? horizontalSpacer : 0,
-      marginRight: typeof horizontalSpacer === 'number' ? horizontalSpacer : 0,
-      ...style,
-    }}
-  />
-), [verticalSpacer, horizontalSpacer]);
+}) => useMemo(() => undefined, [verticalSpacer, horizontalSpacer]);
 

[NoCoverage] ConditionalExpression
src/components/Divider/index.tsx:17:18
   <div
     className="divider"
     style={{
-      marginTop: typeof verticalSpacer === 'number' ? verticalSpacer : 10,
+      marginTop: true ? verticalSpacer : 10,
       marginBottom: typeof verticalSpacer === 'number' ? verticalSpacer : 30,
       marginLeft: typeof horizontalSpacer === 'number' ? horizontalSpacer : 0,

[NoCoverage] EqualityOperator
src/components/Divider/index.tsx:17:18
   <div
     className="divider"
     style={{
-      marginTop: typeof verticalSpacer === 'number' ? verticalSpacer : 10,
+      marginTop: typeof verticalSpacer !== 'number' ? verticalSpacer : 10,
       marginBottom: typeof verticalSpacer === 'number' ? verticalSpacer : 30,
       marginLeft: typeof horizontalSpacer === 'number' ? horizontalSpacer : 0,

[NoCoverage] EqualityOperator
src/components/Divider/index.tsx:18:21
     className="divider"
     style={{
       marginTop: typeof verticalSpacer === 'number' ? verticalSpacer : 10,
-      marginBottom: typeof verticalSpacer === 'number' ? verticalSpacer : 30,
+      marginBottom: typeof verticalSpacer !== 'number' ? verticalSpacer : 30,
       marginLeft: typeof horizontalSpacer === 'number' ? horizontalSpacer : 0,
       marginRight: typeof horizontalSpacer === 'number' ? horizontalSpacer : 0,

[NoCoverage] ConditionalExpression
src/components/Divider/index.tsx:18:21
     className="divider"
     style={{
       marginTop: typeof verticalSpacer === 'number' ? verticalSpacer : 10,
-      marginBottom: typeof verticalSpacer === 'number' ? verticalSpacer : 30,
+      marginBottom: false ? verticalSpacer : 30,
       marginLeft: typeof horizontalSpacer === 'number' ? horizontalSpacer : 0,
       marginRight: typeof horizontalSpacer === 'number' ? horizontalSpacer : 0,

[NoCoverage] ConditionalExpression
src/components/Divider/index.tsx:19:19
     style={{
       marginTop: typeof verticalSpacer === 'number' ? verticalSpacer : 10,
       marginBottom: typeof verticalSpacer === 'number' ? verticalSpacer : 30,
-      marginLeft: typeof horizontalSpacer === 'number' ? horizontalSpacer : 0,
+      marginLeft: true ? horizontalSpacer : 0,
       marginRight: typeof horizontalSpacer === 'number' ? horizontalSpacer : 0,
       ...style,

[NoCoverage] ConditionalExpression
src/components/Divider/index.tsx:19:19
     style={{
       marginTop: typeof verticalSpacer === 'number' ? verticalSpacer : 10,
       marginBottom: typeof verticalSpacer === 'number' ? verticalSpacer : 30,
-      marginLeft: typeof horizontalSpacer === 'number' ? horizontalSpacer : 0,
+      marginLeft: false ? horizontalSpacer : 0,
       marginRight: typeof horizontalSpacer === 'number' ? horizontalSpacer : 0,
       ...style,

[NoCoverage] ConditionalExpression
src/components/Divider/index.tsx:20:20
       marginTop: typeof verticalSpacer === 'number' ? verticalSpacer : 10,
       marginBottom: typeof verticalSpacer === 'number' ? verticalSpacer : 30,
       marginLeft: typeof horizontalSpacer === 'number' ? horizontalSpacer : 0,
-      marginRight: typeof horizontalSpacer === 'number' ? horizontalSpacer : 0,
+      marginRight: false ? horizontalSpacer : 0,
       ...style,
     }}

[NoCoverage] ConditionalExpression
src/components/Divider/index.tsx:20:20
       marginTop: typeof verticalSpacer === 'number' ? verticalSpacer : 10,
       marginBottom: typeof verticalSpacer === 'number' ? verticalSpacer : 30,
       marginLeft: typeof horizontalSpacer === 'number' ? horizontalSpacer : 0,
-      marginRight: typeof horizontalSpacer === 'number' ? horizontalSpacer : 0,
+      marginRight: true ? horizontalSpacer : 0,
       ...style,
     }}
