[NoCoverage] ObjectLiteral
src/components/DropZone/DropZone.stories.tsx:4:16
 import React from 'react';
 import { DropZone } from '@comp/DropZone';
 
-export default {
-  title: 'DropZone',
-  argTypes: {
-    size: { control: { type: 'select', options: ['small', 'large'] }, defaultValue: 'small' },
-    accept: { control: { type: 'text' }, defaultValue: '*' },
-    onOpen: { action: 'opened' },
-  },
-};
+export default {};
 
 const Children = ({ height }: any) => (

[NoCoverage] StringLiteral
src/components/DropZone/DropZone.stories.tsx:5:10
 import { DropZone } from '@comp/DropZone';
 
 export default {
-  title: 'DropZone',
+  title: "",
   argTypes: {
     size: { control: { type: 'select', options: ['small', 'large'] }, defaultValue: 'small' },

[NoCoverage] ArrayDeclaration
src/components/DropZone/DropZone.stories.tsx:7:49
 export default {
   title: 'DropZone',
   argTypes: {
-    size: { control: { type: 'select', options: ['small', 'large'] }, defaultValue: 'small' },
+    size: { control: { type: 'select', options: [] }, defaultValue: 'small' },
     accept: { control: { type: 'text' }, defaultValue: '*' },
     onOpen: { action: 'opened' },

[NoCoverage] ObjectLiteral
src/components/DropZone/DropZone.stories.tsx:7:22
 export default {
   title: 'DropZone',
   argTypes: {
-    size: { control: { type: 'select', options: ['small', 'large'] }, defaultValue: 'small' },
+    size: { control: {}, defaultValue: 'small' },
     accept: { control: { type: 'text' }, defaultValue: '*' },
     onOpen: { action: 'opened' },

[NoCoverage] StringLiteral
src/components/DropZone/DropZone.stories.tsx:8:56
   title: 'DropZone',
   argTypes: {
     size: { control: { type: 'select', options: ['small', 'large'] }, defaultValue: 'small' },
-    accept: { control: { type: 'text' }, defaultValue: '*' },
+    accept: { control: { type: 'text' }, defaultValue: "" },
     onOpen: { action: 'opened' },
   },

[NoCoverage] StringLiteral
src/components/DropZone/DropZone.stories.tsx:9:23
   argTypes: {
     size: { control: { type: 'select', options: ['small', 'large'] }, defaultValue: 'small' },
     accept: { control: { type: 'text' }, defaultValue: '*' },
-    onOpen: { action: 'opened' },
+    onOpen: { action: "" },
   },
 };

[NoCoverage] ArrowFunction
src/components/DropZone/DropZone.stories.tsx:13:18
   },
 };
 
-const Children = ({ height }: any) => (
-  <div style={{
-    width: '100%',
-    height,
-    background: '#f34453',
-    color: '#f2f2f2',
-    display: 'flex',
-    justifyContent: 'center',
-    alignItems: 'center',
-    borderRadius: 4,
-  }}
-  >
-    I am children
-  </div>
-);
+const Children = () => undefined;
 
 export const Default = (args: any) => (

[NoCoverage] StringLiteral
src/components/DropZone/DropZone.stories.tsx:18:12
     width: '100%',
     height,
     background: '#f34453',
-    color: '#f2f2f2',
+    color: "",
     display: 'flex',
     justifyContent: 'center',

[NoCoverage] StringLiteral
src/components/DropZone/DropZone.stories.tsx:20:21
     background: '#f34453',
     color: '#f2f2f2',
     display: 'flex',
-    justifyContent: 'center',
+    justifyContent: "",
     alignItems: 'center',
     borderRadius: 4,

[NoCoverage] ArrowFunction
src/components/DropZone/DropZone.stories.tsx:29:24
   </div>
 );
 
-export const Default = (args: any) => (
-  <DropZone {...args}>
-    <Children height="100px" />
-  </DropZone>
-);
+export const Default = () => undefined;
 
 export const Large = (args: any) => (

[NoCoverage] ArrowFunction
src/components/DropZone/DropZone.stories.tsx:35:22
   </DropZone>
 );
 
-export const Large = (args: any) => (
-  <DropZone {...args} size="large">
-    <Children height="400px" />
-  </DropZone>
-);
+export const Large = () => undefined;
 
