[NoCoverage] BooleanLiteral
src/components/DropZone/index.tsx:22:49
 }) => {
   const { t } = useTranslation();
   const { restrictFileSize } = useFileList();
-  const [isDrag, setIsDrag] = useState<boolean>(false);
+  const [isDrag, setIsDrag] = useState<boolean>(true);
 
   const handleDrop = (event: any) => {

[NoCoverage] BlockStatement
src/components/DropZone/index.tsx:24:38
   const { restrictFileSize } = useFileList();
   const [isDrag, setIsDrag] = useState<boolean>(false);
 
-  const handleDrop = (event: any) => {
-    const filteredFiles = restrictFileSize(event.dataTransfer.files, MAX_FILE_SIZE);
-    onOpen(filteredFiles!);
-    setIsDrag(false);
-  };
+  const handleDrop = (event: any) => {};
 
   const handleDrag = (event: React.DragEvent) => {

[NoCoverage] BooleanLiteral
src/components/DropZone/index.tsx:27:15
   const handleDrop = (event: any) => {
     const filteredFiles = restrictFileSize(event.dataTransfer.files, MAX_FILE_SIZE);
     onOpen(filteredFiles!);
-    setIsDrag(false);
+    setIsDrag(true);
   };
 

[NoCoverage] BlockStatement
src/components/DropZone/index.tsx:30:50
     setIsDrag(false);
   };
 
-  const handleDrag = (event: React.DragEvent) => {
-    if (event?.dataTransfer?.items?.length) {
-      const items = [...event?.dataTransfer?.items];
-      const isContainsFile = items.some((item) => item.kind === 'file');
-      if (isContainsFile) {
-        setIsDrag(true);
-      }
-    }
-  };
+  const handleDrag = (event: React.DragEvent) => {};
 
   return (

[NoCoverage] ConditionalExpression
src/components/DropZone/index.tsx:31:9
   };
 
   const handleDrag = (event: React.DragEvent) => {
-    if (event?.dataTransfer?.items?.length) {
+    if (true) {
       const items = [...event?.dataTransfer?.items];
       const isContainsFile = items.some((item) => item.kind === 'file');

[NoCoverage] ConditionalExpression
src/components/DropZone/index.tsx:31:9
   };
 
   const handleDrag = (event: React.DragEvent) => {
-    if (event?.dataTransfer?.items?.length) {
+    if (false) {
       const items = [...event?.dataTransfer?.items];
       const isContainsFile = items.some((item) => item.kind === 'file');

[NoCoverage] ArrowFunction
src/components/DropZone/index.tsx:33:41
   const handleDrag = (event: React.DragEvent) => {
     if (event?.dataTransfer?.items?.length) {
       const items = [...event?.dataTransfer?.items];
-      const isContainsFile = items.some((item) => item.kind === 'file');
+      const isContainsFile = items.some(() => undefined);
       if (isContainsFile) {
         setIsDrag(true);

[NoCoverage] ConditionalExpression
src/components/DropZone/index.tsx:33:51
   const handleDrag = (event: React.DragEvent) => {
     if (event?.dataTransfer?.items?.length) {
       const items = [...event?.dataTransfer?.items];
-      const isContainsFile = items.some((item) => item.kind === 'file');
+      const isContainsFile = items.some((item) => true);
       if (isContainsFile) {
         setIsDrag(true);

[NoCoverage] ConditionalExpression
src/components/DropZone/index.tsx:34:11
     if (event?.dataTransfer?.items?.length) {
       const items = [...event?.dataTransfer?.items];
       const isContainsFile = items.some((item) => item.kind === 'file');
-      if (isContainsFile) {
+      if (true) {
         setIsDrag(true);
       }

[NoCoverage] BlockStatement
src/components/DropZone/index.tsx:34:27
     if (event?.dataTransfer?.items?.length) {
       const items = [...event?.dataTransfer?.items];
       const isContainsFile = items.some((item) => item.kind === 'file');
-      if (isContainsFile) {
-        setIsDrag(true);
-      }
+      if (isContainsFile) {}
     }
   };

[NoCoverage] BooleanLiteral
src/components/DropZone/index.tsx:35:19
       const items = [...event?.dataTransfer?.items];
       const isContainsFile = items.some((item) => item.kind === 'file');
       if (isContainsFile) {
-        setIsDrag(true);
+        setIsDrag(false);
       }
     }

[NoCoverage] StringLiteral
src/components/DropZone/index.tsx:47:23
     >
       {children}
       <div
-        className={cn('drop-zone__overlay', `drop-zone__overlay--${size}`, {
+        className={cn("", `drop-zone__overlay--${size}`, {
           'drop-zone__overlay--hidden': !isDrag,
         })}

[NoCoverage] BooleanLiteral
src/components/DropZone/index.tsx:48:41
       {children}
       <div
         className={cn('drop-zone__overlay', `drop-zone__overlay--${size}`, {
-          'drop-zone__overlay--hidden': !isDrag,
+          'drop-zone__overlay--hidden': isDrag,
         })}
         onDragLeave={() => {

[NoCoverage] BlockStatement
src/components/DropZone/index.tsx:50:28
         className={cn('drop-zone__overlay', `drop-zone__overlay--${size}`, {
           'drop-zone__overlay--hidden': !isDrag,
         })}
-        onDragLeave={() => {
-          setIsDrag(false);
-        }}
+        onDragLeave={() => {}}
       >
         <h3>{t('Drop files here')}</h3>

[NoCoverage] BooleanLiteral
src/components/DropZone/index.tsx:51:21
           'drop-zone__overlay--hidden': !isDrag,
         })}
         onDragLeave={() => {
-          setIsDrag(false);
+          setIsDrag(true);
         }}
       >

[NoCoverage] ArrowFunction
src/components/DropZone/index.tsx:61:20
           multiple
           className="drop-zone__input"
           onDrop={handleDrop}
-          onClick={(e) => e.stopPropagation()}
+          onClick={() => undefined}
         />
       </div>
