[NoCoverage] BlockStatement
src/components/ErrorBoundary/ErrorBoundary.tsx:14:43
 }
 
 export class ErrorBoundary extends Component<IErrorBoundaryProps, IErrorBoundaryState> {
-  constructor(props: IErrorBoundaryProps) {
-    super(props);
-    this.state = { hasError: false };
-  }
+  constructor(props: IErrorBoundaryProps) {}
 
   componentDidCatch(error: Error, errorInfo: ErrorInfo) {

[NoCoverage] BooleanLiteral
src/components/ErrorBoundary/ErrorBoundary.tsx:16:30
 export class ErrorBoundary extends Component<IErrorBoundaryProps, IErrorBoundaryState> {
   constructor(props: IErrorBoundaryProps) {
     super(props);
-    this.state = { hasError: false };
+    this.state = { hasError: true };
   }
 

[NoCoverage] BlockStatement
src/components/ErrorBoundary/ErrorBoundary.tsx:19:57
     this.state = { hasError: false };
   }
 
-  componentDidCatch(error: Error, errorInfo: ErrorInfo) {
-    console.log(error, errorInfo);
-    this.setState({
-      hasError: true,
-    });
-  }
+  componentDidCatch(error: Error, errorInfo: ErrorInfo) {}
 
   render() {

[NoCoverage] ObjectLiteral
src/components/ErrorBoundary/ErrorBoundary.tsx:21:19
 
   componentDidCatch(error: Error, errorInfo: ErrorInfo) {
     console.log(error, errorInfo);
-    this.setState({
-      hasError: true,
-    });
+    this.setState({});
   }
 

[NoCoverage] BooleanLiteral
src/components/ErrorBoundary/ErrorBoundary.tsx:22:17
   componentDidCatch(error: Error, errorInfo: ErrorInfo) {
     console.log(error, errorInfo);
     this.setState({
-      hasError: true,
+      hasError: false,
     });
   }

[NoCoverage] BlockStatement
src/components/ErrorBoundary/ErrorBoundary.tsx:29:19
   render() {
     const { hasError } = this.state;
     const { children } = this.props;
-    if (hasError) {
-      return (
-        <div
-          className="container container--vertical"
-          style={{ alignItems: 'center', justifyContent: 'center' }}
-        >
-          <h1>
-            🔨
-            {' '}
-            {i18n.t('Something went wrong...')}
-          </h1>
-          <h1>
-            {' '}
-            {i18n.t('Please reload page')}
-          </h1>
-          <br />
-          <br />
-          <h2>
-            {i18n.t('We are already working on fixing this error')}
-            {' '}
-            🧐
-          </h2>
-        </div>
-      );
-    }
+    if (hasError) {}
 
     return children;

[NoCoverage] ConditionalExpression
src/components/ErrorBoundary/ErrorBoundary.tsx:29:9
   render() {
     const { hasError } = this.state;
     const { children } = this.props;
-    if (hasError) {
+    if (true) {
       return (
         <div

[NoCoverage] StringLiteral
src/components/ErrorBoundary/ErrorBoundary.tsx:38:21
           <h1>
             🔨
             {' '}
-            {i18n.t('Something went wrong...')}
+            {i18n.t("")}
           </h1>
           <h1>

[NoCoverage] StringLiteral
src/components/ErrorBoundary/ErrorBoundary.tsx:48:14
           <br />
           <h2>
             {i18n.t('We are already working on fixing this error')}
-            {' '}
+            {""}
             🧐
           </h2>
