[NoCoverage] BooleanLiteral
src/components/FallbackLoader/index.tsx:19:33
 
 export const FallbackLoader: FC<IFallbackLoader> = ({
   backgroundColor,
-  isLoading: initialIsLoading = true,
+  isLoading: initialIsLoading = false,
   isFixed,
   isAbsolute,

[NoCoverage] StringLiteral
src/components/FallbackLoader/index.tsx:22:10
   isLoading: initialIsLoading = true,
   isFixed,
   isAbsolute,
-  size = 'large',
+  size = "",
   delay = 500,
   minimumZIndex = 1,

[NoCoverage] ObjectLiteral
src/components/FallbackLoader/index.tsx:36:13
       strokeWidth: 2,
       strokeDashoffset: 300,
     },
-    medium: {
-      size: 75,
-      strokeWidth: 3,
-      strokeDashoffset: 240,
-    },
+    medium: {},
     large: {
       size: 100,

[NoCoverage] ConditionalExpression
src/components/FallbackLoader/index.tsx:49:9
   };
 
   useEffect(() => {
-    if (initialIsLoading) {
+    if (true) {
       setIsShowLoader(true);
       setIsLoading(true);

[NoCoverage] BlockStatement
src/components/FallbackLoader/index.tsx:49:27
   };
 
   useEffect(() => {
-    if (initialIsLoading) {
-      setIsShowLoader(true);
-      setIsLoading(true);
-      setZIndex(minimumZIndex);
-    }
+    if (initialIsLoading) {}
     const delayTimeout = delay - 200 > 0 ? delay - 200 : 0;
 

[NoCoverage] BooleanLiteral
src/components/FallbackLoader/index.tsx:50:23
 
   useEffect(() => {
     if (initialIsLoading) {
-      setIsShowLoader(true);
+      setIsShowLoader(false);
       setIsLoading(true);
       setZIndex(minimumZIndex);

[NoCoverage] BooleanLiteral
src/components/FallbackLoader/index.tsx:51:20
   useEffect(() => {
     if (initialIsLoading) {
       setIsShowLoader(true);
-      setIsLoading(true);
+      setIsLoading(false);
       setZIndex(minimumZIndex);
     }

[NoCoverage] EqualityOperator
src/components/FallbackLoader/index.tsx:54:26
       setIsLoading(true);
       setZIndex(minimumZIndex);
     }
-    const delayTimeout = delay - 200 > 0 ? delay - 200 : 0;
+    const delayTimeout = delay - 200 <= 0 ? delay - 200 : 0;
 
     const timeout = setTimeout(() => {

[NoCoverage] ConditionalExpression
src/components/FallbackLoader/index.tsx:54:26
       setIsLoading(true);
       setZIndex(minimumZIndex);
     }
-    const delayTimeout = delay - 200 > 0 ? delay - 200 : 0;
+    const delayTimeout = true ? delay - 200 : 0;
 
     const timeout = setTimeout(() => {

[NoCoverage] BlockStatement
src/components/FallbackLoader/index.tsx:56:38
     }
     const delayTimeout = delay - 200 > 0 ? delay - 200 : 0;
 
-    const timeout = setTimeout(() => {
-      if (!initialIsLoading) {
-        setIsLoading(false);
-        setZIndex(-1);
-      }
-    }, delay);
+    const timeout = setTimeout(() => {}, delay);
 
     const timeoutLoader = setTimeout(() => {

[NoCoverage] BooleanLiteral
src/components/FallbackLoader/index.tsx:57:11
     const delayTimeout = delay - 200 > 0 ? delay - 200 : 0;
 
     const timeout = setTimeout(() => {
-      if (!initialIsLoading) {
+      if (initialIsLoading) {
         setIsLoading(false);
         setZIndex(-1);

[NoCoverage] ConditionalExpression
src/components/FallbackLoader/index.tsx:57:11
     const delayTimeout = delay - 200 > 0 ? delay - 200 : 0;
 
     const timeout = setTimeout(() => {
-      if (!initialIsLoading) {
+      if (true) {
         setIsLoading(false);
         setZIndex(-1);

[NoCoverage] BooleanLiteral
src/components/FallbackLoader/index.tsx:58:22
 
     const timeout = setTimeout(() => {
       if (!initialIsLoading) {
-        setIsLoading(false);
+        setIsLoading(true);
         setZIndex(-1);
       }

[NoCoverage] UnaryOperator
src/components/FallbackLoader/index.tsx:59:19
     const timeout = setTimeout(() => {
       if (!initialIsLoading) {
         setIsLoading(false);
-        setZIndex(-1);
+        setZIndex(+1);
       }
     }, delay);

[NoCoverage] BlockStatement
src/components/FallbackLoader/index.tsx:63:44
       }
     }, delay);
 
-    const timeoutLoader = setTimeout(() => {
-      if (!initialIsLoading) {
-        setIsShowLoader(false);
-      }
-    }, delayTimeout);
+    const timeoutLoader = setTimeout(() => {}, delayTimeout);
 
     return () => {

[NoCoverage] BlockStatement
src/components/FallbackLoader/index.tsx:64:30
     }, delay);
 
     const timeoutLoader = setTimeout(() => {
-      if (!initialIsLoading) {
-        setIsShowLoader(false);
-      }
+      if (!initialIsLoading) {}
     }, delayTimeout);
 

[NoCoverage] ConditionalExpression
src/components/FallbackLoader/index.tsx:64:11
     }, delay);
 
     const timeoutLoader = setTimeout(() => {
-      if (!initialIsLoading) {
+      if (true) {
         setIsShowLoader(false);
       }

[NoCoverage] BooleanLiteral
src/components/FallbackLoader/index.tsx:65:25
 
     const timeoutLoader = setTimeout(() => {
       if (!initialIsLoading) {
-        setIsShowLoader(false);
+        setIsShowLoader(true);
       }
     }, delayTimeout);

[NoCoverage] BlockStatement
src/components/FallbackLoader/index.tsx:69:18
       }
     }, delayTimeout);
 
-    return () => {
-      clearTimeout(timeout);
-      clearTimeout(timeoutLoader);
-    };
+    return () => {};
   }, [initialIsLoading]);
 

[NoCoverage] ArrowFunction
src/components/FallbackLoader/index.tsx:75:18
     };
   }, [initialIsLoading]);
 
-  return useMemo(() => (
-    <div
-      className={cn('fallback-loader', {
-        'fallback-loader--fixed': isFixed,
-        'fallback-loader--absolute': isAbsolute,
-        'fallback-loader--hide': !isLoading,
-      })}
-      style={{ background: backgroundColor }}
-    >
-      <div className="fallback-loader__wrapper">
-        <Loader
-          isOpen={isShowLoader}
-          size={sizeGrid[size].size}
-          strokeWidth={sizeGrid[size].strokeWidth}
-          strokeDashoffset={sizeGrid[size].strokeDashoffset}
-        />
-      </div>
-    </div>
-  ), [isFixed, isAbsolute, backgroundColor, size,
+  return useMemo(() => undefined, [isFixed, isAbsolute, backgroundColor, size,
     isShowLoader, isLoading, zIndex]);
 };

[NoCoverage] BooleanLiteral
src/components/FallbackLoader/index.tsx:80:34
       className={cn('fallback-loader', {
         'fallback-loader--fixed': isFixed,
         'fallback-loader--absolute': isAbsolute,
-        'fallback-loader--hide': !isLoading,
+        'fallback-loader--hide': isLoading,
       })}
       style={{ background: backgroundColor }}
