[NoCoverage] StringLiteral
src/components/FormattingHelp/index.tsx:10:3
 import { useTranslation } from 'react-i18next';
 
 const strings = [
-  '# Header 1 8-)',
+  "",
   '## Header 2',
   '### Header 3',

[NoCoverage] StringLiteral
src/components/FormattingHelp/index.tsx:13:3
   '# Header 1 8-)',
   '## Header 2',
   '### Header 3',
-  `- List item<br>
-  - Item 2<br>
-  - Item 3`,
+  ``,
   `1. Ordered list item<br>
   2. Item 2<br>

[NoCoverage] StringLiteral
src/components/FormattingHelp/index.tsx:30:3
 >> ...by using additional greater-than signs right next to each other...<br>
 > > > ...or with spaces between arrows.`,
   '(c) (C) (r) (R) (tm) (TM) (p) (P) +-',
-  '-----',
+  "",
   '`inline code`',
   `\`\`\`ts<br>

[NoCoverage] StringLiteral
src/components/FormattingHelp/index.tsx:32:3
   '(c) (C) (r) (R) (tm) (TM) (p) (P) +-',
   '-----',
   '`inline code`',
-  `\`\`\`ts<br>
-const app = 'verticals'; // Your feedback is always welcome!<br>
-<br>
-type IMultiplication = (x: number, y: number) => number;
-
-const multiplication: IMultiplication = (x, y) => x * y;<br>
-<br>
-console.log('What is 737 * 894, mm?');<br>
-<br>
-const result = multiplication(737, 894);<br>  
-<br>
-console.log('Okay. Let me multiply it for you', result); // 658878<br>
-<br>
-const places = ['Domino\`s Pizza', 'Mafia', 'KFC', 'McDonald\`s', 'Евразия'];<br>
-const placeForEatToday = places[Math.floor(Math.random() * Math.floor(places.length))];<br>
-console.log(\`Today you will eat at $\{placeForEatToday}, ofc\`); // Today you will eat at Domino\`s Pizza<br>
-
-\`\`\``,
+  ``,
   `## Tables<br>
 <br>

[NoCoverage] BlockStatement
src/components/FormattingHelp/index.tsx:65:29
   const { renderMarkdown } = useMarkdown();
   const isOpenFormattingHelp = useSelector(getIsOpenFormattingHelp);
 
-  const handleClose = () => {
-    dispatch(SystemActions.setIsOpenFormattingHelp(false));
-  };
+  const handleClose = () => {};
 
   const formattingHelp = useMemo(() => isOpenFormattingHelp && (

[NoCoverage] BooleanLiteral
src/components/FormattingHelp/index.tsx:66:52
   const isOpenFormattingHelp = useSelector(getIsOpenFormattingHelp);
 
   const handleClose = () => {
-    dispatch(SystemActions.setIsOpenFormattingHelp(false));
+    dispatch(SystemActions.setIsOpenFormattingHelp(true));
   };
 

[NoCoverage] ObjectLiteral
src/components/FormattingHelp/index.tsx:76:14
       alt="close"
       imageSize={16}
       size={32}
-      style={{
-        position: 'absolute',
-        right: 0,
-        top: 10,
-      }}
+      style={{}}
       onClick={handleClose}
     />

[NoCoverage] ArrowFunction
src/components/FormattingHelp/index.tsx:90:21
     <div className="formatting-help__content">
       <div className="formatting-help__original">
         {
-        strings.map((string) => (
-          <div dangerouslySetInnerHTML={{ __html: string }} />
-        ))
+        strings.map(() => undefined)
       }
       </div>

[NoCoverage] ObjectLiteral
src/components/FormattingHelp/index.tsx:91:41
       <div className="formatting-help__original">
         {
         strings.map((string) => (
-          <div dangerouslySetInnerHTML={{ __html: string }} />
+          <div dangerouslySetInnerHTML={{}} />
         ))
       }

[NoCoverage] ArrowFunction
src/components/FormattingHelp/index.tsx:99:18
         className="formatting-help__result markdown"
         dangerouslySetInnerHTML={{
           __html: renderMarkdown(strings
-            .map((string) => string.replace(/<br>/g, '')).join('\n\n')),
+            .map(() => undefined).join('\n\n')),
         }}
       />

[NoCoverage] StringLiteral
src/components/FormattingHelp/index.tsx:99:54
         className="formatting-help__result markdown"
         dangerouslySetInnerHTML={{
           __html: renderMarkdown(strings
-            .map((string) => string.replace(/<br>/g, '')).join('\n\n')),
+            .map((string) => string.replace(/<br>/g, "Stryker was here!")).join('\n\n')),
         }}
       />

[NoCoverage] ArrayDeclaration
src/components/FormattingHelp/index.tsx:104:6
       />
     </div>
   </div>
-  ), [t, isOpenFormattingHelp]);
+  ), []);
 
   return (
