[NoCoverage] ConditionalExpression
src/components/Gallery/index.tsx:23:33
 export const Gallery: FC = () => {
   const { t } = useTranslation();
   const dispatch = useDispatch();
-  const { images, index = 0 } = useSelector(getGalleryImagesInfo) || {};
+  const { images, index = 0 } = true;
 
   const [activeIndex, setActiveIndex] = useState<number>(index);

[NoCoverage] LogicalOperator
src/components/Gallery/index.tsx:23:33
 export const Gallery: FC = () => {
   const { t } = useTranslation();
   const dispatch = useDispatch();
-  const { images, index = 0 } = useSelector(getGalleryImagesInfo) || {};
+  const { images, index = 0 } = useSelector(getGalleryImagesInfo) && {};
 
   const [activeIndex, setActiveIndex] = useState<number>(index);

[NoCoverage] BooleanLiteral
src/components/Gallery/index.tsx:26:53
   const { images, index = 0 } = useSelector(getGalleryImagesInfo) || {};
 
   const [activeIndex, setActiveIndex] = useState<number>(index);
-  const [isCopied, setIsCopied] = useState<boolean>(false);
+  const [isCopied, setIsCopied] = useState<boolean>(true);
   const [swiperController, setSwiperController] = useState<SwiperCore>();
 

[NoCoverage] BlockStatement
src/components/Gallery/index.tsx:33:29
 
   const root: HTMLDivElement | null = document.querySelector('#root');
 
-  const handleClose = () => {
-    dispatch(SystemActions.setGalleryImagesInfo(null));
-  };
+  const handleClose = () => {};
 
   useKeys(['Escape'], handleClose);

[NoCoverage] StringLiteral
src/components/Gallery/index.tsx:37:12
     dispatch(SystemActions.setGalleryImagesInfo(null));
   };
 
-  useKeys(['Escape'], handleClose);
+  useKeys([""], handleClose);
 
   const handleDownload = () => {

[NoCoverage] BlockStatement
src/components/Gallery/index.tsx:39:32
 
   useKeys(['Escape'], handleClose);
 
-  const handleDownload = () => {
-    const link = images?.[activeIndex].path;
-    if (link) {
-      download(link);
-    }
-  };
+  const handleDownload = () => {};
 
   const handleCopy = () => {

[NoCoverage] ConditionalExpression
src/components/Gallery/index.tsx:41:9
 
   const handleDownload = () => {
     const link = images?.[activeIndex].path;
-    if (link) {
+    if (false) {
       download(link);
     }

[NoCoverage] BlockStatement
src/components/Gallery/index.tsx:41:15
 
   const handleDownload = () => {
     const link = images?.[activeIndex].path;
-    if (link) {
-      download(link);
-    }
+    if (link) {}
   };
 

[NoCoverage] BlockStatement
src/components/Gallery/index.tsx:46:28
     }
   };
 
-  const handleCopy = () => {
-    setIsCopied(true);
-    setTimeout(() => {
-      setIsCopied(false);
-    }, 1000);
-  };
+  const handleCopy = () => {};
 
   const handleNext = (e: React.SyntheticEvent) => {

[NoCoverage] BooleanLiteral
src/components/Gallery/index.tsx:47:17
   };
 
   const handleCopy = () => {
-    setIsCopied(true);
+    setIsCopied(false);
     setTimeout(() => {
       setIsCopied(false);

[NoCoverage] BlockStatement
src/components/Gallery/index.tsx:48:22
 
   const handleCopy = () => {
     setIsCopied(true);
-    setTimeout(() => {
-      setIsCopied(false);
-    }, 1000);
+    setTimeout(() => {}, 1000);
   };
 

[NoCoverage] BlockStatement
src/components/Gallery/index.tsx:53:51
     }, 1000);
   };
 
-  const handleNext = (e: React.SyntheticEvent) => {
-    e.stopPropagation();
-    swiperController?.slideNext();
-  };
+  const handleNext = (e: React.SyntheticEvent) => {};
 
   const handlePrev = (e: React.SyntheticEvent) => {

[NoCoverage] BlockStatement
src/components/Gallery/index.tsx:58:51
     swiperController?.slideNext();
   };
 
-  const handlePrev = (e: React.SyntheticEvent) => {
-    e.stopPropagation();
-    swiperController?.slidePrev();
-  };
+  const handlePrev = (e: React.SyntheticEvent) => {};
 
   const setBlur = (value: number) => {

[NoCoverage] BlockStatement
src/components/Gallery/index.tsx:63:38
     swiperController?.slidePrev();
   };
 
-  const setBlur = (value: number) => {
-    root!.style.filter = `blur(${value}px)`;
-  };
+  const setBlur = (value: number) => {};
 
   useEffect(() => {

[NoCoverage] BlockStatement
src/components/Gallery/index.tsx:67:19
     root!.style.filter = `blur(${value}px)`;
   };
 
-  useEffect(() => {
-    setBlur(images?.length ? 5 : 0);
-  }, [images]);
+  useEffect(() => {}, [images]);
 
   useEffect(() => {

[NoCoverage] BlockStatement
src/components/Gallery/index.tsx:71:19
     setBlur(images?.length ? 5 : 0);
   }, [images]);
 
-  useEffect(() => {
-    swiperController?.slideTo(index + 1, 0, false);
-  }, [images, index]);
+  useEffect(() => {}, [images, index]);
 
   const memoSwiper = useMemo(() => (

[NoCoverage] BooleanLiteral
src/components/Gallery/index.tsx:72:45
   }, [images]);
 
   useEffect(() => {
-    swiperController?.slideTo(index + 1, 0, false);
+    swiperController?.slideTo(index + 1, 0, true);
   }, [images, index]);
 

[NoCoverage] ArithmeticOperator
src/components/Gallery/index.tsx:72:31
   }, [images]);
 
   useEffect(() => {
-    swiperController?.slideTo(index + 1, 0, false);
+    swiperController?.slideTo(index - 1, 0, false);
   }, [images, index]);
 

[NoCoverage] StringLiteral
src/components/Gallery/index.tsx:85:31
           keyboard
           setWrapperSize
           loop
-          pagination={{ type: 'fraction' }}
+          pagination={{ type: "" }}
           onSwiper={setSwiperController}
           onSlideChangeTransitionEnd={(swiper) => {

[NoCoverage] ObjectLiteral
src/components/Gallery/index.tsx:85:23
           keyboard
           setWrapperSize
           loop
-          pagination={{ type: 'fraction' }}
+          pagination={{}}
           onSwiper={setSwiperController}
           onSlideChangeTransitionEnd={(swiper) => {

[NoCoverage] BlockStatement
src/components/Gallery/index.tsx:87:51
           loop
           pagination={{ type: 'fraction' }}
           onSwiper={setSwiperController}
-          onSlideChangeTransitionEnd={(swiper) => {
-            const newActiveIndex = swiper.activeIndex - 1;
-            setActiveIndex(newActiveIndex);
-          }}
+          onSlideChangeTransitionEnd={(swiper) => {}}
         >
           {

[NoCoverage] ArithmeticOperator
src/components/Gallery/index.tsx:88:36
           pagination={{ type: 'fraction' }}
           onSwiper={setSwiperController}
           onSlideChangeTransitionEnd={(swiper) => {
-            const newActiveIndex = swiper.activeIndex - 1;
+            const newActiveIndex = swiper.activeIndex + 1;
             setActiveIndex(newActiveIndex);
           }}

[NoCoverage] EqualityOperator
src/components/Gallery/index.tsx:93:23
           }}
         >
           {
-            images && images?.length > 0 && images.map((image) => (
+            images && images?.length >= 0 && images.map((image) => (
               <SwiperSlide key={image.path}>
                 <img src={image.path} alt={`${index + 1}`} />

[NoCoverage] EqualityOperator
src/components/Gallery/index.tsx:93:23
           }}
         >
           {
-            images && images?.length > 0 && images.map((image) => (
+            images && images?.length <= 0 && images.map((image) => (
               <SwiperSlide key={image.path}>
                 <img src={image.path} alt={`${index + 1}`} />

[NoCoverage] ArithmeticOperator
src/components/Gallery/index.tsx:95:47
           {
             images && images?.length > 0 && images.map((image) => (
               <SwiperSlide key={image.path}>
-                <img src={image.path} alt={`${index + 1}`} />
+                <img src={image.path} alt={`${index - 1}`} />
               </SwiperSlide>
             ))

[NoCoverage] StringLiteral
src/components/Gallery/index.tsx:95:44
           {
             images && images?.length > 0 && images.map((image) => (
               <SwiperSlide key={image.path}>
-                <img src={image.path} alt={`${index + 1}`} />
+                <img src={image.path} alt={``} />
               </SwiperSlide>
             ))

[NoCoverage] ObjectLiteral
src/components/Gallery/index.tsx:107:35
   ), [images]);
 
   const gallery = (
-    <div className={cn('gallery', {
-      'gallery--is-open': images?.length,
-    })}
+    <div className={cn('gallery', {})}
     >
       <ControlButton

[NoCoverage] ConditionalExpression
src/components/Gallery/index.tsx:139:19
         </div>
         <div className="gallery__control-button">
           <CopyToClipboard
-            text={images?.[activeIndex]?.path || ''}
+            text={false}
             onCopy={handleCopy}
           >

[NoCoverage] LogicalOperator
src/components/Gallery/index.tsx:139:19
         </div>
         <div className="gallery__control-button">
           <CopyToClipboard
-            text={images?.[activeIndex]?.path || ''}
+            text={images?.[activeIndex]?.path && ''}
             onCopy={handleCopy}
           >

[NoCoverage] StringLiteral
src/components/Gallery/index.tsx:156:55
     </div>
   );
 
-  return createPortal(gallery, document.querySelector('#gallery-root')!);
+  return createPortal(gallery, document.querySelector("")!);
 };
 
