[NoCoverage] BlockStatement
src/components/Header/index.tsx:13:19
   const [linkText, setLinkText] = useState<string>('');
   const [link, setLink] = useState<string>('');
 
-  useEffect(() => {
-    if (pathname === '/auth/register') {
-      setLinkText(t('Sign In'));
-      setLink('/auth/login');
-    } else {
-      setLinkText(t('Sign Up'));
-      setLink('/auth/register');
-    }
-  }, [pathname]);
+  useEffect(() => {}, [pathname]);
 
   return (

[NoCoverage] ConditionalExpression
src/components/Header/index.tsx:14:9
   const [link, setLink] = useState<string>('');
 
   useEffect(() => {
-    if (pathname === '/auth/register') {
+    if (false) {
       setLinkText(t('Sign In'));
       setLink('/auth/login');

[NoCoverage] BlockStatement
src/components/Header/index.tsx:14:40
   const [link, setLink] = useState<string>('');
 
   useEffect(() => {
-    if (pathname === '/auth/register') {
-      setLinkText(t('Sign In'));
-      setLink('/auth/login');
-    } else {
+    if (pathname === '/auth/register') {} else {
       setLinkText(t('Sign Up'));
       setLink('/auth/register');

[NoCoverage] BlockStatement
src/components/Header/index.tsx:17:12
     if (pathname === '/auth/register') {
       setLinkText(t('Sign In'));
       setLink('/auth/login');
-    } else {
-      setLinkText(t('Sign Up'));
-      setLink('/auth/register');
-    }
+    } else {}
   }, [pathname]);
 

[NoCoverage] StringLiteral
src/components/Header/index.tsx:18:21
       setLinkText(t('Sign In'));
       setLink('/auth/login');
     } else {
-      setLinkText(t('Sign Up'));
+      setLinkText(t(""));
       setLink('/auth/register');
     }
