[NoCoverage] ConditionalExpression
src/components/Input/index.tsx:43:20
   children,
   ...attrs
 }: IInput, ref: any) => {
-  const isError = (touched && !!error);
+  const isError = (false);
   const isSuccess = !error;
 

[NoCoverage] LogicalOperator
src/components/Input/index.tsx:43:20
   children,
   ...attrs
 }: IInput, ref: any) => {
-  const isError = (touched && !!error);
+  const isError = (touched || !!error);
   const isSuccess = !error;
 

[NoCoverage] BooleanLiteral
src/components/Input/index.tsx:44:21
   ...attrs
 }: IInput, ref: any) => {
   const isError = (touched && !!error);
-  const isSuccess = !error;
+  const isSuccess = error;
 
   const className = cn('input__field', {

[NoCoverage] ObjectLiteral
src/components/Input/index.tsx:46:40
   const isError = (touched && !!error);
   const isSuccess = !error;
 
-  const className = cn('input__field', {
-    'input__field--invalid': isError,
-    'input__field--valid': isSuccess,
-    'input__field--disabled': isDisable,
-    'input__field--light-border': children || isLight,
-  });
+  const className = cn('input__field', {});
 
   return (

[NoCoverage] StringLiteral
src/components/Input/index.tsx:46:24
   const isError = (touched && !!error);
   const isSuccess = !error;
 
-  const className = cn('input__field', {
+  const className = cn("", {
     'input__field--invalid': isError,
     'input__field--valid': isSuccess,

[NoCoverage] ConditionalExpression
src/components/Input/index.tsx:50:35
     'input__field--invalid': isError,
     'input__field--valid': isSuccess,
     'input__field--disabled': isDisable,
-    'input__field--light-border': children || isLight,
+    'input__field--light-border': true,
   });
 

[NoCoverage] ConditionalExpression
src/components/Input/index.tsx:50:35
     'input__field--invalid': isError,
     'input__field--valid': isSuccess,
     'input__field--disabled': isDisable,
-    'input__field--light-border': children || isLight,
+    'input__field--light-border': false,
   });
 

[NoCoverage] ConditionalExpression
src/components/Input/index.tsx:58:13
       <div className="input__wrapper">
         <div className="input__inner">
           {
-            label && <span className="input__label">{label}</span>
+            false
           }
           <div className="input__holder">

[NoCoverage] ConditionalExpression
src/components/Input/index.tsx:58:13
       <div className="input__wrapper">
         <div className="input__inner">
           {
-            label && <span className="input__label">{label}</span>
+            true
           }
           <div className="input__holder">

[NoCoverage] LogicalOperator
src/components/Input/index.tsx:69:26
                   ref={ref}
                   className={className}
                   name={name}
-                  value={value || ''}
+                  value={value && ''}
                   placeholder={placeholder}
                   onChange={onChange}

[NoCoverage] ConditionalExpression
src/components/Input/index.tsx:69:26
                   ref={ref}
                   className={className}
                   name={name}
-                  value={value || ''}
+                  value={true}
                   placeholder={placeholder}
                   onChange={onChange}

[NoCoverage] ObjectLiteral
src/components/Input/index.tsx:96:45
               )
             }
             <div
-              className={cn('input__error', {
-                'input__error--open': isError,
-              })}
+              className={cn('input__error', {})}
             >
               { isError ? error : ''}
