[NoCoverage] StringLiteral
src/components/Loader/Loader.stories.tsx:5:10
 import { Loader } from '@comp/Loader';
 
 export default {
-  title: 'Loader',
+  title: "",
   argTypes: {
     size: { control: { type: 'range', min: 1, max: 1000 }, defaultValue: 25 },

[NoCoverage] ObjectLiteral
src/components/Loader/Loader.stories.tsx:6:13
 
 export default {
   title: 'Loader',
-  argTypes: {
-    size: { control: { type: 'range', min: 1, max: 1000 }, defaultValue: 25 },
-    strokeWidth: { control: { type: 'range', min: 1, max: 50 }, defaultValue: 2 },
-    strokeDashoffset: { control: { type: 'range', min: 1, max: 10000 }, defaultValue: 325 },
-    isOpen: { control: { type: 'boolean' }, defaultValue: true },
-  },
+  argTypes: {},
   decorators: [
     (Story: any) => (

[NoCoverage] StringLiteral
src/components/Loader/Loader.stories.tsx:8:37
   title: 'Loader',
   argTypes: {
     size: { control: { type: 'range', min: 1, max: 1000 }, defaultValue: 25 },
-    strokeWidth: { control: { type: 'range', min: 1, max: 50 }, defaultValue: 2 },
+    strokeWidth: { control: { type: "", min: 1, max: 50 }, defaultValue: 2 },
     strokeDashoffset: { control: { type: 'range', min: 1, max: 10000 }, defaultValue: 325 },
     isOpen: { control: { type: 'boolean' }, defaultValue: true },

[NoCoverage] ObjectLiteral
src/components/Loader/Loader.stories.tsx:9:34
   argTypes: {
     size: { control: { type: 'range', min: 1, max: 1000 }, defaultValue: 25 },
     strokeWidth: { control: { type: 'range', min: 1, max: 50 }, defaultValue: 2 },
-    strokeDashoffset: { control: { type: 'range', min: 1, max: 10000 }, defaultValue: 325 },
+    strokeDashoffset: { control: {}, defaultValue: 325 },
     isOpen: { control: { type: 'boolean' }, defaultValue: true },
   },

[NoCoverage] BooleanLiteral
src/components/Loader/Loader.stories.tsx:10:59
     size: { control: { type: 'range', min: 1, max: 1000 }, defaultValue: 25 },
     strokeWidth: { control: { type: 'range', min: 1, max: 50 }, defaultValue: 2 },
     strokeDashoffset: { control: { type: 'range', min: 1, max: 10000 }, defaultValue: 325 },
-    isOpen: { control: { type: 'boolean' }, defaultValue: true },
+    isOpen: { control: { type: 'boolean' }, defaultValue: false },
   },
   decorators: [

[NoCoverage] StringLiteral
src/components/Loader/Loader.stories.tsx:10:32
     size: { control: { type: 'range', min: 1, max: 1000 }, defaultValue: 25 },
     strokeWidth: { control: { type: 'range', min: 1, max: 50 }, defaultValue: 2 },
     strokeDashoffset: { control: { type: 'range', min: 1, max: 10000 }, defaultValue: 325 },
-    isOpen: { control: { type: 'boolean' }, defaultValue: true },
+    isOpen: { control: { type: "" }, defaultValue: true },
   },
   decorators: [

[NoCoverage] ArrowFunction
src/components/Loader/Loader.stories.tsx:13:5
     isOpen: { control: { type: 'boolean' }, defaultValue: true },
   },
   decorators: [
-    (Story: any) => (
-      <div style={{ height: 400, width: 400 }}>
-        <Story />
-      </div>
-    ),
+    () => undefined,
   ],
 };

[NoCoverage] ArrowFunction
src/components/Loader/Loader.stories.tsx:21:24
   ],
 };
 
-export const Default = (args: any) => (
-  <Loader
-    {...args}
-    style={{
-      position: 'absolute',
-      width: args.size,
-      height: args.size,
-    }}
-  />
-);
+export const Default = () => undefined;
 

[NoCoverage] ObjectLiteral
src/components/Loader/Loader.stories.tsx:24:12
 export const Default = (args: any) => (
   <Loader
     {...args}
-    style={{
-      position: 'absolute',
-      width: args.size,
-      height: args.size,
-    }}
+    style={{}}
   />
 );
