[NoCoverage] BooleanLiteral
src/components/Menu/index.tsx:47:18
   text,
   alt,
   tooltip,
-  isHoverBlock = false,
+  isHoverBlock = true,
   imageSize = 12,
   size,

[NoCoverage] BooleanLiteral
src/components/Menu/index.tsx:57:16
   onMouseEnter,
   onMouseLeave,
   position,
-  isAbsolute = true,
+  isAbsolute = false,
   isInvertColor,
   isPrimary,

[NoCoverage] ConditionalExpression
src/components/Menu/index.tsx:67:21
 }: IMenu, ref: any) => {
   const dispatch = useDispatch();
   const activePopupId = useSelector(getActivePopupId);
-  const sourceRef = ref || useRef<any>(null);
+  const sourceRef = false;
 
   const isActive = activePopupId === id;

[NoCoverage] LogicalOperator
src/components/Menu/index.tsx:67:21
 }: IMenu, ref: any) => {
   const dispatch = useDispatch();
   const activePopupId = useSelector(getActivePopupId);
-  const sourceRef = ref || useRef<any>(null);
+  const sourceRef = ref && useRef<any>(null);
 
   const isActive = activePopupId === id;

[NoCoverage] ConditionalExpression
src/components/Menu/index.tsx:69:20
   const activePopupId = useSelector(getActivePopupId);
   const sourceRef = ref || useRef<any>(null);
 
-  const isActive = activePopupId === id;
+  const isActive = false;
 
   const switchPopup = () => {

[NoCoverage] EqualityOperator
src/components/Menu/index.tsx:69:20
   const activePopupId = useSelector(getActivePopupId);
   const sourceRef = ref || useRef<any>(null);
 
-  const isActive = activePopupId === id;
+  const isActive = activePopupId !== id;
 
   const switchPopup = () => {

[NoCoverage] BlockStatement
src/components/Menu/index.tsx:71:29
 
   const isActive = activePopupId === id;
 
-  const switchPopup = () => {
-    if (isActive) {
-      dispatch(SystemActions.setActivePopupId(null));
-    } else {
-      dispatch(SystemActions.setActivePopupId(id));
-    }
-  };
+  const switchPopup = () => {};
 
   const handleClick = (event: SyntheticEvent) => {

[NoCoverage] ConditionalExpression
src/components/Menu/index.tsx:72:9
   const isActive = activePopupId === id;
 
   const switchPopup = () => {
-    if (isActive) {
+    if (false) {
       dispatch(SystemActions.setActivePopupId(null));
     } else {

[NoCoverage] BlockStatement
src/components/Menu/index.tsx:72:19
   const isActive = activePopupId === id;
 
   const switchPopup = () => {
-    if (isActive) {
-      dispatch(SystemActions.setActivePopupId(null));
-    } else {
+    if (isActive) {} else {
       dispatch(SystemActions.setActivePopupId(id));
     }

[NoCoverage] BlockStatement
src/components/Menu/index.tsx:74:12
   const switchPopup = () => {
     if (isActive) {
       dispatch(SystemActions.setActivePopupId(null));
-    } else {
-      dispatch(SystemActions.setActivePopupId(id));
-    }
+    } else {}
   };
 

[NoCoverage] BlockStatement
src/components/Menu/index.tsx:79:50
     }
   };
 
-  const handleClick = (event: SyntheticEvent) => {
-    event.stopPropagation();
-    onClick?.(event);
-    switchPopup();
-  };
+  const handleClick = (event: SyntheticEvent) => {};
 
   useKeys(['Escape'], switchPopup, {

[NoCoverage] ArrowFunction
src/components/Menu/index.tsx:89:20
     when: isActive,
   });
 
-  const wrapping = (child: ReactElement) => (
-    React.cloneElement(
-      child, {
-        ...child.props,
-        onClick: () => {
-          onSelect(child.props.action, child.props.payload);
-        },
-      },
-    )
-  );
+  const wrapping = () => undefined;
 
   const popup = useMemo(() => (

[NoCoverage] BlockStatement
src/components/Menu/index.tsx:93:24
     React.cloneElement(
       child, {
         ...child.props,
-        onClick: () => {
-          onSelect(child.props.action, child.props.payload);
-        },
+        onClick: () => {},
       },
     )

[NoCoverage] BlockStatement
src/components/Menu/index.tsx:109:105
       style={{ zIndex: 2 }}
       width={width}
     >
-      {React.Children.map(children, (child: ReactComponentElement<typeof MenuItem | typeof Submenu>) => {
-        if (child.type.name === 'MenuItem') {
-          return wrapping(child);
-        }
-        if (child.type.name === 'Submenu') {
-          return React.cloneElement(
-            child, {
-              ...child.props,
-              // @ts-ignore
-              children: React.Children.map(child.props.children, wrapping),
-            },
-          );
-        }
-        return (
-          React.cloneElement(
-            child, {
-              ...child.props,
-            },
-          )
-        );
-      })}
+      {React.Children.map(children, (child: ReactComponentElement<typeof MenuItem | typeof Submenu>) => {})}
     </Popup>
   ),

[NoCoverage] BlockStatement
src/components/Menu/index.tsx:110:45
       width={width}
     >
       {React.Children.map(children, (child: ReactComponentElement<typeof MenuItem | typeof Submenu>) => {
-        if (child.type.name === 'MenuItem') {
-          return wrapping(child);
-        }
+        if (child.type.name === 'MenuItem') {}
         if (child.type.name === 'Submenu') {
           return React.cloneElement(

[NoCoverage] ConditionalExpression
src/components/Menu/index.tsx:110:13
       width={width}
     >
       {React.Children.map(children, (child: ReactComponentElement<typeof MenuItem | typeof Submenu>) => {
-        if (child.type.name === 'MenuItem') {
+        if (false) {
           return wrapping(child);
         }

[NoCoverage] EqualityOperator
src/components/Menu/index.tsx:113:13
         if (child.type.name === 'MenuItem') {
           return wrapping(child);
         }
-        if (child.type.name === 'Submenu') {
+        if (child.type.name !== 'Submenu') {
           return React.cloneElement(
             child, {

[NoCoverage] BlockStatement
src/components/Menu/index.tsx:113:44
         if (child.type.name === 'MenuItem') {
           return wrapping(child);
         }
-        if (child.type.name === 'Submenu') {
-          return React.cloneElement(
-            child, {
-              ...child.props,
-              // @ts-ignore
-              children: React.Children.map(child.props.children, wrapping),
-            },
-          );
-        }
+        if (child.type.name === 'Submenu') {}
         return (
           React.cloneElement(

[NoCoverage] ObjectLiteral
src/components/Menu/index.tsx:115:20
         }
         if (child.type.name === 'Submenu') {
           return React.cloneElement(
-            child, {
-              ...child.props,
-              // @ts-ignore
-              children: React.Children.map(child.props.children, wrapping),
-            },
+            child, {},
           );
         }

[NoCoverage] ArrowFunction
src/components/Menu/index.tsx:134:26
   ),
   [isActive, position, sourceRef, isAbsolute, children]);
 
-  const button = useMemo(() => (
-    <ControlButton
-      ref={sourceRef}
-      imageSrc={imageSrc}
-      alt={alt}
-      imageSize={imageSize}
-      tooltip={tooltip}
-      size={size}
-      style={style}
-      text={text}
-      animationDuration={0}
-      isHide={isHide}
-      isInvisible={isInvisible}
-      isHoverBlock={isHoverBlock}
-      isMaxWidth={isMaxWidth}
-      isInvertColor={isInvertColor}
-      isPrimary={isPrimary}
-      isColored={isColored}
-      isStopPropagation={false}
-      onClick={handleClick}
-      onDoubleClick={(e) => e.stopPropagation()}
-      onMouseEnter={onMouseEnter}
-      onMouseLeave={onMouseLeave}
-    />
-  ), [
+  const button = useMemo(() => undefined, [
     isHide, isHoverBlock, isMaxWidth,
     isInvertColor, size, imageSrc,

[NoCoverage] ArrowFunction
src/components/Menu/index.tsx:154:22
       isColored={isColored}
       isStopPropagation={false}
       onClick={handleClick}
-      onDoubleClick={(e) => e.stopPropagation()}
+      onDoubleClick={() => undefined}
       onMouseEnter={onMouseEnter}
       onMouseLeave={onMouseLeave}

[NoCoverage] ArrayDeclaration
src/components/Menu/index.tsx:158:6
       onMouseEnter={onMouseEnter}
       onMouseLeave={onMouseLeave}
     />
-  ), [
-    isHide, isHoverBlock, isMaxWidth,
-    isInvertColor, size, imageSrc,
-    alt, text,
-    activePopupId, style,
-  ]);
+  ), []);
 
   const handleOutsideClick = () => {

[NoCoverage] BlockStatement
src/components/Menu/index.tsx:165:36
     activePopupId, style,
   ]);
 
-  const handleOutsideClick = () => {
-    dispatch(SystemActions.setActivePopupId(null));
-  };
+  const handleOutsideClick = () => {};
 
   const [wrapperRef] = useOutsideClickRef(handleOutsideClick, !!activePopupId);

[NoCoverage] BooleanLiteral
src/components/Menu/index.tsx:169:64
     dispatch(SystemActions.setActivePopupId(null));
   };
 
-  const [wrapperRef] = useOutsideClickRef(handleOutsideClick, !!activePopupId);
+  const [wrapperRef] = useOutsideClickRef(handleOutsideClick, !activePopupId);
 
   return (
