[NoCoverage] BooleanLiteral
src/components/MenuItem/index.tsx:26:17
   hintText,
   hintImageSrc,
   isColoredHintImage,
-  isAutoClose = true,
+  isAutoClose = false,
   onClick,
   // action,

[NoCoverage] BlockStatement
src/components/MenuItem/index.tsx:35:29
 }) => {
   const dispatch = useDispatch();
 
-  const handleClick = () => {
-    if (isAutoClose) {
-      dispatch(SystemActions.setActivePopupId(null));
-    }
-    onClick?.();
-  };
+  const handleClick = () => {};
 
   return (

[NoCoverage] ConditionalExpression
src/components/MenuItem/index.tsx:36:9
   const dispatch = useDispatch();
 
   const handleClick = () => {
-    if (isAutoClose) {
+    if (false) {
       dispatch(SystemActions.setActivePopupId(null));
     }

[NoCoverage] BlockStatement
src/components/MenuItem/index.tsx:36:22
   const dispatch = useDispatch();
 
   const handleClick = () => {
-    if (isAutoClose) {
-      dispatch(SystemActions.setActivePopupId(null));
-    }
+    if (isAutoClose) {}
     onClick?.();
   };

[NoCoverage] StringLiteral
src/components/MenuItem/index.tsx:79:27
           <img
             src={hintImageSrc}
             alt="hint"
-            className={cn('menu-item__hint-icon', {
+            className={cn("", {
               'menu-item__hint-icon--colored': isColoredHintImage,
             })}
