[NoCoverage] ObjectLiteral
src/components/Modal/Modal.stories-disabled.tsx:4:16
 import React from 'react';
 import { Modal } from '@comp/Modal';
 
-export default {
-  title: 'Modal',
-  argTypes: {
-    isOpen: { control: { type: 'boolean' }, defaultValue: true },
-    type: { control: { type: 'select', options: ['button', 'submit'] }, defaultValue: 'button' },
-    isSoftExit: { control: { type: 'boolean' }, defaultValue: true },
-    negative: { control: { type: 'text' }, defaultValue: 'Negative text' },
-    positive: { control: { type: 'text' }, defaultValue: 'Positive text' },
-    onPositive: { action: 'positive' },
-    onNegative: { action: 'negative' },
-    onClose: { action: 'close' },
-    size: { control: { type: 'select', options: ['small', 'medium', 'large'] }, defaultValue: 'medium' },
-  },
-};
+export default {};
 
 export const Default = (args: any) => <Modal {...args} />;

[NoCoverage] ObjectLiteral
src/components/Modal/Modal.stories-disabled.tsx:6:13
 
 export default {
   title: 'Modal',
-  argTypes: {
-    isOpen: { control: { type: 'boolean' }, defaultValue: true },
-    type: { control: { type: 'select', options: ['button', 'submit'] }, defaultValue: 'button' },
-    isSoftExit: { control: { type: 'boolean' }, defaultValue: true },
-    negative: { control: { type: 'text' }, defaultValue: 'Negative text' },
-    positive: { control: { type: 'text' }, defaultValue: 'Positive text' },
-    onPositive: { action: 'positive' },
-    onNegative: { action: 'negative' },
-    onClose: { action: 'close' },
-    size: { control: { type: 'select', options: ['small', 'medium', 'large'] }, defaultValue: 'medium' },
-  },
+  argTypes: {},
 };
 

[NoCoverage] StringLiteral
src/components/Modal/Modal.stories-disabled.tsx:8:60
   title: 'Modal',
   argTypes: {
     isOpen: { control: { type: 'boolean' }, defaultValue: true },
-    type: { control: { type: 'select', options: ['button', 'submit'] }, defaultValue: 'button' },
+    type: { control: { type: 'select', options: ['button', ""] }, defaultValue: 'button' },
     isSoftExit: { control: { type: 'boolean' }, defaultValue: true },
     negative: { control: { type: 'text' }, defaultValue: 'Negative text' },

[NoCoverage] ArrayDeclaration
src/components/Modal/Modal.stories-disabled.tsx:8:49
   title: 'Modal',
   argTypes: {
     isOpen: { control: { type: 'boolean' }, defaultValue: true },
-    type: { control: { type: 'select', options: ['button', 'submit'] }, defaultValue: 'button' },
+    type: { control: { type: 'select', options: [] }, defaultValue: 'button' },
     isSoftExit: { control: { type: 'boolean' }, defaultValue: true },
     negative: { control: { type: 'text' }, defaultValue: 'Negative text' },

[NoCoverage] BooleanLiteral
src/components/Modal/Modal.stories-disabled.tsx:9:63
   argTypes: {
     isOpen: { control: { type: 'boolean' }, defaultValue: true },
     type: { control: { type: 'select', options: ['button', 'submit'] }, defaultValue: 'button' },
-    isSoftExit: { control: { type: 'boolean' }, defaultValue: true },
+    isSoftExit: { control: { type: 'boolean' }, defaultValue: false },
     negative: { control: { type: 'text' }, defaultValue: 'Negative text' },
     positive: { control: { type: 'text' }, defaultValue: 'Positive text' },

[NoCoverage] ObjectLiteral
src/components/Modal/Modal.stories-disabled.tsx:10:26
     isOpen: { control: { type: 'boolean' }, defaultValue: true },
     type: { control: { type: 'select', options: ['button', 'submit'] }, defaultValue: 'button' },
     isSoftExit: { control: { type: 'boolean' }, defaultValue: true },
-    negative: { control: { type: 'text' }, defaultValue: 'Negative text' },
+    negative: { control: {}, defaultValue: 'Negative text' },
     positive: { control: { type: 'text' }, defaultValue: 'Positive text' },
     onPositive: { action: 'positive' },

[NoCoverage] StringLiteral
src/components/Modal/Modal.stories-disabled.tsx:11:58
     type: { control: { type: 'select', options: ['button', 'submit'] }, defaultValue: 'button' },
     isSoftExit: { control: { type: 'boolean' }, defaultValue: true },
     negative: { control: { type: 'text' }, defaultValue: 'Negative text' },
-    positive: { control: { type: 'text' }, defaultValue: 'Positive text' },
+    positive: { control: { type: 'text' }, defaultValue: "" },
     onPositive: { action: 'positive' },
     onNegative: { action: 'negative' },

[NoCoverage] StringLiteral
src/components/Modal/Modal.stories-disabled.tsx:14:24
     positive: { control: { type: 'text' }, defaultValue: 'Positive text' },
     onPositive: { action: 'positive' },
     onNegative: { action: 'negative' },
-    onClose: { action: 'close' },
+    onClose: { action: "" },
     size: { control: { type: 'select', options: ['small', 'medium', 'large'] }, defaultValue: 'medium' },
   },

[NoCoverage] ArrowFunction
src/components/Modal/Modal.stories-disabled.tsx:19:24
   },
 };
 
-export const Default = (args: any) => <Modal {...args} />;
+export const Default = () => undefined;
 
