[NoCoverage] StringLiteral
src/components/Modal/index.tsx:24:10
 
 export const Modal: FC<IModal> = ({
   isOpen,
-  type = 'button',
+  type = "",
   isSoftExit = true,
   negative,

[NoCoverage] BooleanLiteral
src/components/Modal/index.tsx:25:16
 export const Modal: FC<IModal> = ({
   isOpen,
   type = 'button',
-  isSoftExit = true,
+  isSoftExit = false,
   negative,
   positive,

[NoCoverage] ArrowFunction
src/components/Modal/index.tsx:30:19
   positive,
   onPositive,
   onNegative,
-  renderWrapper = (c: React.ReactChild) => c,
+  renderWrapper = () => undefined,
   onClose,
   size = 'small',

[NoCoverage] StringLiteral
src/components/Modal/index.tsx:35:62
   size = 'small',
   children,
 }) => {
-  const root: HTMLDivElement | null = document.querySelector('#root');
+  const root: HTMLDivElement | null = document.querySelector("");
 
   const handleOutsideClick = () => {

[NoCoverage] BlockStatement
src/components/Modal/index.tsx:37:36
 }) => {
   const root: HTMLDivElement | null = document.querySelector('#root');
 
-  const handleOutsideClick = () => {
-    if (isSoftExit) onClose();
-  };
+  const handleOutsideClick = () => {};
 
   const setBlur = (value: number) => {

[NoCoverage] ConditionalExpression
src/components/Modal/index.tsx:38:9
   const root: HTMLDivElement | null = document.querySelector('#root');
 
   const handleOutsideClick = () => {
-    if (isSoftExit) onClose();
+    if (true) onClose();
   };
 

[NoCoverage] ConditionalExpression
src/components/Modal/index.tsx:38:9
   const root: HTMLDivElement | null = document.querySelector('#root');
 
   const handleOutsideClick = () => {
-    if (isSoftExit) onClose();
+    if (false) onClose();
   };
 

[NoCoverage] StringLiteral
src/components/Modal/index.tsx:42:26
   };
 
   const setBlur = (value: number) => {
-    root!.style.filter = `blur(${value}px)`;
+    root!.style.filter = ``;
   };
 

[NoCoverage] BlockStatement
src/components/Modal/index.tsx:45:15
     root!.style.filter = `blur(${value}px)`;
   };
 
-  if (isOpen) {
-    setBlur(5);
-  } else {
+  if (isOpen) {} else {
     setBlur(0);
   }

[NoCoverage] ConditionalExpression
src/components/Modal/index.tsx:45:7
     root!.style.filter = `blur(${value}px)`;
   };
 
-  if (isOpen) {
+  if (true) {
     setBlur(5);
   } else {

[NoCoverage] BlockStatement
src/components/Modal/index.tsx:47:10
 
   if (isOpen) {
     setBlur(5);
-  } else {
-    setBlur(0);
-  }
+  } else {}
 
   const handleEscape = () => {

[NoCoverage] BlockStatement
src/components/Modal/index.tsx:51:30
     setBlur(0);
   }
 
-  const handleEscape = () => {
-    if (isOpen && isSoftExit) {
-      onClose();
-    }
-  };
+  const handleEscape = () => {};
 
   useKeys(['Escape'], handleEscape);

[NoCoverage] ConditionalExpression
src/components/Modal/index.tsx:52:9
   }
 
   const handleEscape = () => {
-    if (isOpen && isSoftExit) {
+    if (true) {
       onClose();
     }

[NoCoverage] ConditionalExpression
src/components/Modal/index.tsx:52:9
   }
 
   const handleEscape = () => {
-    if (isOpen && isSoftExit) {
+    if (false) {
       onClose();
     }

[NoCoverage] ArrayDeclaration
src/components/Modal/index.tsx:57:11
     }
   };
 
-  useKeys(['Escape'], handleEscape);
+  useKeys([], handleEscape);
 
   const [modalRef] = useOutsideClickRef(handleOutsideClick, isOpen);

[NoCoverage] ObjectLiteral
src/components/Modal/index.tsx:62:34
   const [modalRef] = useOutsideClickRef(handleOutsideClick, isOpen);
 
   const modal = (
-    <div className={cn('dialog', {
-      'dialog--is-open': isOpen,
-    })}
+    <div className={cn('dialog', {})}
     >
       <div

[NoCoverage] StringLiteral
src/components/Modal/index.tsx:62:24
   const [modalRef] = useOutsideClickRef(handleOutsideClick, isOpen);
 
   const modal = (
-    <div className={cn('dialog', {
+    <div className={cn("", {
       'dialog--is-open': isOpen,
     })}

[NoCoverage] BooleanLiteral
src/components/Modal/index.tsx:86:18
             renderWrapper(
               <>
                 {children}
-                {!renderWrapper ? children : null}
+                {renderWrapper ? children : null}
                 <div className="dialog__prompt">
                   {negative && (

[NoCoverage] ConditionalExpression
src/components/Modal/index.tsx:88:20
                 {children}
                 {!renderWrapper ? children : null}
                 <div className="dialog__prompt">
-                  {negative && (
-                  <Button
-                    type="button"
-                    modificator="transparent"
-                    onClick={onNegative}
-                  >
-                    {negative}
-                  </Button>
-                  )}
+                  {false}
                   <Button
                     type={type}

[NoCoverage] LogicalOperator
src/components/Modal/index.tsx:88:20
                 {children}
                 {!renderWrapper ? children : null}
                 <div className="dialog__prompt">
-                  {negative && (
-                  <Button
-                    type="button"
-                    modificator="transparent"
-                    onClick={onNegative}
-                  >
-                    {negative}
-                  </Button>
-                  )}
+                  {negative || <Button type="button" modificator="transparent" onClick={onNegative}>
+                    {negative}
+                  </Button>}
                   <Button
                     type={type}

[NoCoverage] StringLiteral
src/components/Modal/index.tsx:112:53
     </div>
   );
 
-  return createPortal(modal, document.querySelector('#modal-root')!);
+  return createPortal(modal, document.querySelector("")!);
 };
 
