[NoCoverage] StringLiteral
src/components/NavLink/index.tsx:24:23
   strict,
   location,
   activeClassName = '',
-  inactiveClassName = '',
+  inactiveClassName = "Stryker was here!",
   className = '',
   activeStyle,

[NoCoverage] StringLiteral
src/components/NavLink/index.tsx:25:15
   location,
   activeClassName = '',
   inactiveClassName = '',
-  className = '',
+  className = "Stryker was here!",
   activeStyle,
   style,

[NoCoverage] ConditionalExpression
src/components/NavLink/index.tsx:33:11
   ...rest
 }) => (
   <Route
-    path={typeof to === 'object' ? to.pathname : to}
+    path={false ? to.pathname : to}
     exact={exact}
     strict={strict}

[NoCoverage] ConditionalExpression
src/components/NavLink/index.tsx:33:11
   ...rest
 }) => (
   <Route
-    path={typeof to === 'object' ? to.pathname : to}
+    path={true ? to.pathname : to}
     exact={exact}
     strict={strict}

[NoCoverage] BlockStatement
src/components/NavLink/index.tsx:38:34
     strict={strict}
     location={location}
   >
-    {({ location: l, match }) => {
-      const isActive = !!(getIsActive ? getIsActive(match, l) : match);
-      return (
-        <Link
-          to={to}
-          className={cn(className, {
-            [activeClassName]: isActive,
-            [inactiveClassName]: !isActive,
-          })}
-          style={isActive ? { ...style, ...activeStyle } : style}
-          {...rest}
-          onClick={(e) => e.stopPropagation()}
-        >
-          {typeof children === 'function' ? children(isActive) : children}
-        </Link>
-      );
-    }}
+    {({ location: l, match }) => {}}
   </Route>
 );

[NoCoverage] BooleanLiteral
src/components/NavLink/index.tsx:39:24
     location={location}
   >
     {({ location: l, match }) => {
-      const isActive = !!(getIsActive ? getIsActive(match, l) : match);
+      const isActive = !(getIsActive ? getIsActive(match, l) : match);
       return (
         <Link

[NoCoverage] BooleanLiteral
src/components/NavLink/index.tsx:39:25
     location={location}
   >
     {({ location: l, match }) => {
-      const isActive = !!(getIsActive ? getIsActive(match, l) : match);
+      const isActive = !getIsActive ? getIsActive(match, l) : match;
       return (
         <Link

[NoCoverage] BooleanLiteral
src/components/NavLink/index.tsx:45:34
           to={to}
           className={cn(className, {
             [activeClassName]: isActive,
-            [inactiveClassName]: !isActive,
+            [inactiveClassName]: isActive,
           })}
           style={isActive ? { ...style, ...activeStyle } : style}

[NoCoverage] ArrowFunction
src/components/NavLink/index.tsx:49:20
           })}
           style={isActive ? { ...style, ...activeStyle } : style}
           {...rest}
-          onClick={(e) => e.stopPropagation()}
+          onClick={() => undefined}
         >
           {typeof children === 'function' ? children(isActive) : children}

[NoCoverage] ConditionalExpression
src/components/NavLink/index.tsx:51:12
           {...rest}
           onClick={(e) => e.stopPropagation()}
         >
-          {typeof children === 'function' ? children(isActive) : children}
+          {true ? children(isActive) : children}
         </Link>
       );

[NoCoverage] EqualityOperator
src/components/NavLink/index.tsx:51:12
           {...rest}
           onClick={(e) => e.stopPropagation()}
         >
-          {typeof children === 'function' ? children(isActive) : children}
+          {typeof children !== 'function' ? children(isActive) : children}
         </Link>
       );
