[NoCoverage] BooleanLiteral
src/components/Profile/index.tsx:36:53
   const username = useSelector(getUsername);
 
   const { isHovering, hoveringProps } = useHover();
-  const [isCopied, setIsCopied] = useState<boolean>(false);
+  const [isCopied, setIsCopied] = useState<boolean>(true);
 
   const handleClose = () => {

[NoCoverage] BlockStatement
src/components/Profile/index.tsx:38:29
   const { isHovering, hoveringProps } = useHover();
   const [isCopied, setIsCopied] = useState<boolean>(false);
 
-  const handleClose = () => {
-    dispatch(SystemActions.setIsOpenProfile(false));
-  };
+  const handleClose = () => {};
 
   const handleMenuButtonClick = (action: EnumMenuActions) => {

[NoCoverage] BooleanLiteral
src/components/Profile/index.tsx:39:45
   const [isCopied, setIsCopied] = useState<boolean>(false);
 
   const handleClose = () => {
-    dispatch(SystemActions.setIsOpenProfile(false));
+    dispatch(SystemActions.setIsOpenProfile(true));
   };
 

[NoCoverage] BlockStatement
src/components/Profile/index.tsx:42:62
     dispatch(SystemActions.setIsOpenProfile(false));
   };
 
-  const handleMenuButtonClick = (action: EnumMenuActions) => {
-    switch (action) {
-      case EnumMenuActions.OpenProfile: {
-        dispatch(SystemActions.setIsOpenProfile(!isOpenProfile));
-        break;
-      }
-      case EnumMenuActions.ProfileSettings: {
-        redirectTo('/settings/profile');
-        break;
-      }
-      case EnumMenuActions.AddBoard: {
-        onAddNewBoard();
-        break;
-      }
-      case EnumMenuActions.CopyLink: {
-        setIsCopied(true);
-        setTimeout(() => {
-          setIsCopied(false);
-          dispatch(SystemActions.setActivePopupId(null));
-        }, 1000);
-        break;
-      }
-      default: break;
-    }
-  };
+  const handleMenuButtonClick = (action: EnumMenuActions) => {};
 
   const profile = useMemo(() => isOpenProfile && (

[NoCoverage] ConditionalExpression
src/components/Profile/index.tsx:44:7
 
   const handleMenuButtonClick = (action: EnumMenuActions) => {
     switch (action) {
-      case EnumMenuActions.OpenProfile: {
-        dispatch(SystemActions.setIsOpenProfile(!isOpenProfile));
-        break;
-      }
+      case EnumMenuActions.OpenProfile:
       case EnumMenuActions.ProfileSettings: {
         redirectTo('/settings/profile');

[NoCoverage] BlockStatement
src/components/Profile/index.tsx:44:41
 
   const handleMenuButtonClick = (action: EnumMenuActions) => {
     switch (action) {
-      case EnumMenuActions.OpenProfile: {
-        dispatch(SystemActions.setIsOpenProfile(!isOpenProfile));
-        break;
-      }
+      case EnumMenuActions.OpenProfile: {}
       case EnumMenuActions.ProfileSettings: {
         redirectTo('/settings/profile');

[NoCoverage] BooleanLiteral
src/components/Profile/index.tsx:45:49
   const handleMenuButtonClick = (action: EnumMenuActions) => {
     switch (action) {
       case EnumMenuActions.OpenProfile: {
-        dispatch(SystemActions.setIsOpenProfile(!isOpenProfile));
+        dispatch(SystemActions.setIsOpenProfile(isOpenProfile));
         break;
       }

[NoCoverage] BlockStatement
src/components/Profile/index.tsx:48:45
         dispatch(SystemActions.setIsOpenProfile(!isOpenProfile));
         break;
       }
-      case EnumMenuActions.ProfileSettings: {
-        redirectTo('/settings/profile');
-        break;
-      }
+      case EnumMenuActions.ProfileSettings: {}
       case EnumMenuActions.AddBoard: {
         onAddNewBoard();

[NoCoverage] ConditionalExpression
src/components/Profile/index.tsx:48:7
         dispatch(SystemActions.setIsOpenProfile(!isOpenProfile));
         break;
       }
-      case EnumMenuActions.ProfileSettings: {
-        redirectTo('/settings/profile');
-        break;
-      }
+      case EnumMenuActions.ProfileSettings:
       case EnumMenuActions.AddBoard: {
         onAddNewBoard();

[NoCoverage] StringLiteral
src/components/Profile/index.tsx:49:20
         break;
       }
       case EnumMenuActions.ProfileSettings: {
-        redirectTo('/settings/profile');
+        redirectTo("");
         break;
       }

[NoCoverage] BlockStatement
src/components/Profile/index.tsx:52:38
         redirectTo('/settings/profile');
         break;
       }
-      case EnumMenuActions.AddBoard: {
-        onAddNewBoard();
-        break;
-      }
+      case EnumMenuActions.AddBoard: {}
       case EnumMenuActions.CopyLink: {
         setIsCopied(true);

[NoCoverage] ConditionalExpression
src/components/Profile/index.tsx:52:7
         redirectTo('/settings/profile');
         break;
       }
-      case EnumMenuActions.AddBoard: {
-        onAddNewBoard();
-        break;
-      }
+      case EnumMenuActions.AddBoard:
       case EnumMenuActions.CopyLink: {
         setIsCopied(true);

[NoCoverage] ConditionalExpression
src/components/Profile/index.tsx:56:7
         onAddNewBoard();
         break;
       }
-      case EnumMenuActions.CopyLink: {
-        setIsCopied(true);
-        setTimeout(() => {
-          setIsCopied(false);
-          dispatch(SystemActions.setActivePopupId(null));
-        }, 1000);
-        break;
-      }
+      case EnumMenuActions.CopyLink:
       default: break;
     }

[NoCoverage] BlockStatement
src/components/Profile/index.tsx:56:38
         onAddNewBoard();
         break;
       }
-      case EnumMenuActions.CopyLink: {
-        setIsCopied(true);
-        setTimeout(() => {
-          setIsCopied(false);
-          dispatch(SystemActions.setActivePopupId(null));
-        }, 1000);
-        break;
-      }
+      case EnumMenuActions.CopyLink: {}
       default: break;
     }

[NoCoverage] ArrowFunction
src/components/Profile/index.tsx:68:27
     }
   };
 
-  const profile = useMemo(() => isOpenProfile && (
-  <div className="profile__popup">
-    <ControlButton
-      imageSrc="/assets/svg/close.svg"
-      alt="close"
-      imageSize={16}
-      size={32}
-      style={{
-        position: 'absolute',
-        right: 10,
-        top: 10,
-      }}
-      onClick={handleClose}
-    />
-    <Avatar size={180} />
-    <h1 className="profile__popup-title">{fullName}</h1>
-    <h4 className="profile__popup-subtitle">
-      @
-      {username}
-    </h4>
-  </div>
-  ), [isOpenProfile]);
+  const profile = useMemo(() => undefined, [isOpenProfile]);
 
   return (

[NoCoverage] ConditionalExpression
src/components/Profile/index.tsx:68:33
     }
   };
 
-  const profile = useMemo(() => isOpenProfile && (
-  <div className="profile__popup">
-    <ControlButton
-      imageSrc="/assets/svg/close.svg"
-      alt="close"
-      imageSize={16}
-      size={32}
-      style={{
-        position: 'absolute',
-        right: 10,
-        top: 10,
-      }}
-      onClick={handleClose}
-    />
-    <Avatar size={180} />
-    <h1 className="profile__popup-title">{fullName}</h1>
-    <h4 className="profile__popup-subtitle">
-      @
-      {username}
-    </h4>
-  </div>
-  ), [isOpenProfile]);
+  const profile = useMemo(() => true, [isOpenProfile]);
 
   return (

[NoCoverage] BlockStatement
src/components/Profile/index.tsx:97:24
       {...hoveringProps}
     >
       <Avatar
-        onClick={() => {
-          handleMenuButtonClick(EnumMenuActions.OpenProfile);
-        }}
+        onClick={() => {}}
       />
       <Menu

[NoCoverage] BooleanLiteral
src/components/Profile/index.tsx:110:21
         isInvisible
         isHoverBlock={isHovering}
         position="bottom"
-        isAbsolute={false}
+        isAbsolute={true}
         onSelect={handleMenuButtonClick}
       >

[NoCoverage] BlockStatement
src/components/Profile/index.tsx:132:25
         />
         <CopyToClipboard
           text={`verticals.xom9ik.com/${username}`} // TODO: move to env
-          onCopy={() => {
-            handleMenuButtonClick(EnumMenuActions.CopyLink);
-          }}
+          onCopy={() => {}}
         >
           <MenuItem
