[NoCoverage] StringLiteral
src/components/RoundedButton/RoundedButton.stories.tsx:8:54
 export default {
   title: 'RoundedButton',
   argTypes: {
-    icon: { control: { type: 'text' }, defaultValue: '/assets/svg/menu/add-board.svg' },
+    icon: { control: { type: 'text' }, defaultValue: "" },
     isSpecialIcon: { control: { type: 'boolean' }, defaultValue: false },
     color: {

[NoCoverage] BooleanLiteral
src/components/RoundedButton/RoundedButton.stories.tsx:9:66
   title: 'RoundedButton',
   argTypes: {
     icon: { control: { type: 'text' }, defaultValue: '/assets/svg/menu/add-board.svg' },
-    isSpecialIcon: { control: { type: 'boolean' }, defaultValue: false },
+    isSpecialIcon: { control: { type: 'boolean' }, defaultValue: true },
     color: {
       control: {

[NoCoverage] ObjectLiteral
src/components/RoundedButton/RoundedButton.stories.tsx:11:16
     icon: { control: { type: 'text' }, defaultValue: '/assets/svg/menu/add-board.svg' },
     isSpecialIcon: { control: { type: 'boolean' }, defaultValue: false },
     color: {
-      control: {
-        type: 'select',
-        options: Object.values(EnumColors).filter((v) => typeof v === 'number'),
-      },
+      control: {},
     },
     text: { control: { type: 'text' }, defaultValue: 'Add board' },

[NoCoverage] EqualityOperator
src/components/RoundedButton/RoundedButton.stories.tsx:13:58
     color: {
       control: {
         type: 'select',
-        options: Object.values(EnumColors).filter((v) => typeof v === 'number'),
+        options: Object.values(EnumColors).filter((v) => typeof v !== 'number'),
       },
     },

[NoCoverage] ArrowFunction
src/components/RoundedButton/RoundedButton.stories.tsx:13:51
     color: {
       control: {
         type: 'select',
-        options: Object.values(EnumColors).filter((v) => typeof v === 'number'),
+        options: Object.values(EnumColors).filter(() => undefined),
       },
     },

[NoCoverage] ObjectLiteral
src/components/RoundedButton/RoundedButton.stories.tsx:16:22
         options: Object.values(EnumColors).filter((v) => typeof v === 'number'),
       },
     },
-    text: { control: { type: 'text' }, defaultValue: 'Add board' },
+    text: { control: {}, defaultValue: 'Add board' },
     isActive: { control: { type: 'boolean' }, defaultValue: false },
     onClick: { action: 'clicked' },

[NoCoverage] ObjectLiteral
src/components/RoundedButton/RoundedButton.stories.tsx:16:11
         options: Object.values(EnumColors).filter((v) => typeof v === 'number'),
       },
     },
-    text: { control: { type: 'text' }, defaultValue: 'Add board' },
+    text: {},
     isActive: { control: { type: 'boolean' }, defaultValue: false },
     onClick: { action: 'clicked' },

[NoCoverage] BooleanLiteral
src/components/RoundedButton/RoundedButton.stories.tsx:17:61
       },
     },
     text: { control: { type: 'text' }, defaultValue: 'Add board' },
-    isActive: { control: { type: 'boolean' }, defaultValue: false },
+    isActive: { control: { type: 'boolean' }, defaultValue: true },
     onClick: { action: 'clicked' },
     onDoubleClick: { action: 'double clicked' },

[NoCoverage] ObjectLiteral
src/components/RoundedButton/RoundedButton.stories.tsx:17:15
       },
     },
     text: { control: { type: 'text' }, defaultValue: 'Add board' },
-    isActive: { control: { type: 'boolean' }, defaultValue: false },
+    isActive: {},
     onClick: { action: 'clicked' },
     onDoubleClick: { action: 'double clicked' },

[NoCoverage] ObjectLiteral
src/components/RoundedButton/RoundedButton.stories.tsx:19:20
     text: { control: { type: 'text' }, defaultValue: 'Add board' },
     isActive: { control: { type: 'boolean' }, defaultValue: false },
     onClick: { action: 'clicked' },
-    onDoubleClick: { action: 'double clicked' },
+    onDoubleClick: {},
     onMouseOver: { action: 'mouse over' },
     onMouseOut: { action: 'mouse out' },

[NoCoverage] StringLiteral
src/components/RoundedButton/RoundedButton.stories.tsx:21:27
     onClick: { action: 'clicked' },
     onDoubleClick: { action: 'double clicked' },
     onMouseOver: { action: 'mouse over' },
-    onMouseOut: { action: 'mouse out' },
+    onMouseOut: { action: "" },
   },
 };

[NoCoverage] ArrowFunction
src/components/RoundedButton/RoundedButton.stories.tsx:25:24
   },
 };
 
-export const Default = (args: any) => <RoundedButton {...args} />;
+export const Default = () => undefined;
 
 export const Active = (args: any) => <RoundedButton {...args} isActive />;

[NoCoverage] ArrowFunction
src/components/RoundedButton/RoundedButton.stories.tsx:27:23
 
 export const Default = (args: any) => <RoundedButton {...args} />;
 
-export const Active = (args: any) => <RoundedButton {...args} isActive />;
+export const Active = () => undefined;
 
 export const Colored = (args: any) => <RoundedButton {...args} color={EnumColors.Green} />;

[NoCoverage] ArrowFunction
src/components/RoundedButton/RoundedButton.stories.tsx:29:24
 
 export const Active = (args: any) => <RoundedButton {...args} isActive />;
 
-export const Colored = (args: any) => <RoundedButton {...args} color={EnumColors.Green} />;
+export const Colored = () => undefined;
 
 export const AlwaysColoredIcon = (args: any) => <RoundedButton {...args} isSpecialIcon />;

[NoCoverage] ArrowFunction
src/components/RoundedButton/RoundedButton.stories.tsx:31:34
 
 export const Colored = (args: any) => <RoundedButton {...args} color={EnumColors.Green} />;
 
-export const AlwaysColoredIcon = (args: any) => <RoundedButton {...args} isSpecialIcon />;
+export const AlwaysColoredIcon = () => undefined;
 
