[NoCoverage] BlockStatement
src/components/Search/index.tsx:23:63
   const activeBoardId = useSelector(getActiveBoardId);
   const isSearchMode = useSelector(getIsSearchMode);
 
-  const debounceSearch = useDebounce((queryString: string) => {
-    dispatch(SearchActions.searchByTodoTitle({ query: queryString }));
-  }, 100);
+  const debounceSearch = useDebounce((queryString: string) => {}, 100);
 
   useEffect(() => {

[NoCoverage] BlockStatement
src/components/Search/index.tsx:27:19
     dispatch(SearchActions.searchByTodoTitle({ query: queryString }));
   }, 100);
 
-  useEffect(() => {
-    if (query) {
-      debounceSearch(query);
-    }
-  }, [query]);
+  useEffect(() => {}, [query]);
 
   useEffect(() => {

[NoCoverage] BlockStatement
src/components/Search/index.tsx:28:16
   }, 100);
 
   useEffect(() => {
-    if (query) {
-      debounceSearch(query);
-    }
+    if (query) {}
   }, [query]);
 

[NoCoverage] ConditionalExpression
src/components/Search/index.tsx:28:9
   }, 100);
 
   useEffect(() => {
-    if (query) {
+    if (true) {
       debounceSearch(query);
     }

[NoCoverage] ArrayDeclaration
src/components/Search/index.tsx:31:6
     if (query) {
       debounceSearch(query);
     }
-  }, [query]);
+  }, []);
 
   useEffect(() => {

[NoCoverage] BlockStatement
src/components/Search/index.tsx:33:19
     }
   }, [query]);
 
-  useEffect(() => {
-    if (!query && isSearchMode) {
-      dispatch(BoardsActions.effect.fetchAll());
-      dispatch(ColumnsActions.effect.fetchByBoardId({ boardId: activeBoardId! }));
-      dispatch(TodosActions.effect.fetchByBoardId({ boardId: activeBoardId! }));
-      dispatch(SystemActions.setIsSearchMode(false));
-    }
-  }, [query, isSearchMode]);
+  useEffect(() => {}, [query, isSearchMode]);
 
   const handleClear = () => {

[NoCoverage] LogicalOperator
src/components/Search/index.tsx:34:9
   }, [query]);
 
   useEffect(() => {
-    if (!query && isSearchMode) {
+    if (!query || isSearchMode) {
       dispatch(BoardsActions.effect.fetchAll());
       dispatch(ColumnsActions.effect.fetchByBoardId({ boardId: activeBoardId! }));

[NoCoverage] ConditionalExpression
src/components/Search/index.tsx:34:9
   }, [query]);
 
   useEffect(() => {
-    if (!query && isSearchMode) {
+    if (true) {
       dispatch(BoardsActions.effect.fetchAll());
       dispatch(ColumnsActions.effect.fetchByBoardId({ boardId: activeBoardId! }));

[NoCoverage] BooleanLiteral
src/components/Search/index.tsx:38:46
       dispatch(BoardsActions.effect.fetchAll());
       dispatch(ColumnsActions.effect.fetchByBoardId({ boardId: activeBoardId! }));
       dispatch(TodosActions.effect.fetchByBoardId({ boardId: activeBoardId! }));
-      dispatch(SystemActions.setIsSearchMode(false));
+      dispatch(SystemActions.setIsSearchMode(true));
     }
   }, [query, isSearchMode]);

[NoCoverage] BlockStatement
src/components/Search/index.tsx:42:29
     }
   }, [query, isSearchMode]);
 
-  const handleClear = () => {
-    setQuery('');
-  };
+  const handleClear = () => {};
 
   return (

[NoCoverage] StringLiteral
src/components/Search/index.tsx:43:14
   }, [query, isSearchMode]);
 
   const handleClear = () => {
-    setQuery('');
+    setQuery("Stryker was here!");
   };
 

[NoCoverage] ArrowFunction
src/components/Search/index.tsx:53:19
         placeholder={t('Search')}
         name="search"
         value={query}
-        onChange={(e: any) => setQuery(e.target.value)}
+        onChange={() => undefined}
         style={{ height: 33, paddingLeft: 33 }}
       >

[NoCoverage] ConditionalExpression
src/components/Search/index.tsx:60:19
         <ControlButton
           imageSrc="/assets/svg/close.svg"
           alt="clear"
-          isHide={query.length === 0}
+          isHide={true}
           imageSize={10}
           size={21}

[NoCoverage] EqualityOperator
src/components/Search/index.tsx:60:19
         <ControlButton
           imageSrc="/assets/svg/close.svg"
           alt="clear"
-          isHide={query.length === 0}
+          isHide={query.length !== 0}
           imageSize={10}
           size={21}
