[NoCoverage] BooleanLiteral
src/components/Submenu/index.tsx:15:49
   imageSrc,
   children,
 }) => {
-  const [isOpen, setIsOpen] = useState<boolean>(false);
+  const [isOpen, setIsOpen] = useState<boolean>(true);
   const sourceRef = useRef<any>(null);
 

[NoCoverage] BooleanLiteral
src/components/Submenu/index.tsx:21:37
   return (
     <span
       ref={sourceRef}
-      onMouseEnter={() => setIsOpen(true)}
+      onMouseEnter={() => setIsOpen(false)}
       onMouseLeave={() => setIsOpen(false)}
     >

[NoCoverage] ArrowFunction
src/components/Submenu/index.tsx:21:21
   return (
     <span
       ref={sourceRef}
-      onMouseEnter={() => setIsOpen(true)}
+      onMouseEnter={() => undefined}
       onMouseLeave={() => setIsOpen(false)}
     >

[NoCoverage] ArrowFunction
src/components/Submenu/index.tsx:22:21
     <span
       ref={sourceRef}
       onMouseEnter={() => setIsOpen(true)}
-      onMouseLeave={() => setIsOpen(false)}
+      onMouseLeave={() => undefined}
     >
       <Popup

[NoCoverage] BooleanLiteral
src/components/Submenu/index.tsx:22:37
     <span
       ref={sourceRef}
       onMouseEnter={() => setIsOpen(true)}
-      onMouseLeave={() => setIsOpen(false)}
+      onMouseLeave={() => setIsOpen(true)}
     >
       <Popup

[NoCoverage] UnaryOperator
src/components/Submenu/index.tsx:30:30
         sourceRef={sourceRef}
         position="right"
         isAbsolute={false}
-        style={{ marginLeft: -10, marginTop: -7 }}
+        style={{ marginLeft: +10, marginTop: -7 }}
       >
         {children}

[NoCoverage] UnaryOperator
src/components/Submenu/index.tsx:30:46
         sourceRef={sourceRef}
         position="right"
         isAbsolute={false}
-        style={{ marginLeft: -10, marginTop: -7 }}
+        style={{ marginLeft: -10, marginTop: +7 }}
       >
         {children}

[NoCoverage] BooleanLiteral
src/components/Submenu/index.tsx:37:22
       <MenuItem
         text={text}
         imageSrc={imageSrc}
-        isAutoClose={false}
+        isAutoClose={true}
         hintImageSrc="/assets/svg/menu/right-chevron.svg"
       />
