[NoCoverage] ArrowFunction
src/components/SuspenseWrapper/index.tsx:8:54
   fallback?: FC
 }
 
-export const SuspenseWrapper: FC<ISuspenseWrapper> = ({
-  component: Component,
-  fallback: Fallback = () => <></>,
-  ...rest
-}) => (
-  <Suspense fallback={<Fallback />}>
-    <Component {...rest} />
-  </Suspense>
-);
+export const SuspenseWrapper: FC<ISuspenseWrapper> = () => undefined;
 
 export const suspense = (Component: FC) => (props: any) => (

[NoCoverage] ArrowFunction
src/components/SuspenseWrapper/index.tsx:10:24
 
 export const SuspenseWrapper: FC<ISuspenseWrapper> = ({
   component: Component,
-  fallback: Fallback = () => <></>,
+  fallback: Fallback = () => undefined,
   ...rest
 }) => (

[NoCoverage] ArrowFunction
src/components/SuspenseWrapper/index.tsx:18:44
   </Suspense>
 );
 
-export const suspense = (Component: FC) => (props: any) => (
-  <SuspenseWrapper
-    {...props}
-    component={Component}
-  />
-);
+export const suspense = (Component: FC) => () => undefined;
 

[NoCoverage] ArrowFunction
src/components/SuspenseWrapper/index.tsx:18:25
   </Suspense>
 );
 
-export const suspense = (Component: FC) => (props: any) => (
-  <SuspenseWrapper
-    {...props}
-    component={Component}
-  />
-);
+export const suspense = () => undefined;
 
