[NoCoverage] StringLiteral
src/components/TextArea/index.tsx:26:11
 const TextAreaComponent = ({
   className,
   name,
-  value = '',
+  value = "Stryker was here!",
   placeholder,
   onChange,

[NoCoverage] ArrowFunction
src/components/TextArea/index.tsx:41:28
 }: ITextArea, ref: any) => {
   const internalRef = useRef<HTMLTextAreaElement | null>(null);
 
-  useImperativeHandle(ref, () => internalRef.current);
+  useImperativeHandle(ref, () => undefined);
 
   const [height, setHeight] = useState<number>(0);

[NoCoverage] BlockStatement
src/components/TextArea/index.tsx:45:47
 
   const [height, setHeight] = useState<number>(0);
 
-  const resize = (el: HTMLTextAreaElement) => {
-    el.style.height = '0px';
-    const { scrollHeight } = el;
-    setHeight(scrollHeight);
-    el.style.height = `${scrollHeight}px`;
-    if (height !== scrollHeight) {
-      onChangeHeight?.(height);
-    }
-  };
+  const resize = (el: HTMLTextAreaElement) => {};
 
   const setDefaultHeight = (el: HTMLTextAreaElement, min: number, max: number) => {

[NoCoverage] ConditionalExpression
src/components/TextArea/index.tsx:50:9
     const { scrollHeight } = el;
     setHeight(scrollHeight);
     el.style.height = `${scrollHeight}px`;
-    if (height !== scrollHeight) {
+    if (true) {
       onChangeHeight?.(height);
     }

[NoCoverage] ConditionalExpression
src/components/TextArea/index.tsx:50:9
     const { scrollHeight } = el;
     setHeight(scrollHeight);
     el.style.height = `${scrollHeight}px`;
-    if (height !== scrollHeight) {
+    if (false) {
       onChangeHeight?.(height);
     }

[NoCoverage] BlockStatement
src/components/TextArea/index.tsx:55:83
     }
   };
 
-  const setDefaultHeight = (el: HTMLTextAreaElement, min: number, max: number) => {
-    el.style.minHeight = `${min}px`;
-    el.style.height = `${min}px`;
-    el.style.maxHeight = `${max}px`;
-  };
+  const setDefaultHeight = (el: HTMLTextAreaElement, min: number, max: number) => {};
 
   useLayoutEffect(() => {

[NoCoverage] StringLiteral
src/components/TextArea/index.tsx:58:26
   const setDefaultHeight = (el: HTMLTextAreaElement, min: number, max: number) => {
     el.style.minHeight = `${min}px`;
     el.style.height = `${min}px`;
-    el.style.maxHeight = `${max}px`;
+    el.style.maxHeight = ``;
   };
 

[NoCoverage] BlockStatement
src/components/TextArea/index.tsx:61:25
     el.style.maxHeight = `${max}px`;
   };
 
-  useLayoutEffect(() => {
-    if (!internalRef.current) return;
-    const resizeObserver = new ResizeObserver(() => {
-      if (internalRef.current) {
-        resize(internalRef.current!);
-      }
-    });
-    resizeObserver.observe(internalRef.current!);
-    return () => {
-      resizeObserver.unobserve(internalRef.current!);
-    };
-  }, []);
+  useLayoutEffect(() => {}, []);
 
   useEffect(() => {

[NoCoverage] ConditionalExpression
src/components/TextArea/index.tsx:62:9
   };
 
   useLayoutEffect(() => {
-    if (!internalRef.current) return;
+    if (true) return;
     const resizeObserver = new ResizeObserver(() => {
       if (internalRef.current) {

[NoCoverage] BooleanLiteral
src/components/TextArea/index.tsx:62:9
   };
 
   useLayoutEffect(() => {
-    if (!internalRef.current) return;
+    if (internalRef.current) return;
     const resizeObserver = new ResizeObserver(() => {
       if (internalRef.current) {

[NoCoverage] BlockStatement
src/components/TextArea/index.tsx:63:53
 
   useLayoutEffect(() => {
     if (!internalRef.current) return;
-    const resizeObserver = new ResizeObserver(() => {
-      if (internalRef.current) {
-        resize(internalRef.current!);
-      }
-    });
+    const resizeObserver = new ResizeObserver(() => {});
     resizeObserver.observe(internalRef.current!);
     return () => {

[NoCoverage] ConditionalExpression
src/components/TextArea/index.tsx:64:11
   useLayoutEffect(() => {
     if (!internalRef.current) return;
     const resizeObserver = new ResizeObserver(() => {
-      if (internalRef.current) {
+      if (true) {
         resize(internalRef.current!);
       }

[NoCoverage] BlockStatement
src/components/TextArea/index.tsx:64:32
   useLayoutEffect(() => {
     if (!internalRef.current) return;
     const resizeObserver = new ResizeObserver(() => {
-      if (internalRef.current) {
-        resize(internalRef.current!);
-      }
+      if (internalRef.current) {}
     });
     resizeObserver.observe(internalRef.current!);

[NoCoverage] BlockStatement
src/components/TextArea/index.tsx:69:18
       }
     });
     resizeObserver.observe(internalRef.current!);
-    return () => {
-      resizeObserver.unobserve(internalRef.current!);
-    };
+    return () => {};
   }, []);
 

[NoCoverage] BlockStatement
src/components/TextArea/index.tsx:74:19
     };
   }, []);
 
-  useEffect(() => {
-    if (internalRef.current) {
-      const {
-        fontSize, lineHeight, paddingTop, paddingBottom,
-      } = window.getComputedStyle(internalRef.current!);
-
-      const fz = parseInt(fontSize, 10);
-      const pt = parseInt(paddingTop, 10);
-      const pb = parseInt(paddingBottom, 10);
-      const lh = lineHeight !== 'normal'
-        ? parseInt(lineHeight, 10)
-        : 1.3;
-
-      const rowHeight = fz * lh;
-      const min = minRows * rowHeight;
-      const max = maxRows * rowHeight + pt + pb;
-      setDefaultHeight(internalRef.current!, min, max);
-    }
-  }, [ref]);
+  useEffect(() => {}, [ref]);
 
   useEffect(() => {

[NoCoverage] BlockStatement
src/components/TextArea/index.tsx:75:30
   }, []);
 
   useEffect(() => {
-    if (internalRef.current) {
-      const {
-        fontSize, lineHeight, paddingTop, paddingBottom,
-      } = window.getComputedStyle(internalRef.current!);
-
-      const fz = parseInt(fontSize, 10);
-      const pt = parseInt(paddingTop, 10);
-      const pb = parseInt(paddingBottom, 10);
-      const lh = lineHeight !== 'normal'
-        ? parseInt(lineHeight, 10)
-        : 1.3;
-
-      const rowHeight = fz * lh;
-      const min = minRows * rowHeight;
-      const max = maxRows * rowHeight + pt + pb;
-      setDefaultHeight(internalRef.current!, min, max);
-    }
+    if (internalRef.current) {}
   }, [ref]);
 

[NoCoverage] ConditionalExpression
src/components/TextArea/index.tsx:75:9
   }, []);
 
   useEffect(() => {
-    if (internalRef.current) {
+    if (false) {
       const {
         fontSize, lineHeight, paddingTop, paddingBottom,

[NoCoverage] ConditionalExpression
src/components/TextArea/index.tsx:83:18
       const fz = parseInt(fontSize, 10);
       const pt = parseInt(paddingTop, 10);
       const pb = parseInt(paddingBottom, 10);
-      const lh = lineHeight !== 'normal'
+      const lh = false
         ? parseInt(lineHeight, 10)
         : 1.3;

[NoCoverage] EqualityOperator
src/components/TextArea/index.tsx:83:18
       const fz = parseInt(fontSize, 10);
       const pt = parseInt(paddingTop, 10);
       const pb = parseInt(paddingBottom, 10);
-      const lh = lineHeight !== 'normal'
+      const lh = lineHeight === 'normal'
         ? parseInt(lineHeight, 10)
         : 1.3;

[NoCoverage] ArithmeticOperator
src/components/TextArea/index.tsx:87:25
         ? parseInt(lineHeight, 10)
         : 1.3;
 
-      const rowHeight = fz * lh;
+      const rowHeight = fz / lh;
       const min = minRows * rowHeight;
       const max = maxRows * rowHeight + pt + pb;

[NoCoverage] ArithmeticOperator
src/components/TextArea/index.tsx:88:19
         : 1.3;
 
       const rowHeight = fz * lh;
-      const min = minRows * rowHeight;
+      const min = minRows / rowHeight;
       const max = maxRows * rowHeight + pt + pb;
       setDefaultHeight(internalRef.current!, min, max);

[NoCoverage] ArithmeticOperator
src/components/TextArea/index.tsx:89:19
 
       const rowHeight = fz * lh;
       const min = minRows * rowHeight;
-      const max = maxRows * rowHeight + pt + pb;
+      const max = maxRows / rowHeight + pt + pb;
       setDefaultHeight(internalRef.current!, min, max);
     }

[NoCoverage] ArithmeticOperator
src/components/TextArea/index.tsx:89:19
 
       const rowHeight = fz * lh;
       const min = minRows * rowHeight;
-      const max = maxRows * rowHeight + pt + pb;
+      const max = maxRows * rowHeight + pt - pb;
       setDefaultHeight(internalRef.current!, min, max);
     }

[NoCoverage] ArrayDeclaration
src/components/TextArea/index.tsx:92:6
       const max = maxRows * rowHeight + pt + pb;
       setDefaultHeight(internalRef.current!, min, max);
     }
-  }, [ref]);
+  }, []);
 
   useEffect(() => {

[NoCoverage] BlockStatement
src/components/TextArea/index.tsx:94:19
     }
   }, [ref]);
 
-  useEffect(() => {
-    if (internalRef.current) {
-      resize(internalRef.current!);
-    }
-  }, [value]);
+  useEffect(() => {}, [value]);
 
   // useEffect(() => {

[NoCoverage] BlockStatement
src/components/TextArea/index.tsx:95:30
   }, [ref]);
 
   useEffect(() => {
-    if (internalRef.current) {
-      resize(internalRef.current!);
-    }
+    if (internalRef.current) {}
   }, [value]);
 

[NoCoverage] ConditionalExpression
src/components/TextArea/index.tsx:95:9
   }, [ref]);
 
   useEffect(() => {
-    if (internalRef.current) {
+    if (true) {
       resize(internalRef.current!);
     }

[NoCoverage] ArrayDeclaration
src/components/TextArea/index.tsx:98:6
     if (internalRef.current) {
       resize(internalRef.current!);
     }
-  }, [value]);
+  }, []);
 
   // useEffect(() => {
