[NoCoverage] ObjectLiteral
helpers/validator/form/reset.ts:3:36
 import validator from '@helpers/validator';
 
-export const validatorResetForm = ({
-  email: validator.email({ max: 64 }),
-});
+export const validatorResetForm = ({});
 

[NoCoverage] ObjectLiteral
helpers/validator/form/reset.ts:4:26
 import validator from '@helpers/validator';
 
 export const validatorResetForm = ({
-  email: validator.email({ max: 64 }),
+  email: validator.email({}),
 });
 
