[NoCoverage] ArrowFunction
src/helpers/validator/index.ts:18:15
   readonly message?: string;
 }
 
-const email = (
-  { max = 64 }: IValidatorRules,
-) => (payload: IValidatorPayload): IValidatorResult => {
-  const isValid = is.email(payload);
-  let message = '';
-
-  const length = payload?.length ?? 0;
-
-  if (!isValid) {
-    message = i18n.t('Invalid email address');
-  }
-
-  if (length > max) {
-    message = i18n.t('Email is too long');
-  }
-
-  if (length === 0) {
-    message = i18n.t('Can\'t be blank');
-  }
-
-  return {
-    message,
-    isValid,
-  };
-};
+const email = () => undefined;
 
 const password = (

[NoCoverage] BlockStatement
src/helpers/validator/index.ts:20:56
 
 const email = (
   { max = 64 }: IValidatorRules,
-) => (payload: IValidatorPayload): IValidatorResult => {
-  const isValid = is.email(payload);
-  let message = '';
-
-  const length = payload?.length ?? 0;
-
-  if (!isValid) {
-    message = i18n.t('Invalid email address');
-  }
-
-  if (length > max) {
-    message = i18n.t('Email is too long');
-  }
-
-  if (length === 0) {
-    message = i18n.t('Can\'t be blank');
-  }
-
-  return {
-    message,
-    isValid,
-  };
-};
+) => (payload: IValidatorPayload): IValidatorResult => {};
 
 const password = (

[NoCoverage] StringLiteral
src/helpers/validator/index.ts:27:22
   const length = payload?.length ?? 0;
 
   if (!isValid) {
-    message = i18n.t('Invalid email address');
+    message = i18n.t("");
   }
 

[NoCoverage] EqualityOperator
src/helpers/validator/index.ts:30:7
     message = i18n.t('Invalid email address');
   }
 
-  if (length > max) {
+  if (length <= max) {
     message = i18n.t('Email is too long');
   }

[NoCoverage] BlockStatement
src/helpers/validator/index.ts:30:21
     message = i18n.t('Invalid email address');
   }
 
-  if (length > max) {
-    message = i18n.t('Email is too long');
-  }
+  if (length > max) {}
 
   if (length === 0) {

[NoCoverage] ConditionalExpression
src/helpers/validator/index.ts:34:7
     message = i18n.t('Email is too long');
   }
 
-  if (length === 0) {
+  if (false) {
     message = i18n.t('Can\'t be blank');
   }

[NoCoverage] BlockStatement
src/helpers/validator/index.ts:34:21
     message = i18n.t('Email is too long');
   }
 
-  if (length === 0) {
-    message = i18n.t('Can\'t be blank');
-  }
+  if (length === 0) {}
 
   return {

[NoCoverage] StringLiteral
src/helpers/validator/index.ts:35:22
   }
 
   if (length === 0) {
-    message = i18n.t('Can\'t be blank');
+    message = i18n.t("");
   }
 

[NoCoverage] ObjectLiteral
src/helpers/validator/index.ts:38:10
     message = i18n.t('Can\'t be blank');
   }
 
-  return {
-    message,
-    isValid,
-  };
+  return {};
 };
 

[NoCoverage] ArrowFunction
src/helpers/validator/index.ts:44:18
   };
 };
 
-const password = (
-  { min = 5, max = 36, name }: IValidatorRules,
-) => (payload: IValidatorPayload): IValidatorResult => {
-  let message = '';
-
-  const length = payload?.length ?? 0;
-
-  if (length < min) {
-    message = i18n.t('Password is short');
-  }
-
-  if (length > max) {
-    message = `${name || i18n.t('Entered value')} ${i18n.t('is too long')}`;
-  }
-
-  if (length === 0) {
-    message = i18n.t('Can\'t be blank');
-  }
-
-  return {
-    message,
-    isValid: !message,
-  };
-};
+const password = () => undefined;
 
 const text = (

[NoCoverage] BlockStatement
src/helpers/validator/index.ts:46:56
 
 const password = (
   { min = 5, max = 36, name }: IValidatorRules,
-) => (payload: IValidatorPayload): IValidatorResult => {
-  let message = '';
-
-  const length = payload?.length ?? 0;
-
-  if (length < min) {
-    message = i18n.t('Password is short');
-  }
-
-  if (length > max) {
-    message = `${name || i18n.t('Entered value')} ${i18n.t('is too long')}`;
-  }
-
-  if (length === 0) {
-    message = i18n.t('Can\'t be blank');
-  }
-
-  return {
-    message,
-    isValid: !message,
-  };
-};
+) => (payload: IValidatorPayload): IValidatorResult => {};
 
 const text = (

[NoCoverage] StringLiteral
src/helpers/validator/index.ts:47:17
 const password = (
   { min = 5, max = 36, name }: IValidatorRules,
 ) => (payload: IValidatorPayload): IValidatorResult => {
-  let message = '';
+  let message = "Stryker was here!";
 
   const length = payload?.length ?? 0;

[NoCoverage] BlockStatement
src/helpers/validator/index.ts:51:21
 
   const length = payload?.length ?? 0;
 
-  if (length < min) {
-    message = i18n.t('Password is short');
-  }
+  if (length < min) {}
 
   if (length > max) {

[NoCoverage] ConditionalExpression
src/helpers/validator/index.ts:51:7
 
   const length = payload?.length ?? 0;
 
-  if (length < min) {
+  if (true) {
     message = i18n.t('Password is short');
   }

[NoCoverage] EqualityOperator
src/helpers/validator/index.ts:55:7
     message = i18n.t('Password is short');
   }
 
-  if (length > max) {
+  if (length >= max) {
     message = `${name || i18n.t('Entered value')} ${i18n.t('is too long')}`;
   }

[NoCoverage] ConditionalExpression
src/helpers/validator/index.ts:56:18
   }
 
   if (length > max) {
-    message = `${name || i18n.t('Entered value')} ${i18n.t('is too long')}`;
+    message = `${false} ${i18n.t('is too long')}`;
   }
 

[NoCoverage] ConditionalExpression
src/helpers/validator/index.ts:56:18
   }
 
   if (length > max) {
-    message = `${name || i18n.t('Entered value')} ${i18n.t('is too long')}`;
+    message = `${true} ${i18n.t('is too long')}`;
   }
 

[NoCoverage] ConditionalExpression
src/helpers/validator/index.ts:59:7
     message = `${name || i18n.t('Entered value')} ${i18n.t('is too long')}`;
   }
 
-  if (length === 0) {
+  if (true) {
     message = i18n.t('Can\'t be blank');
   }

[NoCoverage] EqualityOperator
src/helpers/validator/index.ts:59:7
     message = `${name || i18n.t('Entered value')} ${i18n.t('is too long')}`;
   }
 
-  if (length === 0) {
+  if (length !== 0) {
     message = i18n.t('Can\'t be blank');
   }

[NoCoverage] BooleanLiteral
src/helpers/validator/index.ts:65:14
 
   return {
     message,
-    isValid: !message,
+    isValid: message,
   };
 };

[NoCoverage] BlockStatement
src/helpers/validator/index.ts:74:34
 ) => (payload: IValidatorPayload) : IValidatorResult => {
   const length = payload?.length ?? 0;
 
-  if (min === 0 && length === 0) {
-    return {
-      isValid: true,
-    };
-  }
+  if (min === 0 && length === 0) {}
 
   let message = '';

[NoCoverage] LogicalOperator
src/helpers/validator/index.ts:74:7
 ) => (payload: IValidatorPayload) : IValidatorResult => {
   const length = payload?.length ?? 0;
 
-  if (min === 0 && length === 0) {
+  if (min === 0 || length === 0) {
     return {
       isValid: true,

[NoCoverage] ObjectLiteral
src/helpers/validator/index.ts:75:12
   const length = payload?.length ?? 0;
 
   if (min === 0 && length === 0) {
-    return {
-      isValid: true,
-    };
+    return {};
   }
 

[NoCoverage] ConditionalExpression
src/helpers/validator/index.ts:82:7
 
   let message = '';
 
-  if (length < min) {
+  if (false) {
     message = `${name || i18n.t('Entered value')} ${i18n.t('is short')}`;
   }

[NoCoverage] EqualityOperator
src/helpers/validator/index.ts:82:7
 
   let message = '';
 
-  if (length < min) {
+  if (length >= min) {
     message = `${name || i18n.t('Entered value')} ${i18n.t('is short')}`;
   }

[NoCoverage] ConditionalExpression
src/helpers/validator/index.ts:83:18
   let message = '';
 
   if (length < min) {
-    message = `${name || i18n.t('Entered value')} ${i18n.t('is short')}`;
+    message = `${true} ${i18n.t('is short')}`;
   }
 

[NoCoverage] ConditionalExpression
src/helpers/validator/index.ts:83:18
   let message = '';
 
   if (length < min) {
-    message = `${name || i18n.t('Entered value')} ${i18n.t('is short')}`;
+    message = `${false} ${i18n.t('is short')}`;
   }
 

[NoCoverage] ConditionalExpression
src/helpers/validator/index.ts:86:7
     message = `${name || i18n.t('Entered value')} ${i18n.t('is short')}`;
   }
 
-  if (length > max) {
+  if (false) {
     message = `${name || i18n.t('Entered value')} ${i18n.t('is too long')}`;
   }

[NoCoverage] LogicalOperator
src/helpers/validator/index.ts:87:18
   }
 
   if (length > max) {
-    message = `${name || i18n.t('Entered value')} ${i18n.t('is too long')}`;
+    message = `${name && i18n.t('Entered value')} ${i18n.t('is too long')}`;
   }
 

[NoCoverage] ObjectLiteral
src/helpers/validator/index.ts:94:10
     message = i18n.t('Can\'t be blank');
   }
 
-  return {
-    message,
-    isValid: !message,
-  };
+  return {};
 };
 

[NoCoverage] ObjectLiteral
src/helpers/validator/index.ts:100:16
   };
 };
 
-export default {
-  email,
-  password,
-  text,
-};
+export default {};
 
