[NoCoverage] BlockStatement
React/verticals/src/index.tsx:20:19
   document.getElementById('root'),
 );
 
-setInterval(() => {
-  // console.log('rebuild');
-  ReactTooltip.rebuild(); // TODO: move to data-tip update hook useEffect(() => {})
-}, 2000);
+setInterval(() => {}, 2000);
 
