[NoCoverage] StringLiteral
verticals/src/inversify/types.ts:5:27
   HttpClient: Symbol.for('HttpClient'),
   WSClient: Symbol.for('WSClient'),
   Services: Symbol.for('Services'),
-  AuthService: Symbol.for('AuthService'),
+  AuthService: Symbol.for(""),
   UserService: Symbol.for('UserService'),
   BoardService: Symbol.for('BoardService'),

[NoCoverage] StringLiteral
verticals/src/inversify/types.ts:8:29
   AuthService: Symbol.for('AuthService'),
   UserService: Symbol.for('UserService'),
   BoardService: Symbol.for('BoardService'),
-  ColumnService: Symbol.for('ColumnService'),
+  ColumnService: Symbol.for(""),
   TodoService: Symbol.for('TodoService'),
   CommentService: Symbol.for('CommentService'),

[NoCoverage] StringLiteral
verticals/src/inversify/types.ts:10:30
   BoardService: Symbol.for('BoardService'),
   ColumnService: Symbol.for('ColumnService'),
   TodoService: Symbol.for('TodoService'),
-  CommentService: Symbol.for('CommentService'),
+  CommentService: Symbol.for(""),
   CommentAttachmentService: Symbol.for('CommentAttachmentService'),
   SearchService: Symbol.for('SearchService'),

[NoCoverage] StringLiteral
verticals/src/inversify/types.ts:11:40
   ColumnService: Symbol.for('ColumnService'),
   TodoService: Symbol.for('TodoService'),
   CommentService: Symbol.for('CommentService'),
-  CommentAttachmentService: Symbol.for('CommentAttachmentService'),
+  CommentAttachmentService: Symbol.for(""),
   SearchService: Symbol.for('SearchService'),
   UpdateService: Symbol.for('UpdateService'),

[NoCoverage] StringLiteral
verticals/src/inversify/types.ts:13:29
   CommentService: Symbol.for('CommentService'),
   CommentAttachmentService: Symbol.for('CommentAttachmentService'),
   SearchService: Symbol.for('SearchService'),
-  UpdateService: Symbol.for('UpdateService'),
+  UpdateService: Symbol.for(""),
 };
 
