[NoCoverage] ArrayDeclaration
src/layouts/Settings/index.tsx:17:21
 export const SettingsLayout: FC = ({ children }) => {
   const { t } = useTranslation();
 
-  const menuItems = [{
-    icon: '/assets/svg/account.svg',
-    text: t('Account'),
-    type: EnumMenu.Account,
-  }, {
-    icon: '/assets/svg/profile.svg',
-    text: t('Profile'),
-    type: EnumMenu.Profile,
-  }];
+  const menuItems = [];
 
   const drawMenu = useMemo(() => menuItems.map((menuItem) => (

[NoCoverage] ObjectLiteral
src/layouts/Settings/index.tsx:17:22
 export const SettingsLayout: FC = ({ children }) => {
   const { t } = useTranslation();
 
-  const menuItems = [{
-    icon: '/assets/svg/account.svg',
-    text: t('Account'),
-    type: EnumMenu.Account,
-  }, {
+  const menuItems = [{}, {
     icon: '/assets/svg/profile.svg',
     text: t('Profile'),

[NoCoverage] StringLiteral
src/layouts/Settings/index.tsx:22:11
     text: t('Account'),
     type: EnumMenu.Account,
   }, {
-    icon: '/assets/svg/profile.svg',
+    icon: "",
     text: t('Profile'),
     type: EnumMenu.Profile,

[NoCoverage] ArrowFunction
src/layouts/Settings/index.tsx:27:28
     type: EnumMenu.Profile,
   }];
 
-  const drawMenu = useMemo(() => menuItems.map((menuItem) => (
-    <NavLink
-      key={menuItem.type}
-      to={`/settings/${menuItem.type}`}
-      exact
-    >
-      {(isActive: boolean) => (
-        <RoundedButton
-          key={menuItem.type}
-          icon={menuItem.icon}
-          text={menuItem.text}
-          isActive={isActive}
-        />
-      )}
-    </NavLink>
-  )), []);
+  const drawMenu = useMemo(() => undefined, []);
 
   return (

[NoCoverage] ArrowFunction
src/layouts/Settings/index.tsx:27:48
     type: EnumMenu.Profile,
   }];
 
-  const drawMenu = useMemo(() => menuItems.map((menuItem) => (
-    <NavLink
-      key={menuItem.type}
-      to={`/settings/${menuItem.type}`}
-      exact
-    >
-      {(isActive: boolean) => (
-        <RoundedButton
-          key={menuItem.type}
-          icon={menuItem.icon}
-          text={menuItem.text}
-          isActive={isActive}
-        />
-      )}
-    </NavLink>
-  )), []);
+  const drawMenu = useMemo(() => menuItems.map(() => undefined), []);
 
   return (

[NoCoverage] ArrowFunction
src/layouts/Settings/index.tsx:33:8
       to={`/settings/${menuItem.type}`}
       exact
     >
-      {(isActive: boolean) => (
-        <RoundedButton
-          key={menuItem.type}
-          icon={menuItem.icon}
-          text={menuItem.text}
-          isActive={isActive}
-        />
-      )}
+      {() => undefined}
     </NavLink>
   )), []);

[NoCoverage] ArrayDeclaration
src/layouts/Settings/index.tsx:42:7
         />
       )}
     </NavLink>
-  )), []);
+  )), ["Stryker was here"]);
 
   return (
