[NoCoverage] BlockStatement
verticals/src/layouts/main.tsx:61:40
     // dispatch(SystemActions.setEditableBoardId(false));
   };
 
-  const closePopupsAndEditable = () => {
-    closePopups();
-    dispatch(BoardsActions.removeTemp());
-    dispatch(ColumnsActions.removeTemp());
-    dispatch(TodosActions.removeTemp());
-    const isCardOpened = !!refActiveTodoId.current;
-    if (isCardOpened) {
-      redirectTo(`/${refUsername.current}/${refBoardId.current}`);
-    }
-  };
+  const closePopupsAndEditable = () => {};
 
   // const handleClick = (event: any) => {

[NoCoverage] BooleanLiteral
verticals/src/layouts/main.tsx:66:27
     dispatch(BoardsActions.removeTemp());
     dispatch(ColumnsActions.removeTemp());
     dispatch(TodosActions.removeTemp());
-    const isCardOpened = !!refActiveTodoId.current;
+    const isCardOpened = !refActiveTodoId.current;
     if (isCardOpened) {
       redirectTo(`/${refUsername.current}/${refBoardId.current}`);

[NoCoverage] ConditionalExpression
verticals/src/layouts/main.tsx:67:9
     dispatch(ColumnsActions.removeTemp());
     dispatch(TodosActions.removeTemp());
     const isCardOpened = !!refActiveTodoId.current;
-    if (isCardOpened) {
+    if (true) {
       redirectTo(`/${refUsername.current}/${refBoardId.current}`);
     }

[NoCoverage] ConditionalExpression
verticals/src/layouts/main.tsx:67:9
     dispatch(ColumnsActions.removeTemp());
     dispatch(TodosActions.removeTemp());
     const isCardOpened = !!refActiveTodoId.current;
-    if (isCardOpened) {
+    if (false) {
       redirectTo(`/${refUsername.current}/${refBoardId.current}`);
     }

[NoCoverage] StringLiteral
verticals/src/layouts/main.tsx:68:18
     dispatch(TodosActions.removeTemp());
     const isCardOpened = !!refActiveTodoId.current;
     if (isCardOpened) {
-      redirectTo(`/${refUsername.current}/${refBoardId.current}`);
+      redirectTo(``);
     }
   };

[NoCoverage] BlockStatement
verticals/src/layouts/main.tsx:78:19
 
   useKeys(['Escape'], closePopupsAndEditable); // TODO: uncomment
 
-  useEffect(() => {
-    if (boardId) {
-      const numericBoardId = boardId === 'trash'
-        ? TRASH_BOARD_ID
-        : boardId !== undefined
-          && !['account', 'profile'].includes(boardId)
-          ? toNumericId(boardId)
-          : null;
-      console.log('numericBoardId', numericBoardId);
-      dispatch(SystemActions.setActiveBoardId(numericBoardId));
-      dispatch(SystemActions.setActiveBoardReadableId(boardId));
-    }
-  }, [boardId]);
+  useEffect(() => {}, [boardId]);
 
   useEffect(() => {

[NoCoverage] ConditionalExpression
verticals/src/layouts/main.tsx:79:9
   useKeys(['Escape'], closePopupsAndEditable); // TODO: uncomment
 
   useEffect(() => {
-    if (boardId) {
+    if (true) {
       const numericBoardId = boardId === 'trash'
         ? TRASH_BOARD_ID

[NoCoverage] ConditionalExpression
verticals/src/layouts/main.tsx:79:9
   useKeys(['Escape'], closePopupsAndEditable); // TODO: uncomment
 
   useEffect(() => {
-    if (boardId) {
+    if (false) {
       const numericBoardId = boardId === 'trash'
         ? TRASH_BOARD_ID

[NoCoverage] ConditionalExpression
verticals/src/layouts/main.tsx:80:30
 
   useEffect(() => {
     if (boardId) {
-      const numericBoardId = boardId === 'trash'
+      const numericBoardId = false
         ? TRASH_BOARD_ID
         : boardId !== undefined

[NoCoverage] EqualityOperator
verticals/src/layouts/main.tsx:80:30
 
   useEffect(() => {
     if (boardId) {
-      const numericBoardId = boardId === 'trash'
+      const numericBoardId = boardId !== 'trash'
         ? TRASH_BOARD_ID
         : boardId !== undefined

[NoCoverage] EqualityOperator
verticals/src/layouts/main.tsx:82:11
     if (boardId) {
       const numericBoardId = boardId === 'trash'
         ? TRASH_BOARD_ID
-        : boardId !== undefined
+        : boardId === undefined
           && !['account', 'profile'].includes(boardId)
           ? toNumericId(boardId)

[NoCoverage] LogicalOperator
verticals/src/layouts/main.tsx:82:11
     if (boardId) {
       const numericBoardId = boardId === 'trash'
         ? TRASH_BOARD_ID
-        : boardId !== undefined
-          && !['account', 'profile'].includes(boardId)
+        : boardId !== undefined || !['account', 'profile'].includes(boardId)
           ? toNumericId(boardId)
           : null;

[NoCoverage] BooleanLiteral
verticals/src/layouts/main.tsx:83:14
       const numericBoardId = boardId === 'trash'
         ? TRASH_BOARD_ID
         : boardId !== undefined
-          && !['account', 'profile'].includes(boardId)
+          && ['account', 'profile'].includes(boardId)
           ? toNumericId(boardId)
           : null;

[NoCoverage] StringLiteral
verticals/src/layouts/main.tsx:83:16
       const numericBoardId = boardId === 'trash'
         ? TRASH_BOARD_ID
         : boardId !== undefined
-          && !['account', 'profile'].includes(boardId)
+          && !["", 'profile'].includes(boardId)
           ? toNumericId(boardId)
           : null;

[NoCoverage] StringLiteral
verticals/src/layouts/main.tsx:86:19
           && !['account', 'profile'].includes(boardId)
           ? toNumericId(boardId)
           : null;
-      console.log('numericBoardId', numericBoardId);
+      console.log("", numericBoardId);
       dispatch(SystemActions.setActiveBoardId(numericBoardId));
       dispatch(SystemActions.setActiveBoardReadableId(boardId));

[NoCoverage] BlockStatement
verticals/src/layouts/main.tsx:92:19
     }
   }, [boardId]);
 
-  useEffect(() => {
-    let numericTodoId = null;
-    if (todoId) {
-      numericTodoId = toNumericId(todoId);
-      dispatch(SystemActions.setActiveTodoReadableId(todoId)); // delete?
-    }
-    dispatch(SystemActions.setActiveTodoId(numericTodoId));
-  }, [todoId]);
+  useEffect(() => {}, [todoId]);
 
   useEffect(() => {

[NoCoverage] BlockStatement
verticals/src/layouts/main.tsx:94:17
 
   useEffect(() => {
     let numericTodoId = null;
-    if (todoId) {
-      numericTodoId = toNumericId(todoId);
-      dispatch(SystemActions.setActiveTodoReadableId(todoId)); // delete?
-    }
+    if (todoId) {}
     dispatch(SystemActions.setActiveTodoId(numericTodoId));
   }, [todoId]);

[NoCoverage] ConditionalExpression
verticals/src/layouts/main.tsx:94:9
 
   useEffect(() => {
     let numericTodoId = null;
-    if (todoId) {
+    if (false) {
       numericTodoId = toNumericId(todoId);
       dispatch(SystemActions.setActiveTodoReadableId(todoId)); // delete?

[NoCoverage] BlockStatement
verticals/src/layouts/main.tsx:101:19
     dispatch(SystemActions.setActiveTodoId(numericTodoId));
   }, [todoId]);
 
-  useEffect(() => {
-    dispatch(UserActions.fetchMe());
-    dispatch(BoardsActions.effect.fetchAll());
-  }, []);
+  useEffect(() => {}, []);
 
   const memoSidebar = useMemo(() => (

[NoCoverage] ArrowFunction
verticals/src/layouts/main.tsx:106:31
     dispatch(BoardsActions.effect.fetchAll());
   }, []);
 
-  const memoSidebar = useMemo(() => (
-    <Sidebar>
-      <Search />
-      <BoardList />
-    </Sidebar>
-  ), [activeBoardId]);
+  const memoSidebar = useMemo(() => undefined, [activeBoardId]);
 
   const memoRouter = useMemo(() => (

[NoCoverage] ArrowFunction
verticals/src/layouts/main.tsx:113:30
     </Sidebar>
   ), [activeBoardId]);
 
-  const memoRouter = useMemo(() => (
-    <Switch>
-      <RouteWrapper
-        path="/settings/account"
-        layout={SettingsLayout}
-        component={() => <SuspenseWrapper component={Account} />}
-        isPrivate
-        exact
-      />
-      <RouteWrapper
-        path="/settings/profile"
-        layout={SettingsLayout}
-        component={() => <SuspenseWrapper component={Profile} />}
-        isPrivate
-        exact
-      />
-      <Route
-        path="/"
-        component={() => <Columns />}
-      />
-    </Switch>
-  ), []);
+  const memoRouter = useMemo(() => undefined, []);
 
   return (

[NoCoverage] ArrowFunction
verticals/src/layouts/main.tsx:118:20
       <RouteWrapper
         path="/settings/account"
         layout={SettingsLayout}
-        component={() => <SuspenseWrapper component={Account} />}
+        component={() => undefined}
         isPrivate
         exact

[NoCoverage] ArrowFunction
verticals/src/layouts/main.tsx:125:20
       <RouteWrapper
         path="/settings/profile"
         layout={SettingsLayout}
-        component={() => <SuspenseWrapper component={Profile} />}
+        component={() => undefined}
         isPrivate
         exact

[NoCoverage] ArrowFunction
verticals/src/layouts/main.tsx:131:20
       />
       <Route
         path="/"
-        component={() => <Columns />}
+        component={() => undefined}
       />
     </Switch>
