[NoCoverage] BooleanLiteral
pages/settings/Account/index.tsx:32:59
   const dispatch = useDispatch();
   const email = useSelector(getEmail);
 
-  const [isOpenModal, setIsOpenModal] = useState<boolean>(false);
+  const [isOpenModal, setIsOpenModal] = useState<boolean>(true);
 
   const handleClick = () => {

[NoCoverage] BlockStatement
pages/settings/Account/index.tsx:34:29
 
   const [isOpenModal, setIsOpenModal] = useState<boolean>(false);
 
-  const handleClick = () => {
-    setIsOpenModal(true);
-  };
+  const handleClick = () => {};
 
   const handlePositive = () => { };

[NoCoverage] BooleanLiteral
pages/settings/Account/index.tsx:35:20
   const [isOpenModal, setIsOpenModal] = useState<boolean>(false);
 
   const handleClick = () => {
-    setIsOpenModal(true);
+    setIsOpenModal(false);
   };
 

[NoCoverage] BlockStatement
pages/settings/Account/index.tsx:40:32
 
   const handlePositive = () => { };
 
-  const handleNegative = () => {
-    setIsOpenModal(false);
-  };
+  const handleNegative = () => {};
 
   const handleClose = () => {

[NoCoverage] BooleanLiteral
pages/settings/Account/index.tsx:41:20
   const handlePositive = () => { };
 
   const handleNegative = () => {
-    setIsOpenModal(false);
+    setIsOpenModal(true);
   };
 

[NoCoverage] BlockStatement
pages/settings/Account/index.tsx:44:29
     setIsOpenModal(false);
   };
 
-  const handleClose = () => {
-    setIsOpenModal(false);
-  };
+  const handleClose = () => {};
 
   const {

[NoCoverage] BooleanLiteral
pages/settings/Account/index.tsx:45:20
   };
 
   const handleClose = () => {
-    setIsOpenModal(false);
+    setIsOpenModal(true);
   };
 

[NoCoverage] StringLiteral
pages/settings/Account/index.tsx:89:21
       </div>
       <Modal
         isOpen={isOpenModal}
-        negative={t('Cancel')}
+        negative={t("")}
         positive={t('Change Password')}
         onPositive={handlePositive}

[NoCoverage] ArrowFunction
pages/settings/Account/index.tsx:95:24
         onNegative={handleNegative}
         onClose={handleClose}
         type="submit"
-        renderWrapper={(children) => (
-          <Form handleSubmit={handleSubmit}>
-            {children}
-          </Form>
-        )}
+        renderWrapper={() => undefined}
       >
         <h1 className="dialog__title">
