[NoCoverage] BlockStatement
pages/settings/Profile/index.tsx:51:35
     validatorProfileForm,
   );
 
-  const handleClick = async () => {
-    const [file] = await openFiles('image/x-png,image/jpeg', false) || [];
-    dispatch(UserActions.uploadAvatar(file));
-  };
+  const handleClick = async () => {};
 
   const handleDelete = (event: React.SyntheticEvent) => {

[NoCoverage] BooleanLiteral
pages/settings/Profile/index.tsx:52:62
   );
 
   const handleClick = async () => {
-    const [file] = await openFiles('image/x-png,image/jpeg', false) || [];
+    const [file] = await openFiles('image/x-png,image/jpeg', true) || [];
     dispatch(UserActions.uploadAvatar(file));
   };

[NoCoverage] LogicalOperator
pages/settings/Profile/index.tsx:52:20
   );
 
   const handleClick = async () => {
-    const [file] = await openFiles('image/x-png,image/jpeg', false) || [];
+    const [file] = (await openFiles('image/x-png,image/jpeg', false)) && [];
     dispatch(UserActions.uploadAvatar(file));
   };

[NoCoverage] BlockStatement
pages/settings/Profile/index.tsx:56:57
     dispatch(UserActions.uploadAvatar(file));
   };
 
-  const handleDelete = (event: React.SyntheticEvent) => {
-    event.preventDefault();
-    dispatch(UserActions.removeAvatar());
-  };
+  const handleDelete = (event: React.SyntheticEvent) => {};
 
   return (

[NoCoverage] StringLiteral
pages/settings/Profile/index.tsx:82:22
                     src="/assets/svg/upload.svg"
                     alt="upload"
                   />
-                  {t('Click to update')}
+                  {t("")}
                 </div>
                 <button

[NoCoverage] StringLiteral
pages/settings/Profile/index.tsx:103:57
             isLight
             initialValue={username}
             action={UserActions.updateUsername}
-            validator={validator.text({ min: 2, name: t('Username') })}
+            validator={validator.text({ min: 2, name: t("") })}
           />
           <Input

[NoCoverage] StringLiteral
pages/settings/Profile/index.tsx:107:22
           />
           <Input
             type="text"
-            label={t('First name')}
+            label={t("")}
             touched={touches.name}
             error={errors.name}

[NoCoverage] StringLiteral
pages/settings/Profile/index.tsx:118:22
           />
           <Input
             type="text"
-            label={t('Last name')}
+            label={t("")}
             touched={touches.surname}
             error={errors.surname}
