[NoCoverage] ArrowFunction
verticals/src/router/index.tsx:12:63
 import { NotFound } from '@pages/404';
 import { AuthLayout } from '@layouts/auth';
 
-export const MainLayout = lazy(() => import('@layouts/main'), (module) => module.MainLayout);
+export const MainLayout = lazy(() => import('@layouts/main'), () => undefined);
 export const Register = lazy(() => import('@pages/auth/Register'), (module) => module.Register);
 export const Login = lazy(() => import('@pages/auth/Login'), (module) => module.Login);

[NoCoverage] ArrowFunction
verticals/src/router/index.tsx:12:32
 import { NotFound } from '@pages/404';
 import { AuthLayout } from '@layouts/auth';
 
-export const MainLayout = lazy(() => import('@layouts/main'), (module) => module.MainLayout);
+export const MainLayout = lazy(() => undefined, (module) => module.MainLayout);
 export const Register = lazy(() => import('@pages/auth/Register'), (module) => module.Register);
 export const Login = lazy(() => import('@pages/auth/Login'), (module) => module.Login);

[NoCoverage] ArrowFunction
verticals/src/router/index.tsx:13:30
 import { AuthLayout } from '@layouts/auth';
 
 export const MainLayout = lazy(() => import('@layouts/main'), (module) => module.MainLayout);
-export const Register = lazy(() => import('@pages/auth/Register'), (module) => module.Register);
+export const Register = lazy(() => undefined, (module) => module.Register);
 export const Login = lazy(() => import('@pages/auth/Login'), (module) => module.Login);
 export const Reset = lazy(() => import('@pages/auth/Reset'), (module) => module.Reset);

[NoCoverage] ArrowFunction
verticals/src/router/index.tsx:13:68
 import { AuthLayout } from '@layouts/auth';
 
 export const MainLayout = lazy(() => import('@layouts/main'), (module) => module.MainLayout);
-export const Register = lazy(() => import('@pages/auth/Register'), (module) => module.Register);
+export const Register = lazy(() => import('@pages/auth/Register'), () => undefined);
 export const Login = lazy(() => import('@pages/auth/Login'), (module) => module.Login);
 export const Reset = lazy(() => import('@pages/auth/Reset'), (module) => module.Reset);

[NoCoverage] ArrowFunction
verticals/src/router/index.tsx:14:27
 
 export const MainLayout = lazy(() => import('@layouts/main'), (module) => module.MainLayout);
 export const Register = lazy(() => import('@pages/auth/Register'), (module) => module.Register);
-export const Login = lazy(() => import('@pages/auth/Login'), (module) => module.Login);
+export const Login = lazy(() => undefined, (module) => module.Login);
 export const Reset = lazy(() => import('@pages/auth/Reset'), (module) => module.Reset);
 

[NoCoverage] ArrowFunction
verticals/src/router/index.tsx:14:62
 
 export const MainLayout = lazy(() => import('@layouts/main'), (module) => module.MainLayout);
 export const Register = lazy(() => import('@pages/auth/Register'), (module) => module.Register);
-export const Login = lazy(() => import('@pages/auth/Login'), (module) => module.Login);
+export const Login = lazy(() => import('@pages/auth/Login'), () => undefined);
 export const Reset = lazy(() => import('@pages/auth/Reset'), (module) => module.Reset);
 

[NoCoverage] ArrowFunction
verticals/src/router/index.tsx:15:62
 export const MainLayout = lazy(() => import('@layouts/main'), (module) => module.MainLayout);
 export const Register = lazy(() => import('@pages/auth/Register'), (module) => module.Register);
 export const Login = lazy(() => import('@pages/auth/Login'), (module) => module.Login);
-export const Reset = lazy(() => import('@pages/auth/Reset'), (module) => module.Reset);
+export const Reset = lazy(() => import('@pages/auth/Reset'), () => undefined);
 
 export const MainRouter: FC = () => (

[NoCoverage] ArrowFunction
verticals/src/router/index.tsx:15:27
 export const MainLayout = lazy(() => import('@layouts/main'), (module) => module.MainLayout);
 export const Register = lazy(() => import('@pages/auth/Register'), (module) => module.Register);
 export const Login = lazy(() => import('@pages/auth/Login'), (module) => module.Login);
-export const Reset = lazy(() => import('@pages/auth/Reset'), (module) => module.Reset);
+export const Reset = lazy(() => undefined, (module) => module.Reset);
 
 export const MainRouter: FC = () => (
