[NoCoverage] ArrowFunction
verticals/src/router/lazy.ts:3:20
 import React, { FC } from 'react';
 
-const getDefault = (module: any) => (module?.default);
+const getDefault = () => undefined;
 
 type ILazy = (

[NoCoverage] ArrowFunction
verticals/src/router/lazy.ts:11:28
   delay?: number
 ) => FC;
 
-export const lazy: ILazy = (importFunc, resolveComponent = getDefault, delay = 0) => React.lazy(
-  () => importFunc()
-    .then((module: any) => new Promise((resolve) => setTimeout(() => resolve(module), delay)))
-    .then(
-      (module:any) => ({
-        default: resolveComponent(module),
-      }),
-    ),
-);
+export const lazy: ILazy = () => undefined;
 

[NoCoverage] ArrowFunction
verticals/src/router/lazy.ts:12:3
 ) => FC;
 
 export const lazy: ILazy = (importFunc, resolveComponent = getDefault, delay = 0) => React.lazy(
-  () => importFunc()
-    .then((module: any) => new Promise((resolve) => setTimeout(() => resolve(module), delay)))
-    .then(
-      (module:any) => ({
-        default: resolveComponent(module),
-      }),
-    ),
+  () => undefined,
 );
 

[NoCoverage] ArrowFunction
verticals/src/router/lazy.ts:13:64
 
 export const lazy: ILazy = (importFunc, resolveComponent = getDefault, delay = 0) => React.lazy(
   () => importFunc()
-    .then((module: any) => new Promise((resolve) => setTimeout(() => resolve(module), delay)))
+    .then((module: any) => new Promise((resolve) => setTimeout(() => undefined, delay)))
     .then(
       (module:any) => ({

[NoCoverage] ArrowFunction
verticals/src/router/lazy.ts:13:11
 
 export const lazy: ILazy = (importFunc, resolveComponent = getDefault, delay = 0) => React.lazy(
   () => importFunc()
-    .then((module: any) => new Promise((resolve) => setTimeout(() => resolve(module), delay)))
+    .then(() => undefined)
     .then(
       (module:any) => ({

[NoCoverage] ArrowFunction
verticals/src/router/lazy.ts:15:7
   () => importFunc()
     .then((module: any) => new Promise((resolve) => setTimeout(() => resolve(module), delay)))
     .then(
-      (module:any) => ({
-        default: resolveComponent(module),
-      }),
+      () => undefined,
     ),
 );

[NoCoverage] ObjectLiteral
verticals/src/router/lazy.ts:15:24
   () => importFunc()
     .then((module: any) => new Promise((resolve) => setTimeout(() => resolve(module), delay)))
     .then(
-      (module:any) => ({
-        default: resolveComponent(module),
-      }),
+      (module:any) => ({}),
     ),
 );
