[NoCoverage] BlockStatement
verticals/src/services/column.ts:27:12
     this.httpClient = httpClient;
   }
 
-  getAll() {
-    return this.httpClient.get<IGetAllColumnsResponse>('/column');
-  }
+  getAll() {}
 
   getByBoardId(body: IGetColumnsByBoardIdRequest) {

[NoCoverage] BlockStatement
verticals/src/services/column.ts:31:51
     return this.httpClient.get<IGetAllColumnsResponse>('/column');
   }
 
-  getByBoardId(body: IGetColumnsByBoardIdRequest) {
-    return this.httpClient.get<IGetColumnsByBoardIdResponse>('/column', {
-      params: body,
-    });
-  }
+  getByBoardId(body: IGetColumnsByBoardIdRequest) {}
 
   create(body: ICreateColumnRequest) {

[NoCoverage] BlockStatement
verticals/src/services/column.ts:37:38
     });
   }
 
-  create(body: ICreateColumnRequest) {
-    return this.httpClient.post<ICreateColumnResponse>('/column', body);
-  }
+  create(body: ICreateColumnRequest) {}
 
   remove(body: IRemoveColumnRequest) {

[NoCoverage] BlockStatement
verticals/src/services/column.ts:41:38
     return this.httpClient.post<ICreateColumnResponse>('/column', body);
   }
 
-  remove(body: IRemoveColumnRequest) {
-    const { id } = body;
-    return this.httpClient.delete<IRemoveColumnResponse>(`/column/${id}`, body);
-  }
+  remove(body: IRemoveColumnRequest) {}
 
   update(body: IUpdateColumnRequest) {

[NoCoverage] BlockStatement
verticals/src/services/column.ts:46:38
     return this.httpClient.delete<IRemoveColumnResponse>(`/column/${id}`, body);
   }
 
-  update(body: IUpdateColumnRequest) {
-    const { id } = body;
-    return this.httpClient.patch<IUpdateColumnResponse>(`/column/${id}`, body);
-  }
+  update(body: IUpdateColumnRequest) {}
 
   updatePosition(body: IUpdateColumnPositionRequest) {

[NoCoverage] BlockStatement
verticals/src/services/column.ts:51:54
     return this.httpClient.patch<IUpdateColumnResponse>(`/column/${id}`, body);
   }
 
-  updatePosition(body: IUpdateColumnPositionRequest) {
-    return this.httpClient.patch<IUpdateColumnPositionResponse>('/column/position', body);
-  }
+  updatePosition(body: IUpdateColumnPositionRequest) {}
 
   duplicate(body: IDuplicateColumnRequest) {

[NoCoverage] BlockStatement
verticals/src/services/column.ts:55:44
     return this.httpClient.patch<IUpdateColumnPositionResponse>('/column/position', body);
   }
 
-  duplicate(body: IDuplicateColumnRequest) {
-    return this.httpClient.post<IDuplicateColumnResponse>('/column/duplicate', body);
-  }
+  duplicate(body: IDuplicateColumnRequest) {}
 
   reverseOrder(body: IReverseColumnOrderRequest) {

[NoCoverage] BlockStatement
verticals/src/services/column.ts:59:50
     return this.httpClient.post<IDuplicateColumnResponse>('/column/duplicate', body);
   }
 
-  reverseOrder(body: IReverseColumnOrderRequest) {
-    return this.httpClient.post<IReverseColumnOrderResponse>('/column/reverse', body);
-  }
+  reverseOrder(body: IReverseColumnOrderRequest) {}
 }
 
