[NoCoverage] BlockStatement
verticals/src/services/comment-attachment.ts:25:60
     this.httpClient = httpClient;
   }
 
-  getByTodoId(body: IGetCommentAttachmentsByTodoIdRequest) {
-    return this.httpClient.get<IGetCommentAttachmentsByTodoIdResponse>('/comment-attachment', {
-      params: body,
-    });
-  }
+  getByTodoId(body: IGetCommentAttachmentsByTodoIdRequest) {}
 
   uploadFile(body: IUploadCommentAttachmentRequest) {

[NoCoverage] ObjectLiteral
verticals/src/services/comment-attachment.ts:26:95
   }
 
   getByTodoId(body: IGetCommentAttachmentsByTodoIdRequest) {
-    return this.httpClient.get<IGetCommentAttachmentsByTodoIdResponse>('/comment-attachment', {
-      params: body,
-    });
+    return this.httpClient.get<IGetCommentAttachmentsByTodoIdResponse>('/comment-attachment', {});
   }
 

[NoCoverage] BlockStatement
verticals/src/services/comment-attachment.ts:31:53
     });
   }
 
-  uploadFile(body: IUploadCommentAttachmentRequest) {
-    const { commentId, file } = body;
-    return this.httpClient.post<IUploadCommentAttachmentResponse>(`/comment-attachment/${commentId}`, file, {
-      headers: { 'Content-Type': 'multipart/form-data' },
-    });
-  }
+  uploadFile(body: IUploadCommentAttachmentRequest) {}
 
   remove(body: IRemoveCommentAttachmentRequest) {

[NoCoverage] ObjectLiteral
verticals/src/services/comment-attachment.ts:33:109
 
   uploadFile(body: IUploadCommentAttachmentRequest) {
     const { commentId, file } = body;
-    return this.httpClient.post<IUploadCommentAttachmentResponse>(`/comment-attachment/${commentId}`, file, {
-      headers: { 'Content-Type': 'multipart/form-data' },
-    });
+    return this.httpClient.post<IUploadCommentAttachmentResponse>(`/comment-attachment/${commentId}`, file, {});
   }
 

[NoCoverage] StringLiteral
verticals/src/services/comment-attachment.ts:34:34
   uploadFile(body: IUploadCommentAttachmentRequest) {
     const { commentId, file } = body;
     return this.httpClient.post<IUploadCommentAttachmentResponse>(`/comment-attachment/${commentId}`, file, {
-      headers: { 'Content-Type': 'multipart/form-data' },
+      headers: { 'Content-Type': "" },
     });
   }

[NoCoverage] ObjectLiteral
verticals/src/services/comment-attachment.ts:34:16
   uploadFile(body: IUploadCommentAttachmentRequest) {
     const { commentId, file } = body;
     return this.httpClient.post<IUploadCommentAttachmentResponse>(`/comment-attachment/${commentId}`, file, {
-      headers: { 'Content-Type': 'multipart/form-data' },
+      headers: {},
     });
   }

[NoCoverage] BlockStatement
verticals/src/services/comment-attachment.ts:38:49
     });
   }
 
-  remove(body: IRemoveCommentAttachmentRequest) {
-    const { id } = body;
-    return this.httpClient.delete<IRemoveCommentAttachmentResponse>(`/comment-attachment/${id}`);
-  }
+  remove(body: IRemoveCommentAttachmentRequest) {}
 }
 
