[NoCoverage] BlockStatement
verticals/src/services/comment.ts:31:12
     this.httpClient = httpClient;
   }
 
-  getAll() {
-    return this.httpClient.get<IGetAllCommentsResponse>('/comment');
-  }
+  getAll() {}
 
   getByTodoId(body: IGetCommentsByTodoIdRequest) {

[NoCoverage] BlockStatement
verticals/src/services/comment.ts:35:50
     return this.httpClient.get<IGetAllCommentsResponse>('/comment');
   }
 
-  getByTodoId(body: IGetCommentsByTodoIdRequest) {
-    return this.httpClient.get<IGetCommentsByTodoIdResponse>('/comment', {
-      params: body,
-    });
-  }
+  getByTodoId(body: IGetCommentsByTodoIdRequest) {}
 
   create(body: ICreateCommentRequest) {

[NoCoverage] BlockStatement
verticals/src/services/comment.ts:41:39
     });
   }
 
-  create(body: ICreateCommentRequest) {
-    return this.httpClient.post<ICreateCommentResponse>('/comment', body);
-  }
+  create(body: ICreateCommentRequest) {}
 
   remove(body: IRemoveCommentRequest) {

[NoCoverage] BlockStatement
verticals/src/services/comment.ts:45:39
     return this.httpClient.post<ICreateCommentResponse>('/comment', body);
   }
 
-  remove(body: IRemoveCommentRequest) {
-    const { id } = body;
-    return this.httpClient.delete<IRemoveCommentResponse>(`/comment/${id}`, body);
-  }
+  remove(body: IRemoveCommentRequest) {}
 
   update(body: IUpdateCommentRequest) {

[NoCoverage] BlockStatement
verticals/src/services/comment.ts:50:39
     return this.httpClient.delete<IRemoveCommentResponse>(`/comment/${id}`, body);
   }
 
-  update(body: IUpdateCommentRequest) {
-    const { id } = body;
-    return this.httpClient.patch<IUpdateCommentResponse>(`/comment/${id}`, body);
-  }
+  update(body: IUpdateCommentRequest) {}
 
   addLike(body: IAddCommentLikeRequest) {

[NoCoverage] StringLiteral
verticals/src/services/comment.ts:52:58
 
   update(body: IUpdateCommentRequest) {
     const { id } = body;
-    return this.httpClient.patch<IUpdateCommentResponse>(`/comment/${id}`, body);
+    return this.httpClient.patch<IUpdateCommentResponse>(``, body);
   }
 

[NoCoverage] BlockStatement
verticals/src/services/comment.ts:55:41
     return this.httpClient.patch<IUpdateCommentResponse>(`/comment/${id}`, body);
   }
 
-  addLike(body: IAddCommentLikeRequest) {
-    return this.httpClient.post<IAddCommentLikeResponse>('/comment-like/', body);
-  }
+  addLike(body: IAddCommentLikeRequest) {}
 
   removeLike(body: IRemoveCommentLikeRequest) {

[NoCoverage] BlockStatement
verticals/src/services/comment.ts:59:47
     return this.httpClient.post<IAddCommentLikeResponse>('/comment-like/', body);
   }
 
-  removeLike(body: IRemoveCommentLikeRequest) {
-    const { commentId } = body;
-    return this.httpClient.delete<IRemoveCommentLikeResponse>(`/comment-like/${commentId}`);
-  }
+  removeLike(body: IRemoveCommentLikeRequest) {}
 }
 

[NoCoverage] StringLiteral
verticals/src/services/comment.ts:61:63
 
   removeLike(body: IRemoveCommentLikeRequest) {
     const { commentId } = body;
-    return this.httpClient.delete<IRemoveCommentLikeResponse>(`/comment-like/${commentId}`);
+    return this.httpClient.delete<IRemoveCommentLikeResponse>(``);
   }
 }
