[NoCoverage] BlockStatement
verticals/src/services/index.ts:44:5
     @inject(TYPES.CommentAttachmentService) commentAttachmentService: ICommentAttachmentService,
     @inject(TYPES.SearchService) searchService: ISearchService,
     @inject(TYPES.UpdateService) updateService: IUpdateService,
-  ) {
-    this.authService = authService;
-    this.userService = userService;
-    this.boardService = boardService;
-    this.columnService = columnService;
-    this.todoService = todoService;
-    this.commentService = commentService;
-    this.commentAttachmentService = commentAttachmentService;
-    this.searchService = searchService;
-    this.updateService = updateService;
-  }
+  ) {}
 }
 
