[NoCoverage] BlockStatement
verticals/src/services/search.ts:21:54
     this.httpClient = httpClient;
   }
 
-  searchByTodoTitle(body: ISearchByTodoTitleRequest) {
-    return this.httpClient.get<ISearchByTodoTitleResponse>('/search/todo', {
-      params: body,
-    });
-  }
+  searchByTodoTitle(body: ISearchByTodoTitleRequest) {}
 }
 
