[NoCoverage] BlockStatement
verticals/src/services/todo.ts:26:12
     this.httpClient = httpClient;
   }
 
-  getAll() {
-    return this.httpClient.get<IGetAllTodosResponse>('/todo');
-  }
+  getAll() {}
 
   getByBoardId(body: IGetTodosByBoardIdRequest) {

[NoCoverage] BlockStatement
verticals/src/services/todo.ts:30:49
     return this.httpClient.get<IGetAllTodosResponse>('/todo');
   }
 
-  getByBoardId(body: IGetTodosByBoardIdRequest) {
-    return this.httpClient.get<IGetTodosByBoardIdResponse>('/todo', {
-      params: body,
-    });
-  }
+  getByBoardId(body: IGetTodosByBoardIdRequest) {}
 
   getRemoved() {

[NoCoverage] BlockStatement
verticals/src/services/todo.ts:36:16
     });
   }
 
-  getRemoved() {
-    return this.httpClient.get<IGetRemovedTodosResponse>('/todo/trash');
-  }
+  getRemoved() {}
 
   create(body: ICreateTodoRequest) {

[NoCoverage] BlockStatement
verticals/src/services/todo.ts:40:36
     return this.httpClient.get<IGetRemovedTodosResponse>('/todo/trash');
   }
 
-  create(body: ICreateTodoRequest) {
-    return this.httpClient.post<ICreateTodoResponse>('/todo', body);
-  }
+  create(body: ICreateTodoRequest) {}
 
   remove(body: IRemoveTodoRequest) {

[NoCoverage] BlockStatement
verticals/src/services/todo.ts:44:36
     return this.httpClient.post<ICreateTodoResponse>('/todo', body);
   }
 
-  remove(body: IRemoveTodoRequest) {
-    const { id } = body;
-    return this.httpClient.delete<IRemoveTodoResponse>(`/todo/${id}`, body);
-  }
+  remove(body: IRemoveTodoRequest) {}
 
   update(body: IUpdateTodoRequest) {

[NoCoverage] BlockStatement
verticals/src/services/todo.ts:49:36
     return this.httpClient.delete<IRemoveTodoResponse>(`/todo/${id}`, body);
   }
 
-  update(body: IUpdateTodoRequest) {
-    const { id } = body;
-    return this.httpClient.patch<IUpdateTodoResponse>(`/todo/${id}`, body);
-  }
+  update(body: IUpdateTodoRequest) {}
 
   updatePosition(body: IUpdateTodoPositionRequest) {

[NoCoverage] BlockStatement
verticals/src/services/todo.ts:54:52
     return this.httpClient.patch<IUpdateTodoResponse>(`/todo/${id}`, body);
   }
 
-  updatePosition(body: IUpdateTodoPositionRequest) {
-    return this.httpClient.patch<IUpdateTodoPositionResponse>('/todo/position', body);
-  }
+  updatePosition(body: IUpdateTodoPositionRequest) {}
 
   duplicate(body: IDuplicateTodoRequest) {

[NoCoverage] StringLiteral
verticals/src/services/todo.ts:55:63
   }
 
   updatePosition(body: IUpdateTodoPositionRequest) {
-    return this.httpClient.patch<IUpdateTodoPositionResponse>('/todo/position', body);
+    return this.httpClient.patch<IUpdateTodoPositionResponse>("", body);
   }
 

[NoCoverage] BlockStatement
verticals/src/services/todo.ts:58:42
     return this.httpClient.patch<IUpdateTodoPositionResponse>('/todo/position', body);
   }
 
-  duplicate(body: IDuplicateTodoRequest) {
-    return this.httpClient.post<IDuplicateTodoResponse>('/todo/duplicate', body);
-  }
+  duplicate(body: IDuplicateTodoRequest) {}
 }
 
