[NoCoverage] BlockStatement
verticals/src/services/update.ts:21:5
 
   constructor(
   @inject(TYPES.WSClient) wsClient: IWSClient,
-  ) {
-    this.wsClient = wsClient;
-  }
+  ) {}
 
   openChannel() {

[NoCoverage] BlockStatement
verticals/src/services/update.ts:25:17
     this.wsClient = wsClient;
   }
 
-  openChannel() {
-    this.wsClient.open('updates');
-  }
+  openChannel() {}
 
   closeChannel() {

[NoCoverage] BlockStatement
verticals/src/services/update.ts:29:18
     this.wsClient.open('updates');
   }
 
-  closeChannel() {
-    this.wsClient.close('updates');
-  }
+  closeChannel() {}
 
   onBoardsUpdate(): Promise<IBoardUpdateResponse> {

[NoCoverage] BlockStatement
verticals/src/services/update.ts:33:51
     this.wsClient.close('updates');
   }
 
-  onBoardsUpdate(): Promise<IBoardUpdateResponse> {
-    return new Promise((resolve) => {
-      this.wsClient.on<IBoardUpdateResponse>('updates', 'board', resolve);
-    });
-  }
+  onBoardsUpdate(): Promise<IBoardUpdateResponse> {}
 
   onColumnsUpdate(): Promise<IColumnUpdateResponse> {

[NoCoverage] BlockStatement
verticals/src/services/update.ts:34:37
   }
 
   onBoardsUpdate(): Promise<IBoardUpdateResponse> {
-    return new Promise((resolve) => {
-      this.wsClient.on<IBoardUpdateResponse>('updates', 'board', resolve);
-    });
+    return new Promise((resolve) => {});
   }
 

[NoCoverage] StringLiteral
verticals/src/services/update.ts:35:57
 
   onBoardsUpdate(): Promise<IBoardUpdateResponse> {
     return new Promise((resolve) => {
-      this.wsClient.on<IBoardUpdateResponse>('updates', 'board', resolve);
+      this.wsClient.on<IBoardUpdateResponse>('updates', "", resolve);
     });
   }

[NoCoverage] BlockStatement
verticals/src/services/update.ts:39:53
     });
   }
 
-  onColumnsUpdate(): Promise<IColumnUpdateResponse> {
-    return new Promise((resolve) => {
-      this.wsClient.on<IColumnUpdateResponse>('updates', 'column', resolve);
-    });
-  }
+  onColumnsUpdate(): Promise<IColumnUpdateResponse> {}
 
   onTodosUpdate(): Promise<ITodoUpdateResponse> {

[NoCoverage] BlockStatement
verticals/src/services/update.ts:40:37
   }
 
   onColumnsUpdate(): Promise<IColumnUpdateResponse> {
-    return new Promise((resolve) => {
-      this.wsClient.on<IColumnUpdateResponse>('updates', 'column', resolve);
-    });
+    return new Promise((resolve) => {});
   }
 

[NoCoverage] BlockStatement
verticals/src/services/update.ts:45:49
     });
   }
 
-  onTodosUpdate(): Promise<ITodoUpdateResponse> {
-    return new Promise((resolve) => {
-      this.wsClient.on<ITodoUpdateResponse>('updates', 'todo', resolve);
-    });
-  }
+  onTodosUpdate(): Promise<ITodoUpdateResponse> {}
 
   onBoardPositionsUpdate(): Promise<IBoardPositionsUpdateResponse> {

[NoCoverage] BlockStatement
verticals/src/services/update.ts:46:37
   }
 
   onTodosUpdate(): Promise<ITodoUpdateResponse> {
-    return new Promise((resolve) => {
-      this.wsClient.on<ITodoUpdateResponse>('updates', 'todo', resolve);
-    });
+    return new Promise((resolve) => {});
   }
 

[NoCoverage] BlockStatement
verticals/src/services/update.ts:51:68
     });
   }
 
-  onBoardPositionsUpdate(): Promise<IBoardPositionsUpdateResponse> {
-    return new Promise((resolve) => {
-      this.wsClient.on<IBoardPositionsUpdateResponse>('updates', 'board_position', resolve);
-    });
-  }
+  onBoardPositionsUpdate(): Promise<IBoardPositionsUpdateResponse> {}
 
   onColumnPositionsUpdate(): Promise<IColumnPositionsUpdateResponse> {

[NoCoverage] BlockStatement
verticals/src/services/update.ts:52:37
   }
 
   onBoardPositionsUpdate(): Promise<IBoardPositionsUpdateResponse> {
-    return new Promise((resolve) => {
-      this.wsClient.on<IBoardPositionsUpdateResponse>('updates', 'board_position', resolve);
-    });
+    return new Promise((resolve) => {});
   }
 

[NoCoverage] StringLiteral
verticals/src/services/update.ts:53:55
 
   onBoardPositionsUpdate(): Promise<IBoardPositionsUpdateResponse> {
     return new Promise((resolve) => {
-      this.wsClient.on<IBoardPositionsUpdateResponse>('updates', 'board_position', resolve);
+      this.wsClient.on<IBoardPositionsUpdateResponse>("", 'board_position', resolve);
     });
   }

[NoCoverage] StringLiteral
verticals/src/services/update.ts:53:66
 
   onBoardPositionsUpdate(): Promise<IBoardPositionsUpdateResponse> {
     return new Promise((resolve) => {
-      this.wsClient.on<IBoardPositionsUpdateResponse>('updates', 'board_position', resolve);
+      this.wsClient.on<IBoardPositionsUpdateResponse>('updates', "", resolve);
     });
   }

[NoCoverage] BlockStatement
verticals/src/services/update.ts:57:70
     });
   }
 
-  onColumnPositionsUpdate(): Promise<IColumnPositionsUpdateResponse> {
-    return new Promise((resolve) => {
-      this.wsClient.on<IColumnPositionsUpdateResponse>('updates', 'column_position', resolve);
-    });
-  }
+  onColumnPositionsUpdate(): Promise<IColumnPositionsUpdateResponse> {}
 
   onTodoPositionsUpdate(): Promise<ITodoPositionsUpdateResponse> {

[NoCoverage] BlockStatement
verticals/src/services/update.ts:58:37
   }
 
   onColumnPositionsUpdate(): Promise<IColumnPositionsUpdateResponse> {
-    return new Promise((resolve) => {
-      this.wsClient.on<IColumnPositionsUpdateResponse>('updates', 'column_position', resolve);
-    });
+    return new Promise((resolve) => {});
   }
 

[NoCoverage] BlockStatement
verticals/src/services/update.ts:63:66
     });
   }
 
-  onTodoPositionsUpdate(): Promise<ITodoPositionsUpdateResponse> {
-    return new Promise((resolve) => {
-      this.wsClient.on<ITodoPositionsUpdateResponse>('updates', 'todo_position', resolve);
-    });
-  }
+  onTodoPositionsUpdate(): Promise<ITodoPositionsUpdateResponse> {}
 
   onCommentsUpdate(): Promise<ICommentUpdateResponse> {

[NoCoverage] BlockStatement
verticals/src/services/update.ts:64:37
   }
 
   onTodoPositionsUpdate(): Promise<ITodoPositionsUpdateResponse> {
-    return new Promise((resolve) => {
-      this.wsClient.on<ITodoPositionsUpdateResponse>('updates', 'todo_position', resolve);
-    });
+    return new Promise((resolve) => {});
   }
 

[NoCoverage] BlockStatement
verticals/src/services/update.ts:69:55
     });
   }
 
-  onCommentsUpdate(): Promise<ICommentUpdateResponse> {
-    return new Promise((resolve) => {
-      this.wsClient.on<ICommentUpdateResponse>('updates', 'comment', resolve);
-    });
-  }
+  onCommentsUpdate(): Promise<ICommentUpdateResponse> {}
 
   onCommentAttachmentsUpdate(): Promise<ICommentAttachmentUpdateResponse> {

[NoCoverage] BlockStatement
verticals/src/services/update.ts:70:37
   }
 
   onCommentsUpdate(): Promise<ICommentUpdateResponse> {
-    return new Promise((resolve) => {
-      this.wsClient.on<ICommentUpdateResponse>('updates', 'comment', resolve);
-    });
+    return new Promise((resolve) => {});
   }
 

[NoCoverage] BlockStatement
verticals/src/services/update.ts:75:75
     });
   }
 
-  onCommentAttachmentsUpdate(): Promise<ICommentAttachmentUpdateResponse> {
-    return new Promise((resolve) => {
-      this.wsClient.on<ICommentAttachmentUpdateResponse>('updates', 'comment_files', resolve);
-    });
-  }
+  onCommentAttachmentsUpdate(): Promise<ICommentAttachmentUpdateResponse> {}
 }
 

[NoCoverage] BlockStatement
verticals/src/services/update.ts:76:37
   }
 
   onCommentAttachmentsUpdate(): Promise<ICommentAttachmentUpdateResponse> {
-    return new Promise((resolve) => {
-      this.wsClient.on<ICommentAttachmentUpdateResponse>('updates', 'comment_files', resolve);
-    });
+    return new Promise((resolve) => {});
   }
 }
