[Survived] StringLiteral
src/store/actions/comment-attachments.ts:12:70
   IRemoveCommentAttachment,
 } from '@type/actions';
 
-const fetchByTodoId = createAction<IFetchCommentAttachmentsByTodoId>('COMMENT_ATTACHMENTS/FETCH_BY_TODO_ID');
+const fetchByTodoId = createAction<IFetchCommentAttachmentsByTodoId>("");
 const merge = createAction<ISetCommentAttachments>('COMMENT_ATTACHMENTS/MERGE');
 const add = createAction<IAddCommentAttachment>('COMMENT_ATTACHMENTS/ADD');

[Survived] StringLiteral
src/store/actions/comment-attachments.ts:14:49
 
 const fetchByTodoId = createAction<IFetchCommentAttachmentsByTodoId>('COMMENT_ATTACHMENTS/FETCH_BY_TODO_ID');
 const merge = createAction<ISetCommentAttachments>('COMMENT_ATTACHMENTS/MERGE');
-const add = createAction<IAddCommentAttachment>('COMMENT_ATTACHMENTS/ADD');
+const add = createAction<IAddCommentAttachment>("");
 const uploadFiles = createAction<IUploadCommentAttachmentsFiles>('COMMENT_ATTACHMENTS/UPLOAD_FILES');
 const uploadFile = createAction<PrepareAction<IUploadCommentAttachmentsFile>>(

[NoCoverage] BlockStatement
src/store/actions/comment-attachments.ts:18:50
 const uploadFiles = createAction<IUploadCommentAttachmentsFiles>('COMMENT_ATTACHMENTS/UPLOAD_FILES');
 const uploadFile = createAction<PrepareAction<IUploadCommentAttachmentsFile>>(
   'COMMENT_ATTACHMENTS/UPLOAD_FILE',
-  (payload: IUploadCommentAttachmentsFileRaw) => { // TODO: move to saga?
-    const { commentId, file } = payload;
-    const formData = new FormData();
-    formData.append(file.name, file);
-    return {
-      payload: {
-        commentId,
-        file: formData,
-      },
-    };
-  },
+  (payload: IUploadCommentAttachmentsFileRaw) => {},
 );
 const remove = createAction<IRemoveCommentAttachment>('COMMENT_ATTACHMENTS/REMOVE');
