[Survived] StringLiteral
src/store/actions/user.ts:22:48
 } from '@type/actions';
 
 const fetchMe = createAction('USER/FETCH_ME');
-const setUserData = createAction<ISetUserData>('USER/SET_USER_DATA');
+const setUserData = createAction<ISetUserData>("");
 const updateUsername = createAction<PrepareAction<IUpdateUsername>>(
   'USER/UPDATE_USERNAME',

[Survived] ArrowFunction
src/store/actions/user.ts:25:3
 const setUserData = createAction<ISetUserData>('USER/SET_USER_DATA');
 const updateUsername = createAction<PrepareAction<IUpdateUsername>>(
   'USER/UPDATE_USERNAME',
-  (payload: IUpdateUsernameRaw) => ({ payload: { username: payload } }),
+  () => undefined,
 );
 

[Survived] ArrowFunction
src/store/actions/user.ts:30:3
 
 const updateEmail = createAction<PrepareAction<IUpdateEmail>>(
   'USER/UPDATE_EMAIL',
-  (payload: IUpdateEmailRaw) => ({ payload: { email: payload } }),
+  () => undefined,
 );
 const setUsername = createAction<PrepareAction<ISetUsername>>(

[Survived] ArrowFunction
src/store/actions/user.ts:34:3
 );
 const setUsername = createAction<PrepareAction<ISetUsername>>(
   'USER/SET_USERNAME',
-  (payload: ISetUsernameRaw) => ({ payload: { username: payload } }),
+  () => undefined,
 );
 const setEmail = createAction<PrepareAction<ISetEmail>>(

[NoCoverage] ObjectLiteral
src/store/actions/user.ts:34:45
 );
 const setUsername = createAction<PrepareAction<ISetUsername>>(
   'USER/SET_USERNAME',
-  (payload: ISetUsernameRaw) => ({ payload: { username: payload } }),
+  (payload: ISetUsernameRaw) => ({ payload: {} }),
 );
 const setEmail = createAction<PrepareAction<ISetEmail>>(

[Survived] ArrowFunction
src/store/actions/user.ts:38:3
 );
 const setEmail = createAction<PrepareAction<ISetEmail>>(
   'USER/SET_EMAIL',
-  (payload: ISetEmailRaw) => ({ payload: { email: payload } }),
+  () => undefined,
 );
 const setAvatar = createAction<PrepareAction<ISetAvatar>>(

[NoCoverage] ObjectLiteral
src/store/actions/user.ts:38:31
 );
 const setEmail = createAction<PrepareAction<ISetEmail>>(
   'USER/SET_EMAIL',
-  (payload: ISetEmailRaw) => ({ payload: { email: payload } }),
+  (payload: ISetEmailRaw) => ({}),
 );
 const setAvatar = createAction<PrepareAction<ISetAvatar>>(

[Survived] ArrowFunction
src/store/actions/user.ts:42:3
 );
 const setAvatar = createAction<PrepareAction<ISetAvatar>>(
   'USER/SET_AVATAR',
-  (payload: ISetAvatarRaw) => ({ payload: { avatar: payload } }),
+  () => undefined,
 );
 const setPersonalData = createAction<ISetPersonalData>('USER/SET_PERSONAL_DATA');

[NoCoverage] ObjectLiteral
src/store/actions/user.ts:42:43
 );
 const setAvatar = createAction<PrepareAction<ISetAvatar>>(
   'USER/SET_AVATAR',
-  (payload: ISetAvatarRaw) => ({ payload: { avatar: payload } }),
+  (payload: ISetAvatarRaw) => ({ payload: {} }),
 );
 const setPersonalData = createAction<ISetPersonalData>('USER/SET_PERSONAL_DATA');

[Survived] StringLiteral
src/store/actions/user.ts:44:56
   'USER/SET_AVATAR',
   (payload: ISetAvatarRaw) => ({ payload: { avatar: payload } }),
 );
-const setPersonalData = createAction<ISetPersonalData>('USER/SET_PERSONAL_DATA');
+const setPersonalData = createAction<ISetPersonalData>("");
 const updatePersonalData = createAction<IUpdatePersonalData>('USER/UPDATE_PERSONAL_DATA');
 const uploadAvatar = createAction<PrepareAction<IUploadAvatar>>(

[NoCoverage] BlockStatement
src/store/actions/user.ts:48:34
 const updatePersonalData = createAction<IUpdatePersonalData>('USER/UPDATE_PERSONAL_DATA');
 const uploadAvatar = createAction<PrepareAction<IUploadAvatar>>(
   'USER/UPLOAD_AVATAR',
-  (payload: IUploadAvatarRaw) => {
-    const formData = new FormData();
-    formData.append('avatar', payload);
-    return {
-      payload: formData,
-    };
-  },
+  (payload: IUploadAvatarRaw) => {},
 );
 const removeAvatar = createAction('USER/REMOVE_AVATAR');
