[NoCoverage] BlockStatement
verticals/src/store/index.ts:8:40
 
 const sagaMiddleware = createSagaMiddleware();
 
-export const configureAppStore = () => {
-  const middleware = [sagaMiddleware];
-
-  const store = configureStore({
-    reducer: rootReducer,
-    middleware,
-  });
-
-  sagaMiddleware.run(rootSaga);
-  return store;
-};
+export const configureAppStore = () => {};
 

[NoCoverage] ArrayDeclaration
verticals/src/store/index.ts:9:22
 const sagaMiddleware = createSagaMiddleware();
 
 export const configureAppStore = () => {
-  const middleware = [sagaMiddleware];
+  const middleware = [];
 
   const store = configureStore({
