[NoCoverage] ArrayDeclaration
src/store/reducers/columns.ts:7:13
 import { IColumns } from '@type/entities';
 
 const initialState: IColumns = {
-  entities: [],
+  entities: ["Stryker was here"],
   positions: {},
 };

[NoCoverage] ArrowFunction
src/store/reducers/columns.ts:12:35
 };
 
 export const ColumnsReducer = createReducer(initialState, (builder) => builder
-  .addCase(ColumnsActions.setAll, (state, action) => action.payload)
+  .addCase(ColumnsActions.setAll, () => undefined)
   .addCase(ColumnsActions.setPositionsByBoardId, (draft, action) => {
     const { boardId, positions } = action.payload;

[NoCoverage] BlockStatement
src/store/reducers/columns.ts:13:69
 
 export const ColumnsReducer = createReducer(initialState, (builder) => builder
   .addCase(ColumnsActions.setAll, (state, action) => action.payload)
-  .addCase(ColumnsActions.setPositionsByBoardId, (draft, action) => {
-    const { boardId, positions } = action.payload;
-    draft.positions[boardId] = positions;
-  })
+  .addCase(ColumnsActions.setPositionsByBoardId, (draft, action) => {})
   .addCase(ColumnsActions.updateEntity, (draft, action) => {
     const { id } = action.payload;

[NoCoverage] BlockStatement
src/store/reducers/columns.ts:17:60
     const { boardId, positions } = action.payload;
     draft.positions[boardId] = positions;
   })
-  .addCase(ColumnsActions.updateEntity, (draft, action) => {
-    const { id } = action.payload;
-    const index = draft.entities.findIndex((column) => column.id === id);
-    draft.entities[index] = {
-      ...draft.entities[index],
-      ...action.payload,
-    };
-  })
+  .addCase(ColumnsActions.updateEntity, (draft, action) => {})
   .addCase(ColumnsActions.add, (draft, action) => {
     const { id, boardId } = action.payload;

[NoCoverage] ArrowFunction
src/store/reducers/columns.ts:19:44
   })
   .addCase(ColumnsActions.updateEntity, (draft, action) => {
     const { id } = action.payload;
-    const index = draft.entities.findIndex((column) => column.id === id);
+    const index = draft.entities.findIndex(() => undefined);
     draft.entities[index] = {
       ...draft.entities[index],

[NoCoverage] ConditionalExpression
src/store/reducers/columns.ts:19:56
   })
   .addCase(ColumnsActions.updateEntity, (draft, action) => {
     const { id } = action.payload;
-    const index = draft.entities.findIndex((column) => column.id === id);
+    const index = draft.entities.findIndex((column) => false);
     draft.entities[index] = {
       ...draft.entities[index],

[NoCoverage] BlockStatement
src/store/reducers/columns.ts:25:51
       ...action.payload,
     };
   })
-  .addCase(ColumnsActions.add, (draft, action) => {
-    const { id, boardId } = action.payload;
-
-    if (!draft.positions[boardId]) {
-      draft.positions[boardId] = [];
-    }
-    const isAlreadyExistId = draft.positions[boardId].includes(id);
-    if (!isAlreadyExistId) {
-      draft.entities.push(action.payload);
-      draft.positions[boardId].push(id);
-    }
-  })
+  .addCase(ColumnsActions.add, (draft, action) => {})
   .addCase(ColumnsActions.move, (draft, action) => {
     const { boardId, sourcePosition, destinationPosition } = action.payload;

[NoCoverage] ConditionalExpression
src/store/reducers/columns.ts:28:9
   .addCase(ColumnsActions.add, (draft, action) => {
     const { id, boardId } = action.payload;
 
-    if (!draft.positions[boardId]) {
+    if (true) {
       draft.positions[boardId] = [];
     }

[NoCoverage] ConditionalExpression
src/store/reducers/columns.ts:28:9
   .addCase(ColumnsActions.add, (draft, action) => {
     const { id, boardId } = action.payload;
 
-    if (!draft.positions[boardId]) {
+    if (false) {
       draft.positions[boardId] = [];
     }

[NoCoverage] ArrayDeclaration
src/store/reducers/columns.ts:29:34
     const { id, boardId } = action.payload;
 
     if (!draft.positions[boardId]) {
-      draft.positions[boardId] = [];
+      draft.positions[boardId] = ["Stryker was here"];
     }
     const isAlreadyExistId = draft.positions[boardId].includes(id);

[NoCoverage] ConditionalExpression
src/store/reducers/columns.ts:32:9
       draft.positions[boardId] = [];
     }
     const isAlreadyExistId = draft.positions[boardId].includes(id);
-    if (!isAlreadyExistId) {
+    if (true) {
       draft.entities.push(action.payload);
       draft.positions[boardId].push(id);

[NoCoverage] BlockStatement
src/store/reducers/columns.ts:32:28
       draft.positions[boardId] = [];
     }
     const isAlreadyExistId = draft.positions[boardId].includes(id);
-    if (!isAlreadyExistId) {
-      draft.entities.push(action.payload);
-      draft.positions[boardId].push(id);
-    }
+    if (!isAlreadyExistId) {}
   })
   .addCase(ColumnsActions.move, (draft, action) => {

[NoCoverage] BlockStatement
src/store/reducers/columns.ts:37:52
       draft.positions[boardId].push(id);
     }
   })
-  .addCase(ColumnsActions.move, (draft, action) => {
-    const { boardId, sourcePosition, destinationPosition } = action.payload;
-    draft.positions[boardId].splice(destinationPosition, 0, draft.positions[boardId].splice(sourcePosition, 1)[0]);
-  })
+  .addCase(ColumnsActions.move, (draft, action) => {})
   .addCase(ColumnsActions.insertInPosition, (draft, action) => {
     const { position, entity } = action.payload;

[NoCoverage] BlockStatement
src/store/reducers/columns.ts:41:64
     const { boardId, sourcePosition, destinationPosition } = action.payload;
     draft.positions[boardId].splice(destinationPosition, 0, draft.positions[boardId].splice(sourcePosition, 1)[0]);
   })
-  .addCase(ColumnsActions.insertInPosition, (draft, action) => {
-    const { position, entity } = action.payload;
-    const isAlreadyExistId = draft.positions[entity.boardId].includes(entity.id);
-    if (!isAlreadyExistId) {
-      draft.entities.push(entity);
-      draft.positions[entity.boardId].splice(position, 0, entity.id);
-    }
-  })
+  .addCase(ColumnsActions.insertInPosition, (draft, action) => {})
   .addCase(ColumnsActions.remove, (draft, action) => {
     const { id } = action.payload;

[NoCoverage] ConditionalExpression
src/store/reducers/columns.ts:44:9
   .addCase(ColumnsActions.insertInPosition, (draft, action) => {
     const { position, entity } = action.payload;
     const isAlreadyExistId = draft.positions[entity.boardId].includes(entity.id);
-    if (!isAlreadyExistId) {
+    if (true) {
       draft.entities.push(entity);
       draft.positions[entity.boardId].splice(position, 0, entity.id);

[NoCoverage] BlockStatement
src/store/reducers/columns.ts:44:28
   .addCase(ColumnsActions.insertInPosition, (draft, action) => {
     const { position, entity } = action.payload;
     const isAlreadyExistId = draft.positions[entity.boardId].includes(entity.id);
-    if (!isAlreadyExistId) {
-      draft.entities.push(entity);
-      draft.positions[entity.boardId].splice(position, 0, entity.id);
-    }
+    if (!isAlreadyExistId) {}
   })
   .addCase(ColumnsActions.remove, (draft, action) => {

[NoCoverage] BlockStatement
src/store/reducers/columns.ts:49:54
       draft.positions[entity.boardId].splice(position, 0, entity.id);
     }
   })
-  .addCase(ColumnsActions.remove, (draft, action) => {
-    const { id } = action.payload;
-
-    const entityIndex = draft.entities.findIndex((column) => column.id === id);
-    if (entityIndex !== -1) {
-      const { boardId } = draft.entities[entityIndex];
-      draft.entities.splice(entityIndex, 1);
-      const positionIndex = draft.positions[boardId].findIndex((columnId) => columnId === id);
-      if (positionIndex !== -1) draft.positions[boardId].splice(positionIndex, 1);
-    }
-  })
+  .addCase(ColumnsActions.remove, (draft, action) => {})
   .addCase(ColumnsActions.drawBelow, (draft, action) => {
     const { belowId, boardId } = action.payload;

[NoCoverage] ArrowFunction
src/store/reducers/columns.ts:52:50
   .addCase(ColumnsActions.remove, (draft, action) => {
     const { id } = action.payload;
 
-    const entityIndex = draft.entities.findIndex((column) => column.id === id);
+    const entityIndex = draft.entities.findIndex(() => undefined);
     if (entityIndex !== -1) {
       const { boardId } = draft.entities[entityIndex];

[NoCoverage] ConditionalExpression
src/store/reducers/columns.ts:52:62
   .addCase(ColumnsActions.remove, (draft, action) => {
     const { id } = action.payload;
 
-    const entityIndex = draft.entities.findIndex((column) => column.id === id);
+    const entityIndex = draft.entities.findIndex((column) => true);
     if (entityIndex !== -1) {
       const { boardId } = draft.entities[entityIndex];

[NoCoverage] ConditionalExpression
src/store/reducers/columns.ts:53:9
     const { id } = action.payload;
 
     const entityIndex = draft.entities.findIndex((column) => column.id === id);
-    if (entityIndex !== -1) {
+    if (true) {
       const { boardId } = draft.entities[entityIndex];
       draft.entities.splice(entityIndex, 1);

[NoCoverage] UnaryOperator
src/store/reducers/columns.ts:53:25
     const { id } = action.payload;
 
     const entityIndex = draft.entities.findIndex((column) => column.id === id);
-    if (entityIndex !== -1) {
+    if (entityIndex !== +1) {
       const { boardId } = draft.entities[entityIndex];
       draft.entities.splice(entityIndex, 1);

[NoCoverage] EqualityOperator
src/store/reducers/columns.ts:56:78
     if (entityIndex !== -1) {
       const { boardId } = draft.entities[entityIndex];
       draft.entities.splice(entityIndex, 1);
-      const positionIndex = draft.positions[boardId].findIndex((columnId) => columnId === id);
+      const positionIndex = draft.positions[boardId].findIndex((columnId) => columnId !== id);
       if (positionIndex !== -1) draft.positions[boardId].splice(positionIndex, 1);
     }

[NoCoverage] ArrowFunction
src/store/reducers/columns.ts:56:64
     if (entityIndex !== -1) {
       const { boardId } = draft.entities[entityIndex];
       draft.entities.splice(entityIndex, 1);
-      const positionIndex = draft.positions[boardId].findIndex((columnId) => columnId === id);
+      const positionIndex = draft.positions[boardId].findIndex(() => undefined);
       if (positionIndex !== -1) draft.positions[boardId].splice(positionIndex, 1);
     }

[NoCoverage] ConditionalExpression
src/store/reducers/columns.ts:57:11
       const { boardId } = draft.entities[entityIndex];
       draft.entities.splice(entityIndex, 1);
       const positionIndex = draft.positions[boardId].findIndex((columnId) => columnId === id);
-      if (positionIndex !== -1) draft.positions[boardId].splice(positionIndex, 1);
+      if (true) draft.positions[boardId].splice(positionIndex, 1);
     }
   })

[NoCoverage] EqualityOperator
src/store/reducers/columns.ts:57:11
       const { boardId } = draft.entities[entityIndex];
       draft.entities.splice(entityIndex, 1);
       const positionIndex = draft.positions[boardId].findIndex((columnId) => columnId === id);
-      if (positionIndex !== -1) draft.positions[boardId].splice(positionIndex, 1);
+      if (positionIndex === -1) draft.positions[boardId].splice(positionIndex, 1);
     }
   })

[NoCoverage] BlockStatement
src/store/reducers/columns.ts:60:57
       if (positionIndex !== -1) draft.positions[boardId].splice(positionIndex, 1);
     }
   })
-  .addCase(ColumnsActions.drawBelow, (draft, action) => {
-    const { belowId, boardId } = action.payload;
-
-    const positionIndex = draft.positions[boardId].findIndex((columnId) => columnId === belowId);
-
-    draft.entities.push({
-      id: TEMP_ID,
-      boardId,
-      belowId,
-      title: '',
-    });
-
-    draft.positions[boardId].splice(positionIndex + 1, 0, TEMP_ID);
-  })
+  .addCase(ColumnsActions.drawBelow, (draft, action) => {})
   .addCase(ColumnsActions.removeTemp, (draft) => {
     const entityIndex = draft.entities.findIndex((column) => column.id === TEMP_ID);

[NoCoverage] ConditionalExpression
src/store/reducers/columns.ts:63:76
   .addCase(ColumnsActions.drawBelow, (draft, action) => {
     const { belowId, boardId } = action.payload;
 
-    const positionIndex = draft.positions[boardId].findIndex((columnId) => columnId === belowId);
+    const positionIndex = draft.positions[boardId].findIndex((columnId) => true);
 
     draft.entities.push({

[NoCoverage] EqualityOperator
src/store/reducers/columns.ts:63:76
   .addCase(ColumnsActions.drawBelow, (draft, action) => {
     const { belowId, boardId } = action.payload;
 
-    const positionIndex = draft.positions[boardId].findIndex((columnId) => columnId === belowId);
+    const positionIndex = draft.positions[boardId].findIndex((columnId) => columnId !== belowId);
 
     draft.entities.push({

[NoCoverage] ArithmeticOperator
src/store/reducers/columns.ts:72:37
       title: '',
     });
 
-    draft.positions[boardId].splice(positionIndex + 1, 0, TEMP_ID);
+    draft.positions[boardId].splice(positionIndex - 1, 0, TEMP_ID);
   })
   .addCase(ColumnsActions.removeTemp, (draft) => {

[NoCoverage] BlockStatement
src/store/reducers/columns.ts:74:50
 
     draft.positions[boardId].splice(positionIndex + 1, 0, TEMP_ID);
   })
-  .addCase(ColumnsActions.removeTemp, (draft) => {
-    const entityIndex = draft.entities.findIndex((column) => column.id === TEMP_ID);
-    if (entityIndex !== -1) {
-      const { boardId } = draft.entities[entityIndex];
-      draft.entities.splice(entityIndex, 1);
-
-      const positionIndex = draft.positions[boardId].findIndex((columnId) => columnId === TEMP_ID);
-      if (positionIndex !== -1) draft.positions[boardId].splice(positionIndex, 1);
-    }
-  })
+  .addCase(ColumnsActions.removeTemp, (draft) => {})
   .addCase(ColumnsActions.reverseOrder, (draft, action) => {
     const { boardId } = action.payload;

[NoCoverage] ArrowFunction
src/store/reducers/columns.ts:75:50
     draft.positions[boardId].splice(positionIndex + 1, 0, TEMP_ID);
   })
   .addCase(ColumnsActions.removeTemp, (draft) => {
-    const entityIndex = draft.entities.findIndex((column) => column.id === TEMP_ID);
+    const entityIndex = draft.entities.findIndex(() => undefined);
     if (entityIndex !== -1) {
       const { boardId } = draft.entities[entityIndex];

[NoCoverage] EqualityOperator
src/store/reducers/columns.ts:75:62
     draft.positions[boardId].splice(positionIndex + 1, 0, TEMP_ID);
   })
   .addCase(ColumnsActions.removeTemp, (draft) => {
-    const entityIndex = draft.entities.findIndex((column) => column.id === TEMP_ID);
+    const entityIndex = draft.entities.findIndex((column) => column.id !== TEMP_ID);
     if (entityIndex !== -1) {
       const { boardId } = draft.entities[entityIndex];

[NoCoverage] UnaryOperator
src/store/reducers/columns.ts:76:25
   })
   .addCase(ColumnsActions.removeTemp, (draft) => {
     const entityIndex = draft.entities.findIndex((column) => column.id === TEMP_ID);
-    if (entityIndex !== -1) {
+    if (entityIndex !== +1) {
       const { boardId } = draft.entities[entityIndex];
       draft.entities.splice(entityIndex, 1);

[NoCoverage] EqualityOperator
src/store/reducers/columns.ts:76:9
   })
   .addCase(ColumnsActions.removeTemp, (draft) => {
     const entityIndex = draft.entities.findIndex((column) => column.id === TEMP_ID);
-    if (entityIndex !== -1) {
+    if (entityIndex === -1) {
       const { boardId } = draft.entities[entityIndex];
       draft.entities.splice(entityIndex, 1);

[NoCoverage] EqualityOperator
src/store/reducers/columns.ts:80:78
       const { boardId } = draft.entities[entityIndex];
       draft.entities.splice(entityIndex, 1);
 
-      const positionIndex = draft.positions[boardId].findIndex((columnId) => columnId === TEMP_ID);
+      const positionIndex = draft.positions[boardId].findIndex((columnId) => columnId !== TEMP_ID);
       if (positionIndex !== -1) draft.positions[boardId].splice(positionIndex, 1);
     }

[NoCoverage] ArrowFunction
src/store/reducers/columns.ts:80:64
       const { boardId } = draft.entities[entityIndex];
       draft.entities.splice(entityIndex, 1);
 
-      const positionIndex = draft.positions[boardId].findIndex((columnId) => columnId === TEMP_ID);
+      const positionIndex = draft.positions[boardId].findIndex(() => undefined);
       if (positionIndex !== -1) draft.positions[boardId].splice(positionIndex, 1);
     }

[NoCoverage] UnaryOperator
src/store/reducers/columns.ts:81:29
       draft.entities.splice(entityIndex, 1);
 
       const positionIndex = draft.positions[boardId].findIndex((columnId) => columnId === TEMP_ID);
-      if (positionIndex !== -1) draft.positions[boardId].splice(positionIndex, 1);
+      if (positionIndex !== +1) draft.positions[boardId].splice(positionIndex, 1);
     }
   })

[NoCoverage] ConditionalExpression
src/store/reducers/columns.ts:81:11
       draft.entities.splice(entityIndex, 1);
 
       const positionIndex = draft.positions[boardId].findIndex((columnId) => columnId === TEMP_ID);
-      if (positionIndex !== -1) draft.positions[boardId].splice(positionIndex, 1);
+      if (true) draft.positions[boardId].splice(positionIndex, 1);
     }
   })

[NoCoverage] BlockStatement
src/store/reducers/columns.ts:84:60
       if (positionIndex !== -1) draft.positions[boardId].splice(positionIndex, 1);
     }
   })
-  .addCase(ColumnsActions.reverseOrder, (draft, action) => {
-    const { boardId } = action.payload;
-    if (draft.positions[boardId]) {
-      draft.positions[boardId].reverse();
-    }
-  }));
+  .addCase(ColumnsActions.reverseOrder, (draft, action) => {}));
 

[NoCoverage] BlockStatement
src/store/reducers/columns.ts:86:35
   })
   .addCase(ColumnsActions.reverseOrder, (draft, action) => {
     const { boardId } = action.payload;
-    if (draft.positions[boardId]) {
-      draft.positions[boardId].reverse();
-    }
+    if (draft.positions[boardId]) {}
   }));
 

[NoCoverage] ConditionalExpression
src/store/reducers/columns.ts:86:9
   })
   .addCase(ColumnsActions.reverseOrder, (draft, action) => {
     const { boardId } = action.payload;
-    if (draft.positions[boardId]) {
+    if (false) {
       draft.positions[boardId].reverse();
     }
