[NoCoverage] ArrowFunction
src/store/reducers/comment-attachments.ts:8:70
 
 const initialState: ICommentAttachments = [];
 
-export const CommentAttachmentsReducer = createReducer(initialState, (builder) => builder
-  .addCase(CommentAttachmentsActions.merge, (draft, action) => (uniqBy([...action.payload, ...draft], 'id')))
-  .addCase(CommentAttachmentsActions.add, (draft, action) => { draft.push(action.payload); })
-  .addCase(CommentAttachmentsActions.remove, (draft, action) => {
-    draft.splice(draft.findIndex((attachment) => attachment.id === action.payload.id), 1);
-  }));
+export const CommentAttachmentsReducer = createReducer(initialState, () => undefined);
 

[NoCoverage] ArrowFunction
src/store/reducers/comment-attachments.ts:9:45
 const initialState: ICommentAttachments = [];
 
 export const CommentAttachmentsReducer = createReducer(initialState, (builder) => builder
-  .addCase(CommentAttachmentsActions.merge, (draft, action) => (uniqBy([...action.payload, ...draft], 'id')))
+  .addCase(CommentAttachmentsActions.merge, () => undefined)
   .addCase(CommentAttachmentsActions.add, (draft, action) => { draft.push(action.payload); })
   .addCase(CommentAttachmentsActions.remove, (draft, action) => {

[NoCoverage] BlockStatement
src/store/reducers/comment-attachments.ts:10:62
 
 export const CommentAttachmentsReducer = createReducer(initialState, (builder) => builder
   .addCase(CommentAttachmentsActions.merge, (draft, action) => (uniqBy([...action.payload, ...draft], 'id')))
-  .addCase(CommentAttachmentsActions.add, (draft, action) => { draft.push(action.payload); })
+  .addCase(CommentAttachmentsActions.add, (draft, action) => {})
   .addCase(CommentAttachmentsActions.remove, (draft, action) => {
     draft.splice(draft.findIndex((attachment) => attachment.id === action.payload.id), 1);

[NoCoverage] BlockStatement
src/store/reducers/comment-attachments.ts:11:65
 export const CommentAttachmentsReducer = createReducer(initialState, (builder) => builder
   .addCase(CommentAttachmentsActions.merge, (draft, action) => (uniqBy([...action.payload, ...draft], 'id')))
   .addCase(CommentAttachmentsActions.add, (draft, action) => { draft.push(action.payload); })
-  .addCase(CommentAttachmentsActions.remove, (draft, action) => {
-    draft.splice(draft.findIndex((attachment) => attachment.id === action.payload.id), 1);
-  }));
+  .addCase(CommentAttachmentsActions.remove, (draft, action) => {}));
 

[NoCoverage] ConditionalExpression
src/store/reducers/comment-attachments.ts:12:50
   .addCase(CommentAttachmentsActions.merge, (draft, action) => (uniqBy([...action.payload, ...draft], 'id')))
   .addCase(CommentAttachmentsActions.add, (draft, action) => { draft.push(action.payload); })
   .addCase(CommentAttachmentsActions.remove, (draft, action) => {
-    draft.splice(draft.findIndex((attachment) => attachment.id === action.payload.id), 1);
+    draft.splice(draft.findIndex((attachment) => true), 1);
   }));
 

[NoCoverage] EqualityOperator
src/store/reducers/comment-attachments.ts:12:50
   .addCase(CommentAttachmentsActions.merge, (draft, action) => (uniqBy([...action.payload, ...draft], 'id')))
   .addCase(CommentAttachmentsActions.add, (draft, action) => { draft.push(action.payload); })
   .addCase(CommentAttachmentsActions.remove, (draft, action) => {
-    draft.splice(draft.findIndex((attachment) => attachment.id === action.payload.id), 1);
+    draft.splice(draft.findIndex((attachment) => attachment.id !== action.payload.id), 1);
   }));
 
