[NoCoverage] ArrayDeclaration
src/store/reducers/comments.ts:5:33
 import { createReducer } from '@reduxjs/toolkit';
 import { CommentsActions } from '@store/actions';
 
-const initialState: IComments = [];
+const initialState: IComments = ["Stryker was here"];
 
 export const CommentsReducer = createReducer(initialState, (builder) => builder

[NoCoverage] ArrowFunction
src/store/reducers/comments.ts:8:36
 const initialState: IComments = [];
 
 export const CommentsReducer = createReducer(initialState, (builder) => builder
-  .addCase(CommentsActions.setAll, (draft, action) => action.payload)
+  .addCase(CommentsActions.setAll, () => undefined)
   .addCase(CommentsActions.add, (draft, action) => {
     const { id } = action.payload;

[NoCoverage] BlockStatement
src/store/reducers/comments.ts:9:52
 
 export const CommentsReducer = createReducer(initialState, (builder) => builder
   .addCase(CommentsActions.setAll, (draft, action) => action.payload)
-  .addCase(CommentsActions.add, (draft, action) => {
-    const { id } = action.payload;
-    const isAlreadyExist = draft.some((comment) => comment.id === id);
-    if (!isAlreadyExist) {
-      draft.push({
-        createdAt: new Date().getTime(),
-        updatedAt: new Date().getTime(),
-        userId: 1,
-        ...action.payload,
-      });
-    }
-  })
+  .addCase(CommentsActions.add, (draft, action) => {})
   .addCase(CommentsActions.remove, (draft, action) => {
     const { id } = action.payload;

[NoCoverage] ConditionalExpression
src/store/reducers/comments.ts:11:52
   .addCase(CommentsActions.setAll, (draft, action) => action.payload)
   .addCase(CommentsActions.add, (draft, action) => {
     const { id } = action.payload;
-    const isAlreadyExist = draft.some((comment) => comment.id === id);
+    const isAlreadyExist = draft.some((comment) => true);
     if (!isAlreadyExist) {
       draft.push({

[NoCoverage] ConditionalExpression
src/store/reducers/comments.ts:11:52
   .addCase(CommentsActions.setAll, (draft, action) => action.payload)
   .addCase(CommentsActions.add, (draft, action) => {
     const { id } = action.payload;
-    const isAlreadyExist = draft.some((comment) => comment.id === id);
+    const isAlreadyExist = draft.some((comment) => false);
     if (!isAlreadyExist) {
       draft.push({

[NoCoverage] BooleanLiteral
src/store/reducers/comments.ts:12:9
   .addCase(CommentsActions.add, (draft, action) => {
     const { id } = action.payload;
     const isAlreadyExist = draft.some((comment) => comment.id === id);
-    if (!isAlreadyExist) {
+    if (isAlreadyExist) {
       draft.push({
         createdAt: new Date().getTime(),

[NoCoverage] ConditionalExpression
src/store/reducers/comments.ts:12:9
   .addCase(CommentsActions.add, (draft, action) => {
     const { id } = action.payload;
     const isAlreadyExist = draft.some((comment) => comment.id === id);
-    if (!isAlreadyExist) {
+    if (false) {
       draft.push({
         createdAt: new Date().getTime(),

[NoCoverage] BlockStatement
src/store/reducers/comments.ts:21:55
       });
     }
   })
-  .addCase(CommentsActions.remove, (draft, action) => {
-    const { id } = action.payload;
-    const index = draft.findIndex((comment) => comment.id === id);
-    if (index !== -1) draft.splice(index, 1);
-  })
+  .addCase(CommentsActions.remove, (draft, action) => {})
   .addCase(CommentsActions.updateText, (draft, action) => {
     const { id, text } = action.payload;

[NoCoverage] ConditionalExpression
src/store/reducers/comments.ts:23:48
   })
   .addCase(CommentsActions.remove, (draft, action) => {
     const { id } = action.payload;
-    const index = draft.findIndex((comment) => comment.id === id);
+    const index = draft.findIndex((comment) => false);
     if (index !== -1) draft.splice(index, 1);
   })

[NoCoverage] ConditionalExpression
src/store/reducers/comments.ts:23:48
   })
   .addCase(CommentsActions.remove, (draft, action) => {
     const { id } = action.payload;
-    const index = draft.findIndex((comment) => comment.id === id);
+    const index = draft.findIndex((comment) => true);
     if (index !== -1) draft.splice(index, 1);
   })

[NoCoverage] ConditionalExpression
src/store/reducers/comments.ts:24:9
   .addCase(CommentsActions.remove, (draft, action) => {
     const { id } = action.payload;
     const index = draft.findIndex((comment) => comment.id === id);
-    if (index !== -1) draft.splice(index, 1);
+    if (true) draft.splice(index, 1);
   })
   .addCase(CommentsActions.updateText, (draft, action) => {

[NoCoverage] ConditionalExpression
src/store/reducers/comments.ts:24:9
   .addCase(CommentsActions.remove, (draft, action) => {
     const { id } = action.payload;
     const index = draft.findIndex((comment) => comment.id === id);
-    if (index !== -1) draft.splice(index, 1);
+    if (false) draft.splice(index, 1);
   })
   .addCase(CommentsActions.updateText, (draft, action) => {

[NoCoverage] BlockStatement
src/store/reducers/comments.ts:26:59
     const index = draft.findIndex((comment) => comment.id === id);
     if (index !== -1) draft.splice(index, 1);
   })
-  .addCase(CommentsActions.updateText, (draft, action) => {
-    const { id, text } = action.payload;
-    const index = draft.findIndex((comment) => comment.id === id);
-    draft[index].text = text;
-    draft[index].updatedAt = new Date().getTime();
-  })
+  .addCase(CommentsActions.updateText, (draft, action) => {})
   .addCase(CommentsActions.updateLike, (draft, action) => {
     const { commentId, like, isLiked } = action.payload;

[NoCoverage] ArrowFunction
src/store/reducers/comments.ts:28:35
   })
   .addCase(CommentsActions.updateText, (draft, action) => {
     const { id, text } = action.payload;
-    const index = draft.findIndex((comment) => comment.id === id);
+    const index = draft.findIndex(() => undefined);
     draft[index].text = text;
     draft[index].updatedAt = new Date().getTime();

[NoCoverage] ConditionalExpression
src/store/reducers/comments.ts:28:48
   })
   .addCase(CommentsActions.updateText, (draft, action) => {
     const { id, text } = action.payload;
-    const index = draft.findIndex((comment) => comment.id === id);
+    const index = draft.findIndex((comment) => false);
     draft[index].text = text;
     draft[index].updatedAt = new Date().getTime();

[NoCoverage] BlockStatement
src/store/reducers/comments.ts:32:59
     draft[index].text = text;
     draft[index].updatedAt = new Date().getTime();
   })
-  .addCase(CommentsActions.updateLike, (draft, action) => {
-    const { commentId, like, isLiked } = action.payload;
-    const index = draft.findIndex((comment) => comment.id === commentId);
-    const likedUsers = draft[index].likedUsers ?? [];
-    draft[index].likedUsers = isLiked
-      ? [...likedUsers, like]
-      : likedUsers.filter((l) => l.username !== like.username);
-  }));
+  .addCase(CommentsActions.updateLike, (draft, action) => {}));
 

[NoCoverage] EqualityOperator
src/store/reducers/comments.ts:34:48
   })
   .addCase(CommentsActions.updateLike, (draft, action) => {
     const { commentId, like, isLiked } = action.payload;
-    const index = draft.findIndex((comment) => comment.id === commentId);
+    const index = draft.findIndex((comment) => comment.id !== commentId);
     const likedUsers = draft[index].likedUsers ?? [];
     draft[index].likedUsers = isLiked

[NoCoverage] ConditionalExpression
src/store/reducers/comments.ts:34:48
   })
   .addCase(CommentsActions.updateLike, (draft, action) => {
     const { commentId, like, isLiked } = action.payload;
-    const index = draft.findIndex((comment) => comment.id === commentId);
+    const index = draft.findIndex((comment) => true);
     const likedUsers = draft[index].likedUsers ?? [];
     draft[index].likedUsers = isLiked

[NoCoverage] EqualityOperator
src/store/reducers/comments.ts:38:34
     const likedUsers = draft[index].likedUsers ?? [];
     draft[index].likedUsers = isLiked
       ? [...likedUsers, like]
-      : likedUsers.filter((l) => l.username !== like.username);
+      : likedUsers.filter((l) => l.username === like.username);
   }));
 

[NoCoverage] ConditionalExpression
src/store/reducers/comments.ts:38:34
     const likedUsers = draft[index].likedUsers ?? [];
     draft[index].likedUsers = isLiked
       ? [...likedUsers, like]
-      : likedUsers.filter((l) => l.username !== like.username);
+      : likedUsers.filter((l) => false);
   }));
 
