[NoCoverage] ObjectLiteral
src/store/reducers/todos.ts:8:30
 import { TEMP_ID } from '@/constants';
 import { TodosActions } from '../actions';
 
-const initialState: ITodos = {
-  entities: [],
-  positions: {},
-};
+const initialState: ITodos = {};
 
 export const TodosReducer = createReducer(initialState, (builder) => builder

[NoCoverage] ArrayDeclaration
src/store/reducers/todos.ts:9:13
 import { TodosActions } from '../actions';
 
 const initialState: ITodos = {
-  entities: [],
+  entities: ["Stryker was here"],
   positions: {},
 };

[NoCoverage] ArrowFunction
src/store/reducers/todos.ts:14:33
 };
 
 export const TodosReducer = createReducer(initialState, (builder) => builder
-  .addCase(TodosActions.setAll, (state, action) => action.payload)
+  .addCase(TodosActions.setAll, () => undefined)
   .addCase(TodosActions.setPositionsByColumnId, (draft, action) => {
     const { columnId, positions } = action.payload;

[NoCoverage] BlockStatement
src/store/reducers/todos.ts:15:68
 
 export const TodosReducer = createReducer(initialState, (builder) => builder
   .addCase(TodosActions.setAll, (state, action) => action.payload)
-  .addCase(TodosActions.setPositionsByColumnId, (draft, action) => {
-    const { columnId, positions } = action.payload;
-    draft.positions[columnId] = positions;
-  })
+  .addCase(TodosActions.setPositionsByColumnId, (draft, action) => {})
   .addCase(TodosActions.updateEntity, (draft, action) => {
     const { id } = action.payload;

[NoCoverage] BlockStatement
src/store/reducers/todos.ts:19:58
     const { columnId, positions } = action.payload;
     draft.positions[columnId] = positions;
   })
-  .addCase(TodosActions.updateEntity, (draft, action) => {
-    const { id } = action.payload;
-    const index = draft.entities.findIndex((todo) => todo.id === id);
-    draft.entities[index] = {
-      ...draft.entities[index],
-      ...action.payload,
-    };
-  })
+  .addCase(TodosActions.updateEntity, (draft, action) => {})
   .addCase(TodosActions.add, (draft, action) => {
     const { id, columnId } = action.payload;

[NoCoverage] ConditionalExpression
src/store/reducers/todos.ts:21:54
   })
   .addCase(TodosActions.updateEntity, (draft, action) => {
     const { id } = action.payload;
-    const index = draft.entities.findIndex((todo) => todo.id === id);
+    const index = draft.entities.findIndex((todo) => true);
     draft.entities[index] = {
       ...draft.entities[index],

[NoCoverage] EqualityOperator
src/store/reducers/todos.ts:21:54
   })
   .addCase(TodosActions.updateEntity, (draft, action) => {
     const { id } = action.payload;
-    const index = draft.entities.findIndex((todo) => todo.id === id);
+    const index = draft.entities.findIndex((todo) => todo.id !== id);
     draft.entities[index] = {
       ...draft.entities[index],

[NoCoverage] ObjectLiteral
src/store/reducers/todos.ts:22:29
   .addCase(TodosActions.updateEntity, (draft, action) => {
     const { id } = action.payload;
     const index = draft.entities.findIndex((todo) => todo.id === id);
-    draft.entities[index] = {
-      ...draft.entities[index],
-      ...action.payload,
-    };
+    draft.entities[index] = {};
   })
   .addCase(TodosActions.add, (draft, action) => {

[NoCoverage] BlockStatement
src/store/reducers/todos.ts:27:49
       ...action.payload,
     };
   })
-  .addCase(TodosActions.add, (draft, action) => {
-    const { id, columnId } = action.payload;
-
-    if (!draft.positions[columnId]) {
-      draft.positions[columnId] = [];
-    }
-
-    const isAlreadyExistId = draft.positions[columnId].includes(id);
-    if (!isAlreadyExistId) {
-      draft.entities.push(action.payload);
-      draft.positions[columnId].push(id);
-    }
-  })
+  .addCase(TodosActions.add, (draft, action) => {})
   .addCase(TodosActions.insertInPosition, (draft, action) => {
     const { position, entity } = action.payload;

[NoCoverage] BooleanLiteral
src/store/reducers/todos.ts:30:9
   .addCase(TodosActions.add, (draft, action) => {
     const { id, columnId } = action.payload;
 
-    if (!draft.positions[columnId]) {
+    if (draft.positions[columnId]) {
       draft.positions[columnId] = [];
     }

[NoCoverage] BlockStatement
src/store/reducers/todos.ts:30:37
   .addCase(TodosActions.add, (draft, action) => {
     const { id, columnId } = action.payload;
 
-    if (!draft.positions[columnId]) {
-      draft.positions[columnId] = [];
-    }
+    if (!draft.positions[columnId]) {}
 
     const isAlreadyExistId = draft.positions[columnId].includes(id);

[NoCoverage] ConditionalExpression
src/store/reducers/todos.ts:35:9
     }
 
     const isAlreadyExistId = draft.positions[columnId].includes(id);
-    if (!isAlreadyExistId) {
+    if (false) {
       draft.entities.push(action.payload);
       draft.positions[columnId].push(id);

[NoCoverage] ConditionalExpression
src/store/reducers/todos.ts:35:9
     }
 
     const isAlreadyExistId = draft.positions[columnId].includes(id);
-    if (!isAlreadyExistId) {
+    if (true) {
       draft.entities.push(action.payload);
       draft.positions[columnId].push(id);

[NoCoverage] BlockStatement
src/store/reducers/todos.ts:40:62
       draft.positions[columnId].push(id);
     }
   })
-  .addCase(TodosActions.insertInPosition, (draft, action) => {
-    const { position, entity } = action.payload;
-    const isAlreadyExistId = draft.positions[entity.columnId].includes(entity.id);
-    if (!isAlreadyExistId) {
-      draft.entities.push(entity);
-      draft.positions[entity.columnId].splice(position, 0, entity.id);
-    }
-  })
+  .addCase(TodosActions.insertInPosition, (draft, action) => {})
   .addCase(TodosActions.remove, (draft, action) => {
     const { id } = action.payload;

[NoCoverage] BooleanLiteral
src/store/reducers/todos.ts:43:9
   .addCase(TodosActions.insertInPosition, (draft, action) => {
     const { position, entity } = action.payload;
     const isAlreadyExistId = draft.positions[entity.columnId].includes(entity.id);
-    if (!isAlreadyExistId) {
+    if (isAlreadyExistId) {
       draft.entities.push(entity);
       draft.positions[entity.columnId].splice(position, 0, entity.id);

[NoCoverage] ConditionalExpression
src/store/reducers/todos.ts:43:9
   .addCase(TodosActions.insertInPosition, (draft, action) => {
     const { position, entity } = action.payload;
     const isAlreadyExistId = draft.positions[entity.columnId].includes(entity.id);
-    if (!isAlreadyExistId) {
+    if (false) {
       draft.entities.push(entity);
       draft.positions[entity.columnId].splice(position, 0, entity.id);

[NoCoverage] BlockStatement
src/store/reducers/todos.ts:48:52
       draft.positions[entity.columnId].splice(position, 0, entity.id);
     }
   })
-  .addCase(TodosActions.remove, (draft, action) => {
-    const { id } = action.payload;
-
-    const entityIndex = draft.entities.findIndex((column) => column.id === id);
-    if (entityIndex !== -1) {
-      const { columnId } = draft.entities[entityIndex];
-      draft.entities.splice(entityIndex, 1);
-
-      const positionIndex = draft.positions[columnId]?.findIndex((todoId) => todoId === id);
-      if (positionIndex !== -1) draft.positions[columnId]?.splice(positionIndex, 1);
-    }
-  })
+  .addCase(TodosActions.remove, (draft, action) => {})
   .addCase(TodosActions.drawBelow, (draft, action) => {
     const { belowId, columnId } = action.payload;

[NoCoverage] ConditionalExpression
src/store/reducers/todos.ts:51:62
   .addCase(TodosActions.remove, (draft, action) => {
     const { id } = action.payload;
 
-    const entityIndex = draft.entities.findIndex((column) => column.id === id);
+    const entityIndex = draft.entities.findIndex((column) => false);
     if (entityIndex !== -1) {
       const { columnId } = draft.entities[entityIndex];

[NoCoverage] EqualityOperator
src/store/reducers/todos.ts:51:62
   .addCase(TodosActions.remove, (draft, action) => {
     const { id } = action.payload;
 
-    const entityIndex = draft.entities.findIndex((column) => column.id === id);
+    const entityIndex = draft.entities.findIndex((column) => column.id !== id);
     if (entityIndex !== -1) {
       const { columnId } = draft.entities[entityIndex];

[NoCoverage] EqualityOperator
src/store/reducers/todos.ts:52:9
     const { id } = action.payload;
 
     const entityIndex = draft.entities.findIndex((column) => column.id === id);
-    if (entityIndex !== -1) {
+    if (entityIndex === -1) {
       const { columnId } = draft.entities[entityIndex];
       draft.entities.splice(entityIndex, 1);

[NoCoverage] BlockStatement
src/store/reducers/todos.ts:52:29
     const { id } = action.payload;
 
     const entityIndex = draft.entities.findIndex((column) => column.id === id);
-    if (entityIndex !== -1) {
-      const { columnId } = draft.entities[entityIndex];
-      draft.entities.splice(entityIndex, 1);
-
-      const positionIndex = draft.positions[columnId]?.findIndex((todoId) => todoId === id);
-      if (positionIndex !== -1) draft.positions[columnId]?.splice(positionIndex, 1);
-    }
+    if (entityIndex !== -1) {}
   })
   .addCase(TodosActions.drawBelow, (draft, action) => {

[NoCoverage] ConditionalExpression
src/store/reducers/todos.ts:56:78
       const { columnId } = draft.entities[entityIndex];
       draft.entities.splice(entityIndex, 1);
 
-      const positionIndex = draft.positions[columnId]?.findIndex((todoId) => todoId === id);
+      const positionIndex = draft.positions[columnId]?.findIndex((todoId) => false);
       if (positionIndex !== -1) draft.positions[columnId]?.splice(positionIndex, 1);
     }

[NoCoverage] ArrowFunction
src/store/reducers/todos.ts:56:66
       const { columnId } = draft.entities[entityIndex];
       draft.entities.splice(entityIndex, 1);
 
-      const positionIndex = draft.positions[columnId]?.findIndex((todoId) => todoId === id);
+      const positionIndex = draft.positions[columnId]?.findIndex(() => undefined);
       if (positionIndex !== -1) draft.positions[columnId]?.splice(positionIndex, 1);
     }

[NoCoverage] ConditionalExpression
src/store/reducers/todos.ts:57:11
       draft.entities.splice(entityIndex, 1);
 
       const positionIndex = draft.positions[columnId]?.findIndex((todoId) => todoId === id);
-      if (positionIndex !== -1) draft.positions[columnId]?.splice(positionIndex, 1);
+      if (true) draft.positions[columnId]?.splice(positionIndex, 1);
     }
   })

[NoCoverage] UnaryOperator
src/store/reducers/todos.ts:57:29
       draft.entities.splice(entityIndex, 1);
 
       const positionIndex = draft.positions[columnId]?.findIndex((todoId) => todoId === id);
-      if (positionIndex !== -1) draft.positions[columnId]?.splice(positionIndex, 1);
+      if (positionIndex !== +1) draft.positions[columnId]?.splice(positionIndex, 1);
     }
   })

[NoCoverage] BlockStatement
src/store/reducers/todos.ts:60:55
       if (positionIndex !== -1) draft.positions[columnId]?.splice(positionIndex, 1);
     }
   })
-  .addCase(TodosActions.drawBelow, (draft, action) => {
-    const { belowId, columnId } = action.payload;
-
-    const positionIndex = draft.positions[columnId].findIndex((todoId) => todoId === belowId);
-
-    draft.entities.push({
-      id: TEMP_ID,
-      columnId,
-      belowId,
-      title: '',
-      commentsCount: 0,
-      imagesCount: 0,
-      attachmentsCount: 0,
-    });
-
-    draft.positions[columnId].splice(positionIndex + 1, 0, TEMP_ID);
-  })
+  .addCase(TodosActions.drawBelow, (draft, action) => {})
   .addCase(TodosActions.move, (draft, action) => {
     const {

[NoCoverage] ArrowFunction
src/store/reducers/todos.ts:63:63
   .addCase(TodosActions.drawBelow, (draft, action) => {
     const { belowId, columnId } = action.payload;
 
-    const positionIndex = draft.positions[columnId].findIndex((todoId) => todoId === belowId);
+    const positionIndex = draft.positions[columnId].findIndex(() => undefined);
 
     draft.entities.push({

[NoCoverage] ConditionalExpression
src/store/reducers/todos.ts:63:75
   .addCase(TodosActions.drawBelow, (draft, action) => {
     const { belowId, columnId } = action.payload;
 
-    const positionIndex = draft.positions[columnId].findIndex((todoId) => todoId === belowId);
+    const positionIndex = draft.positions[columnId].findIndex((todoId) => true);
 
     draft.entities.push({

[NoCoverage] ObjectLiteral
src/store/reducers/todos.ts:65:25
 
     const positionIndex = draft.positions[columnId].findIndex((todoId) => todoId === belowId);
 
-    draft.entities.push({
-      id: TEMP_ID,
-      columnId,
-      belowId,
-      title: '',
-      commentsCount: 0,
-      imagesCount: 0,
-      attachmentsCount: 0,
-    });
+    draft.entities.push({});
 
     draft.positions[columnId].splice(positionIndex + 1, 0, TEMP_ID);

[NoCoverage] StringLiteral
src/store/reducers/todos.ts:69:14
       id: TEMP_ID,
       columnId,
       belowId,
-      title: '',
+      title: "Stryker was here!",
       commentsCount: 0,
       imagesCount: 0,

[NoCoverage] ArithmeticOperator
src/store/reducers/todos.ts:75:38
       attachmentsCount: 0,
     });
 
-    draft.positions[columnId].splice(positionIndex + 1, 0, TEMP_ID);
+    draft.positions[columnId].splice(positionIndex - 1, 0, TEMP_ID);
   })
   .addCase(TodosActions.move, (draft, action) => {

[NoCoverage] BlockStatement
src/store/reducers/todos.ts:77:50
 
     draft.positions[columnId].splice(positionIndex + 1, 0, TEMP_ID);
   })
-  .addCase(TodosActions.move, (draft, action) => {
-    const {
-      columnId, sourcePosition, destinationPosition, targetColumnId,
-    } = action.payload;
-
-    if (targetColumnId) {
-      const todoId = draft.positions[columnId][sourcePosition];
-      draft.entities[draft.entities.findIndex((todo) => todo.id === todoId)].columnId = targetColumnId;
-      draft.positions[columnId].splice(sourcePosition, 1);
-      if (draft.positions[targetColumnId]) {
-        draft.positions[targetColumnId].splice(destinationPosition, 0, todoId);
-      } else {
-        draft.positions[targetColumnId] = [];
-        draft.positions[targetColumnId].push(todoId);
-      }
-    } else {
-      draft.positions[columnId].splice(destinationPosition, 0, draft.positions[columnId].splice(sourcePosition, 1)[0]);
-    }
-  })
+  .addCase(TodosActions.move, (draft, action) => {})
   .addCase(TodosActions.removeTemp, (draft) => {
     const entityIndex = draft.entities.findIndex((todo) => todo.id === TEMP_ID);

[NoCoverage] BlockStatement
src/store/reducers/todos.ts:82:25
       columnId, sourcePosition, destinationPosition, targetColumnId,
     } = action.payload;
 
-    if (targetColumnId) {
-      const todoId = draft.positions[columnId][sourcePosition];
-      draft.entities[draft.entities.findIndex((todo) => todo.id === todoId)].columnId = targetColumnId;
-      draft.positions[columnId].splice(sourcePosition, 1);
-      if (draft.positions[targetColumnId]) {
-        draft.positions[targetColumnId].splice(destinationPosition, 0, todoId);
-      } else {
-        draft.positions[targetColumnId] = [];
-        draft.positions[targetColumnId].push(todoId);
-      }
-    } else {
+    if (targetColumnId) {} else {
       draft.positions[columnId].splice(destinationPosition, 0, draft.positions[columnId].splice(sourcePosition, 1)[0]);
     }

[NoCoverage] ConditionalExpression
src/store/reducers/todos.ts:82:9
       columnId, sourcePosition, destinationPosition, targetColumnId,
     } = action.payload;
 
-    if (targetColumnId) {
+    if (true) {
       const todoId = draft.positions[columnId][sourcePosition];
       draft.entities[draft.entities.findIndex((todo) => todo.id === todoId)].columnId = targetColumnId;

[NoCoverage] ConditionalExpression
src/store/reducers/todos.ts:84:57
 
     if (targetColumnId) {
       const todoId = draft.positions[columnId][sourcePosition];
-      draft.entities[draft.entities.findIndex((todo) => todo.id === todoId)].columnId = targetColumnId;
+      draft.entities[draft.entities.findIndex((todo) => false)].columnId = targetColumnId;
       draft.positions[columnId].splice(sourcePosition, 1);
       if (draft.positions[targetColumnId]) {

[NoCoverage] ConditionalExpression
src/store/reducers/todos.ts:84:57
 
     if (targetColumnId) {
       const todoId = draft.positions[columnId][sourcePosition];
-      draft.entities[draft.entities.findIndex((todo) => todo.id === todoId)].columnId = targetColumnId;
+      draft.entities[draft.entities.findIndex((todo) => true)].columnId = targetColumnId;
       draft.positions[columnId].splice(sourcePosition, 1);
       if (draft.positions[targetColumnId]) {

[NoCoverage] ConditionalExpression
src/store/reducers/todos.ts:86:11
       const todoId = draft.positions[columnId][sourcePosition];
       draft.entities[draft.entities.findIndex((todo) => todo.id === todoId)].columnId = targetColumnId;
       draft.positions[columnId].splice(sourcePosition, 1);
-      if (draft.positions[targetColumnId]) {
+      if (true) {
         draft.positions[targetColumnId].splice(destinationPosition, 0, todoId);
       } else {

[NoCoverage] ConditionalExpression
src/store/reducers/todos.ts:86:11
       const todoId = draft.positions[columnId][sourcePosition];
       draft.entities[draft.entities.findIndex((todo) => todo.id === todoId)].columnId = targetColumnId;
       draft.positions[columnId].splice(sourcePosition, 1);
-      if (draft.positions[targetColumnId]) {
+      if (false) {
         draft.positions[targetColumnId].splice(destinationPosition, 0, todoId);
       } else {

[NoCoverage] BlockStatement
src/store/reducers/todos.ts:88:14
       draft.positions[columnId].splice(sourcePosition, 1);
       if (draft.positions[targetColumnId]) {
         draft.positions[targetColumnId].splice(destinationPosition, 0, todoId);
-      } else {
-        draft.positions[targetColumnId] = [];
-        draft.positions[targetColumnId].push(todoId);
-      }
+      } else {}
     } else {
       draft.positions[columnId].splice(destinationPosition, 0, draft.positions[columnId].splice(sourcePosition, 1)[0]);

[NoCoverage] BlockStatement
src/store/reducers/todos.ts:92:12
         draft.positions[targetColumnId] = [];
         draft.positions[targetColumnId].push(todoId);
       }
-    } else {
-      draft.positions[columnId].splice(destinationPosition, 0, draft.positions[columnId].splice(sourcePosition, 1)[0]);
-    }
+    } else {}
   })
   .addCase(TodosActions.removeTemp, (draft) => {

[NoCoverage] BlockStatement
src/store/reducers/todos.ts:96:48
       draft.positions[columnId].splice(destinationPosition, 0, draft.positions[columnId].splice(sourcePosition, 1)[0]);
     }
   })
-  .addCase(TodosActions.removeTemp, (draft) => {
-    const entityIndex = draft.entities.findIndex((todo) => todo.id === TEMP_ID);
-    if (entityIndex !== -1) {
-      const { columnId } = draft.entities[entityIndex];
-      draft.entities.splice(entityIndex, 1);
-
-      const positionIndex = draft.positions[columnId].findIndex((todoId) => todoId === TEMP_ID);
-      if (positionIndex !== -1) draft.positions[columnId].splice(positionIndex, 1);
-    }
-  }));
+  .addCase(TodosActions.removeTemp, (draft) => {}));
 

[NoCoverage] ArrowFunction
src/store/reducers/todos.ts:97:50
     }
   })
   .addCase(TodosActions.removeTemp, (draft) => {
-    const entityIndex = draft.entities.findIndex((todo) => todo.id === TEMP_ID);
+    const entityIndex = draft.entities.findIndex(() => undefined);
     if (entityIndex !== -1) {
       const { columnId } = draft.entities[entityIndex];

[NoCoverage] ConditionalExpression
src/store/reducers/todos.ts:97:60
     }
   })
   .addCase(TodosActions.removeTemp, (draft) => {
-    const entityIndex = draft.entities.findIndex((todo) => todo.id === TEMP_ID);
+    const entityIndex = draft.entities.findIndex((todo) => true);
     if (entityIndex !== -1) {
       const { columnId } = draft.entities[entityIndex];

[NoCoverage] BlockStatement
src/store/reducers/todos.ts:98:29
   })
   .addCase(TodosActions.removeTemp, (draft) => {
     const entityIndex = draft.entities.findIndex((todo) => todo.id === TEMP_ID);
-    if (entityIndex !== -1) {
-      const { columnId } = draft.entities[entityIndex];
-      draft.entities.splice(entityIndex, 1);
-
-      const positionIndex = draft.positions[columnId].findIndex((todoId) => todoId === TEMP_ID);
-      if (positionIndex !== -1) draft.positions[columnId].splice(positionIndex, 1);
-    }
+    if (entityIndex !== -1) {}
   }));
 

[NoCoverage] ConditionalExpression
src/store/reducers/todos.ts:98:9
   })
   .addCase(TodosActions.removeTemp, (draft) => {
     const entityIndex = draft.entities.findIndex((todo) => todo.id === TEMP_ID);
-    if (entityIndex !== -1) {
+    if (false) {
       const { columnId } = draft.entities[entityIndex];
       draft.entities.splice(entityIndex, 1);

[NoCoverage] ConditionalExpression
src/store/reducers/todos.ts:102:77
       const { columnId } = draft.entities[entityIndex];
       draft.entities.splice(entityIndex, 1);
 
-      const positionIndex = draft.positions[columnId].findIndex((todoId) => todoId === TEMP_ID);
+      const positionIndex = draft.positions[columnId].findIndex((todoId) => true);
       if (positionIndex !== -1) draft.positions[columnId].splice(positionIndex, 1);
     }

[NoCoverage] EqualityOperator
src/store/reducers/todos.ts:102:77
       const { columnId } = draft.entities[entityIndex];
       draft.entities.splice(entityIndex, 1);
 
-      const positionIndex = draft.positions[columnId].findIndex((todoId) => todoId === TEMP_ID);
+      const positionIndex = draft.positions[columnId].findIndex((todoId) => todoId !== TEMP_ID);
       if (positionIndex !== -1) draft.positions[columnId].splice(positionIndex, 1);
     }

[NoCoverage] EqualityOperator
src/store/reducers/todos.ts:103:11
       draft.entities.splice(entityIndex, 1);
 
       const positionIndex = draft.positions[columnId].findIndex((todoId) => todoId === TEMP_ID);
-      if (positionIndex !== -1) draft.positions[columnId].splice(positionIndex, 1);
+      if (positionIndex === -1) draft.positions[columnId].splice(positionIndex, 1);
     }
   }));

[NoCoverage] UnaryOperator
src/store/reducers/todos.ts:103:29
       draft.entities.splice(entityIndex, 1);
 
       const positionIndex = draft.positions[columnId].findIndex((todoId) => todoId === TEMP_ID);
-      if (positionIndex !== -1) draft.positions[columnId].splice(positionIndex, 1);
+      if (positionIndex !== +1) draft.positions[columnId].splice(positionIndex, 1);
     }
   }));
