[NoCoverage] ObjectLiteral
src/store/reducers/user.ts:5:29
 import { IUser } from '@type/entities';
 import { UserActions } from '@store/actions';
 
-const initialState: IUser = {
-  email: null,
-  name: null,
-  surname: null,
-  username: null,
-  bio: null,
-  avatar: null,
-};
+const initialState: IUser = {};
 
 export const UserReducer = createReducer(initialState, (builder) => builder

[NoCoverage] ArrowFunction
src/store/reducers/user.ts:14:56
   avatar: null,
 };
 
-export const UserReducer = createReducer(initialState, (builder) => builder
-  .addCase(UserActions.setUserData, (draft, action) => action.payload)
-  .addCase(UserActions.setUsername, (draft, action) => { draft.username = action.payload.username; })
-  .addCase(UserActions.setEmail, (draft, action) => { draft.email = action.payload.email; })
-  .addCase(UserActions.setPersonalData, (draft, action) => {
-    draft.name = action.payload.name;
-    draft.surname = action.payload.surname;
-    draft.bio = action.payload.bio;
-  })
-  .addCase(UserActions.setAvatar, (draft, action) => { draft.avatar = action.payload.avatar; }));
+export const UserReducer = createReducer(initialState, () => undefined);
 

[NoCoverage] ArrowFunction
src/store/reducers/user.ts:15:37
 };
 
 export const UserReducer = createReducer(initialState, (builder) => builder
-  .addCase(UserActions.setUserData, (draft, action) => action.payload)
+  .addCase(UserActions.setUserData, () => undefined)
   .addCase(UserActions.setUsername, (draft, action) => { draft.username = action.payload.username; })
   .addCase(UserActions.setEmail, (draft, action) => { draft.email = action.payload.email; })

[NoCoverage] BlockStatement
src/store/reducers/user.ts:16:56
 
 export const UserReducer = createReducer(initialState, (builder) => builder
   .addCase(UserActions.setUserData, (draft, action) => action.payload)
-  .addCase(UserActions.setUsername, (draft, action) => { draft.username = action.payload.username; })
+  .addCase(UserActions.setUsername, (draft, action) => {})
   .addCase(UserActions.setEmail, (draft, action) => { draft.email = action.payload.email; })
   .addCase(UserActions.setPersonalData, (draft, action) => {

[NoCoverage] BlockStatement
src/store/reducers/user.ts:17:53
 export const UserReducer = createReducer(initialState, (builder) => builder
   .addCase(UserActions.setUserData, (draft, action) => action.payload)
   .addCase(UserActions.setUsername, (draft, action) => { draft.username = action.payload.username; })
-  .addCase(UserActions.setEmail, (draft, action) => { draft.email = action.payload.email; })
+  .addCase(UserActions.setEmail, (draft, action) => {})
   .addCase(UserActions.setPersonalData, (draft, action) => {
     draft.name = action.payload.name;

[NoCoverage] BlockStatement
src/store/reducers/user.ts:18:60
   .addCase(UserActions.setUserData, (draft, action) => action.payload)
   .addCase(UserActions.setUsername, (draft, action) => { draft.username = action.payload.username; })
   .addCase(UserActions.setEmail, (draft, action) => { draft.email = action.payload.email; })
-  .addCase(UserActions.setPersonalData, (draft, action) => {
-    draft.name = action.payload.name;
-    draft.surname = action.payload.surname;
-    draft.bio = action.payload.bio;
-  })
+  .addCase(UserActions.setPersonalData, (draft, action) => {})
   .addCase(UserActions.setAvatar, (draft, action) => { draft.avatar = action.payload.avatar; }));
 

[NoCoverage] BlockStatement
src/store/reducers/user.ts:23:54
     draft.surname = action.payload.surname;
     draft.bio = action.payload.bio;
   })
-  .addCase(UserActions.setAvatar, (draft, action) => { draft.avatar = action.payload.avatar; }));
+  .addCase(UserActions.setAvatar, (draft, action) => {}));
 
