[NoCoverage] BlockStatement
src/store/sagas/column.ts:27:79
 const { columnService } = container.get<IServices>(TYPES.Services);
 const { show, ALERT_TYPES } = useAlert();
 
-function* fetchByBoardIdWorker(action: PayloadAction<IFetchColumnsByBoardId>) {
-  try {
-    const response = yield* apply(columnService, columnService.getByBoardId, [action.payload]);
-    const { columns } = response.data;
-    yield put(ColumnsActions.setAll(columns));
-    yield put(SystemActions.setIsLoadedColumns(true));
-  } catch (error) {
-    yield call(show, i18n.t('Column'), error, ALERT_TYPES.DANGER);
-  }
-}
+function* fetchByBoardIdWorker(action: PayloadAction<IFetchColumnsByBoardId>) {}
 
 function* createWorker(action: PayloadAction<ICreateColumn>) {

[NoCoverage] BlockStatement
src/store/sagas/column.ts:28:7
 const { show, ALERT_TYPES } = useAlert();
 
 function* fetchByBoardIdWorker(action: PayloadAction<IFetchColumnsByBoardId>) {
-  try {
-    const response = yield* apply(columnService, columnService.getByBoardId, [action.payload]);
-    const { columns } = response.data;
-    yield put(ColumnsActions.setAll(columns));
-    yield put(SystemActions.setIsLoadedColumns(true));
-  } catch (error) {
+  try {} catch (error) {
     yield call(show, i18n.t('Column'), error, ALERT_TYPES.DANGER);
   }

[NoCoverage] BooleanLiteral
src/store/sagas/column.ts:32:48
     const response = yield* apply(columnService, columnService.getByBoardId, [action.payload]);
     const { columns } = response.data;
     yield put(ColumnsActions.setAll(columns));
-    yield put(SystemActions.setIsLoadedColumns(true));
+    yield put(SystemActions.setIsLoadedColumns(false));
   } catch (error) {
     yield call(show, i18n.t('Column'), error, ALERT_TYPES.DANGER);

[NoCoverage] BlockStatement
src/store/sagas/column.ts:33:19
     const { columns } = response.data;
     yield put(ColumnsActions.setAll(columns));
     yield put(SystemActions.setIsLoadedColumns(true));
-  } catch (error) {
-    yield call(show, i18n.t('Column'), error, ALERT_TYPES.DANGER);
-  }
+  } catch (error) {}
 }
 

[NoCoverage] BlockStatement
src/store/sagas/column.ts:38:62
   }
 }
 
-function* createWorker(action: PayloadAction<ICreateColumn>) {
-  try {
-    const { belowId, ...column } = action.payload;
-    const response = yield* apply(columnService, columnService.create, [action.payload]);
-    const { columnId, position } = response.data;
-    if (belowId) {
-      yield put(ColumnsActions.removeTemp());
-      yield put(ColumnsActions.insertInPosition({
-        entity: {
-          ...column,
-          id: columnId,
-        },
-        position,
-      }));
-    } else {
-      yield put(ColumnsActions.add({
-        ...action.payload,
-        id: columnId,
-      }));
-    }
-    yield call(show, i18n.t('Column'), i18n.t('Column created successfully'), ALERT_TYPES.SUCCESS);
-  } catch (error) {
-    yield call(show, i18n.t('Column'), error, ALERT_TYPES.DANGER);
-  }
-}
+function* createWorker(action: PayloadAction<ICreateColumn>) {}
 
 function* removeWorker(action: PayloadAction<IRemoveColumn>) {

[NoCoverage] BlockStatement
src/store/sagas/column.ts:39:7
 }
 
 function* createWorker(action: PayloadAction<ICreateColumn>) {
-  try {
-    const { belowId, ...column } = action.payload;
-    const response = yield* apply(columnService, columnService.create, [action.payload]);
-    const { columnId, position } = response.data;
-    if (belowId) {
-      yield put(ColumnsActions.removeTemp());
-      yield put(ColumnsActions.insertInPosition({
-        entity: {
-          ...column,
-          id: columnId,
-        },
-        position,
-      }));
-    } else {
-      yield put(ColumnsActions.add({
-        ...action.payload,
-        id: columnId,
-      }));
-    }
-    yield call(show, i18n.t('Column'), i18n.t('Column created successfully'), ALERT_TYPES.SUCCESS);
-  } catch (error) {
+  try {} catch (error) {
     yield call(show, i18n.t('Column'), error, ALERT_TYPES.DANGER);
   }

[NoCoverage] ArrayDeclaration
src/store/sagas/column.ts:41:72
 function* createWorker(action: PayloadAction<ICreateColumn>) {
   try {
     const { belowId, ...column } = action.payload;
-    const response = yield* apply(columnService, columnService.create, [action.payload]);
+    const response = yield* apply(columnService, columnService.create, []);
     const { columnId, position } = response.data;
     if (belowId) {

[NoCoverage] ConditionalExpression
src/store/sagas/column.ts:43:9
     const { belowId, ...column } = action.payload;
     const response = yield* apply(columnService, columnService.create, [action.payload]);
     const { columnId, position } = response.data;
-    if (belowId) {
+    if (false) {
       yield put(ColumnsActions.removeTemp());
       yield put(ColumnsActions.insertInPosition({

[NoCoverage] ConditionalExpression
src/store/sagas/column.ts:43:9
     const { belowId, ...column } = action.payload;
     const response = yield* apply(columnService, columnService.create, [action.payload]);
     const { columnId, position } = response.data;
-    if (belowId) {
+    if (true) {
       yield put(ColumnsActions.removeTemp());
       yield put(ColumnsActions.insertInPosition({

[NoCoverage] BlockStatement
src/store/sagas/column.ts:52:12
         },
         position,
       }));
-    } else {
-      yield put(ColumnsActions.add({
-        ...action.payload,
-        id: columnId,
-      }));
-    }
+    } else {}
     yield call(show, i18n.t('Column'), i18n.t('Column created successfully'), ALERT_TYPES.SUCCESS);
   } catch (error) {

[NoCoverage] StringLiteral
src/store/sagas/column.ts:58:47
         id: columnId,
       }));
     }
-    yield call(show, i18n.t('Column'), i18n.t('Column created successfully'), ALERT_TYPES.SUCCESS);
+    yield call(show, i18n.t('Column'), i18n.t(""), ALERT_TYPES.SUCCESS);
   } catch (error) {
     yield call(show, i18n.t('Column'), error, ALERT_TYPES.DANGER);

[NoCoverage] BlockStatement
src/store/sagas/column.ts:59:19
       }));
     }
     yield call(show, i18n.t('Column'), i18n.t('Column created successfully'), ALERT_TYPES.SUCCESS);
-  } catch (error) {
-    yield call(show, i18n.t('Column'), error, ALERT_TYPES.DANGER);
-  }
+  } catch (error) {}
 }
 

[NoCoverage] BlockStatement
src/store/sagas/column.ts:64:62
   }
 }
 
-function* removeWorker(action: PayloadAction<IRemoveColumn>) {
-  try {
-    yield put(ColumnsActions.remove(action.payload));
-    yield* apply(columnService, columnService.remove, [action.payload]);
-    yield call(show, i18n.t('Column'), i18n.t('Column removed successfully'), ALERT_TYPES.SUCCESS);
-  } catch (error) {
-    yield call(show, i18n.t('Column'), error, ALERT_TYPES.DANGER);
-  }
-}
+function* removeWorker(action: PayloadAction<IRemoveColumn>) {}
 
 function* updateWorker(action: PayloadAction<IUpdateColumn>) {

[NoCoverage] BlockStatement
src/store/sagas/column.ts:65:7
 }
 
 function* removeWorker(action: PayloadAction<IRemoveColumn>) {
-  try {
-    yield put(ColumnsActions.remove(action.payload));
-    yield* apply(columnService, columnService.remove, [action.payload]);
-    yield call(show, i18n.t('Column'), i18n.t('Column removed successfully'), ALERT_TYPES.SUCCESS);
-  } catch (error) {
+  try {} catch (error) {
     yield call(show, i18n.t('Column'), error, ALERT_TYPES.DANGER);
   }

[NoCoverage] StringLiteral
src/store/sagas/column.ts:68:47
   try {
     yield put(ColumnsActions.remove(action.payload));
     yield* apply(columnService, columnService.remove, [action.payload]);
-    yield call(show, i18n.t('Column'), i18n.t('Column removed successfully'), ALERT_TYPES.SUCCESS);
+    yield call(show, i18n.t('Column'), i18n.t(""), ALERT_TYPES.SUCCESS);
   } catch (error) {
     yield call(show, i18n.t('Column'), error, ALERT_TYPES.DANGER);

[NoCoverage] BlockStatement
src/store/sagas/column.ts:69:19
     yield put(ColumnsActions.remove(action.payload));
     yield* apply(columnService, columnService.remove, [action.payload]);
     yield call(show, i18n.t('Column'), i18n.t('Column removed successfully'), ALERT_TYPES.SUCCESS);
-  } catch (error) {
-    yield call(show, i18n.t('Column'), error, ALERT_TYPES.DANGER);
-  }
+  } catch (error) {}
 }
 

[NoCoverage] BlockStatement
src/store/sagas/column.ts:74:62
   }
 }
 
-function* updateWorker(action: PayloadAction<IUpdateColumn>) {
-  try {
-    yield put(ColumnsActions.updateEntity(action.payload));
-    yield* apply(columnService, columnService.update, [action.payload]);
-    yield call(show, i18n.t('Column'), i18n.t('Column updated successfully'), ALERT_TYPES.SUCCESS);
-  } catch (error) {
-    yield call(show, i18n.t('Column'), error, ALERT_TYPES.DANGER);
-  }
-}
+function* updateWorker(action: PayloadAction<IUpdateColumn>) {}
 
 function* moveWorker(action: PayloadAction<IMoveColumn>) {

[NoCoverage] BlockStatement
src/store/sagas/column.ts:75:7
 }
 
 function* updateWorker(action: PayloadAction<IUpdateColumn>) {
-  try {
-    yield put(ColumnsActions.updateEntity(action.payload));
-    yield* apply(columnService, columnService.update, [action.payload]);
-    yield call(show, i18n.t('Column'), i18n.t('Column updated successfully'), ALERT_TYPES.SUCCESS);
-  } catch (error) {
+  try {} catch (error) {
     yield call(show, i18n.t('Column'), error, ALERT_TYPES.DANGER);
   }

[NoCoverage] ArrayDeclaration
src/store/sagas/column.ts:77:55
 function* updateWorker(action: PayloadAction<IUpdateColumn>) {
   try {
     yield put(ColumnsActions.updateEntity(action.payload));
-    yield* apply(columnService, columnService.update, [action.payload]);
+    yield* apply(columnService, columnService.update, []);
     yield call(show, i18n.t('Column'), i18n.t('Column updated successfully'), ALERT_TYPES.SUCCESS);
   } catch (error) {

[NoCoverage] StringLiteral
src/store/sagas/column.ts:78:47
   try {
     yield put(ColumnsActions.updateEntity(action.payload));
     yield* apply(columnService, columnService.update, [action.payload]);
-    yield call(show, i18n.t('Column'), i18n.t('Column updated successfully'), ALERT_TYPES.SUCCESS);
+    yield call(show, i18n.t('Column'), i18n.t(""), ALERT_TYPES.SUCCESS);
   } catch (error) {
     yield call(show, i18n.t('Column'), error, ALERT_TYPES.DANGER);

[NoCoverage] StringLiteral
src/store/sagas/column.ts:78:29
   try {
     yield put(ColumnsActions.updateEntity(action.payload));
     yield* apply(columnService, columnService.update, [action.payload]);
-    yield call(show, i18n.t('Column'), i18n.t('Column updated successfully'), ALERT_TYPES.SUCCESS);
+    yield call(show, i18n.t(""), i18n.t('Column updated successfully'), ALERT_TYPES.SUCCESS);
   } catch (error) {
     yield call(show, i18n.t('Column'), error, ALERT_TYPES.DANGER);

[NoCoverage] BlockStatement
src/store/sagas/column.ts:79:19
     yield put(ColumnsActions.updateEntity(action.payload));
     yield* apply(columnService, columnService.update, [action.payload]);
     yield call(show, i18n.t('Column'), i18n.t('Column updated successfully'), ALERT_TYPES.SUCCESS);
-  } catch (error) {
-    yield call(show, i18n.t('Column'), error, ALERT_TYPES.DANGER);
-  }
+  } catch (error) {}
 }
 

[NoCoverage] BlockStatement
src/store/sagas/column.ts:84:58
   }
 }
 
-function* moveWorker(action: PayloadAction<IMoveColumn>) {
-  try {
-    yield put(ColumnsActions.move(action.payload));
-    yield* apply(columnService, columnService.updatePosition, [action.payload]);
-    yield call(show, i18n.t('Column'), i18n.t('Column position updated successfully'), ALERT_TYPES.SUCCESS);
-  } catch (error) {
-    yield call(show, i18n.t('Column'), error, ALERT_TYPES.DANGER);
-  }
-}
+function* moveWorker(action: PayloadAction<IMoveColumn>) {}
 
 function* duplicateWorker(action: PayloadAction<IDuplicateColumn>) {

[NoCoverage] BlockStatement
src/store/sagas/column.ts:85:7
 }
 
 function* moveWorker(action: PayloadAction<IMoveColumn>) {
-  try {
-    yield put(ColumnsActions.move(action.payload));
-    yield* apply(columnService, columnService.updatePosition, [action.payload]);
-    yield call(show, i18n.t('Column'), i18n.t('Column position updated successfully'), ALERT_TYPES.SUCCESS);
-  } catch (error) {
+  try {} catch (error) {
     yield call(show, i18n.t('Column'), error, ALERT_TYPES.DANGER);
   }

[NoCoverage] StringLiteral
src/store/sagas/column.ts:88:47
   try {
     yield put(ColumnsActions.move(action.payload));
     yield* apply(columnService, columnService.updatePosition, [action.payload]);
-    yield call(show, i18n.t('Column'), i18n.t('Column position updated successfully'), ALERT_TYPES.SUCCESS);
+    yield call(show, i18n.t('Column'), i18n.t(""), ALERT_TYPES.SUCCESS);
   } catch (error) {
     yield call(show, i18n.t('Column'), error, ALERT_TYPES.DANGER);

[NoCoverage] BlockStatement
src/store/sagas/column.ts:89:19
     yield put(ColumnsActions.move(action.payload));
     yield* apply(columnService, columnService.updatePosition, [action.payload]);
     yield call(show, i18n.t('Column'), i18n.t('Column position updated successfully'), ALERT_TYPES.SUCCESS);
-  } catch (error) {
-    yield call(show, i18n.t('Column'), error, ALERT_TYPES.DANGER);
-  }
+  } catch (error) {}
 }
 

[NoCoverage] StringLiteral
src/store/sagas/column.ts:90:29
     yield* apply(columnService, columnService.updatePosition, [action.payload]);
     yield call(show, i18n.t('Column'), i18n.t('Column position updated successfully'), ALERT_TYPES.SUCCESS);
   } catch (error) {
-    yield call(show, i18n.t('Column'), error, ALERT_TYPES.DANGER);
+    yield call(show, i18n.t(""), error, ALERT_TYPES.DANGER);
   }
 }

[NoCoverage] BlockStatement
src/store/sagas/column.ts:94:68
   }
 }
 
-function* duplicateWorker(action: PayloadAction<IDuplicateColumn>) {
-  try {
-    const response = yield* apply(columnService, columnService.duplicate, [action.payload]);
-    const { columnId, todos, ...column } = response.data;
-    yield put(ColumnsActions.insertInPosition({
-      entity: {
-        ...column,
-        id: columnId,
-      },
-      position: column.position,
-    }));
-    yield all(todos.entities.map((todo: ITodo) => put(TodosActions.add(todo))));
-    yield call(show, i18n.t('Column'), i18n.t('Column duplicated successfully'), ALERT_TYPES.SUCCESS);
-  } catch (error) {
-    yield call(show, i18n.t('Column'), error, ALERT_TYPES.DANGER);
-  }
-}
+function* duplicateWorker(action: PayloadAction<IDuplicateColumn>) {}
 
 function* reverseOrderWorker(action: PayloadAction<IReverseColumnOrder>) {

[NoCoverage] BlockStatement
src/store/sagas/column.ts:95:7
 }
 
 function* duplicateWorker(action: PayloadAction<IDuplicateColumn>) {
-  try {
-    const response = yield* apply(columnService, columnService.duplicate, [action.payload]);
-    const { columnId, todos, ...column } = response.data;
-    yield put(ColumnsActions.insertInPosition({
-      entity: {
-        ...column,
-        id: columnId,
-      },
-      position: column.position,
-    }));
-    yield all(todos.entities.map((todo: ITodo) => put(TodosActions.add(todo))));
-    yield call(show, i18n.t('Column'), i18n.t('Column duplicated successfully'), ALERT_TYPES.SUCCESS);
-  } catch (error) {
+  try {} catch (error) {
     yield call(show, i18n.t('Column'), error, ALERT_TYPES.DANGER);
   }

[NoCoverage] ObjectLiteral
src/store/sagas/column.ts:98:47
   try {
     const response = yield* apply(columnService, columnService.duplicate, [action.payload]);
     const { columnId, todos, ...column } = response.data;
-    yield put(ColumnsActions.insertInPosition({
-      entity: {
-        ...column,
-        id: columnId,
-      },
-      position: column.position,
-    }));
+    yield put(ColumnsActions.insertInPosition({}));
     yield all(todos.entities.map((todo: ITodo) => put(TodosActions.add(todo))));
     yield call(show, i18n.t('Column'), i18n.t('Column duplicated successfully'), ALERT_TYPES.SUCCESS);

[NoCoverage] ArrowFunction
src/store/sagas/column.ts:105:34
       },
       position: column.position,
     }));
-    yield all(todos.entities.map((todo: ITodo) => put(TodosActions.add(todo))));
+    yield all(todos.entities.map(() => undefined));
     yield call(show, i18n.t('Column'), i18n.t('Column duplicated successfully'), ALERT_TYPES.SUCCESS);
   } catch (error) {

[NoCoverage] BlockStatement
src/store/sagas/column.ts:107:19
     }));
     yield all(todos.entities.map((todo: ITodo) => put(TodosActions.add(todo))));
     yield call(show, i18n.t('Column'), i18n.t('Column duplicated successfully'), ALERT_TYPES.SUCCESS);
-  } catch (error) {
-    yield call(show, i18n.t('Column'), error, ALERT_TYPES.DANGER);
-  }
+  } catch (error) {}
 }
 

[NoCoverage] BlockStatement
src/store/sagas/column.ts:112:74
   }
 }
 
-function* reverseOrderWorker(action: PayloadAction<IReverseColumnOrder>) {
-  try {
-    yield put(ColumnsActions.reverseOrder(action.payload));
-    yield* apply(columnService, columnService.reverseOrder, [action.payload]);
-    yield call(show, i18n.t('Column'), i18n.t('Reverse successfully'), ALERT_TYPES.SUCCESS);
-  } catch (error) {
-    yield call(show, i18n.t('Column'), error, ALERT_TYPES.DANGER);
-  }
-}
+function* reverseOrderWorker(action: PayloadAction<IReverseColumnOrder>) {}
 
 export function* watchColumn() {

[NoCoverage] BlockStatement
src/store/sagas/column.ts:113:7
 }
 
 function* reverseOrderWorker(action: PayloadAction<IReverseColumnOrder>) {
-  try {
-    yield put(ColumnsActions.reverseOrder(action.payload));
-    yield* apply(columnService, columnService.reverseOrder, [action.payload]);
-    yield call(show, i18n.t('Column'), i18n.t('Reverse successfully'), ALERT_TYPES.SUCCESS);
-  } catch (error) {
+  try {} catch (error) {
     yield call(show, i18n.t('Column'), error, ALERT_TYPES.DANGER);
   }

[NoCoverage] BlockStatement
src/store/sagas/column.ts:117:19
     yield put(ColumnsActions.reverseOrder(action.payload));
     yield* apply(columnService, columnService.reverseOrder, [action.payload]);
     yield call(show, i18n.t('Column'), i18n.t('Reverse successfully'), ALERT_TYPES.SUCCESS);
-  } catch (error) {
-    yield call(show, i18n.t('Column'), error, ALERT_TYPES.DANGER);
-  }
+  } catch (error) {}
 }
 

[NoCoverage] BlockStatement
src/store/sagas/column.ts:122:32
   }
 }
 
-export function* watchColumn() {
-  yield all([
-    takeLatest(ColumnsActions.effect.fetchByBoardId, fetchByBoardIdWorker),
-    takeLatest(ColumnsActions.effect.create, createWorker),
-    takeLatest(ColumnsActions.effect.remove, removeWorker),
-    takeLatest(ColumnsActions.effect.update, updateWorker),
-    takeLatest(ColumnsActions.effect.move, moveWorker),
-    takeLatest(ColumnsActions.effect.duplicate, duplicateWorker),
-    takeLatest(ColumnsActions.effect.reverseOrder, reverseOrderWorker),
-  ]);
-}
+export function* watchColumn() {}
 
