[NoCoverage] BlockStatement
src/store/sagas/comment-attachments.ts:21:88
 const { commentAttachmentService } = container.get<IServices>(TYPES.Services);
 const { show, ALERT_TYPES } = useAlert();
 
-function* fetchByTodoIdWorker(action: PayloadAction<IFetchCommentAttachmentsByTodoId>) {
-  try {
-    const response = yield* apply(
-      commentAttachmentService, commentAttachmentService.getByTodoId, [action.payload],
-    );
-    const { attachments } = response.data;
-    yield put(CommentAttachmentsActions.merge(attachments));
-  } catch (error) {
-    yield call(show, i18n.t('Attachments'), error, ALERT_TYPES.DANGER);
-  }
-}
+function* fetchByTodoIdWorker(action: PayloadAction<IFetchCommentAttachmentsByTodoId>) {}
 
 function* uploadFilesWorker(action: PayloadAction<IUploadCommentAttachmentsFiles>) {

[NoCoverage] BlockStatement
src/store/sagas/comment-attachments.ts:22:7
 const { show, ALERT_TYPES } = useAlert();
 
 function* fetchByTodoIdWorker(action: PayloadAction<IFetchCommentAttachmentsByTodoId>) {
-  try {
-    const response = yield* apply(
-      commentAttachmentService, commentAttachmentService.getByTodoId, [action.payload],
-    );
-    const { attachments } = response.data;
-    yield put(CommentAttachmentsActions.merge(attachments));
-  } catch (error) {
+  try {} catch (error) {
     yield call(show, i18n.t('Attachments'), error, ALERT_TYPES.DANGER);
   }

[NoCoverage] ArrayDeclaration
src/store/sagas/comment-attachments.ts:24:71
 function* fetchByTodoIdWorker(action: PayloadAction<IFetchCommentAttachmentsByTodoId>) {
   try {
     const response = yield* apply(
-      commentAttachmentService, commentAttachmentService.getByTodoId, [action.payload],
+      commentAttachmentService, commentAttachmentService.getByTodoId, [],
     );
     const { attachments } = response.data;

[NoCoverage] BlockStatement
src/store/sagas/comment-attachments.ts:28:19
     );
     const { attachments } = response.data;
     yield put(CommentAttachmentsActions.merge(attachments));
-  } catch (error) {
-    yield call(show, i18n.t('Attachments'), error, ALERT_TYPES.DANGER);
-  }
+  } catch (error) {}
 }
 

[NoCoverage] BlockStatement
src/store/sagas/comment-attachments.ts:33:84
   }
 }
 
-function* uploadFilesWorker(action: PayloadAction<IUploadCommentAttachmentsFiles>) {
-  try {
-    const { files, commentId } = action.payload;
-    for (let i = 0; i < files.length; i += 1) { // TODO: foreach?
-      const file = files[i];
-      yield put(CommentAttachmentsActions.uploadFile({
-        commentId,
-        file,
-      }));
-    }
-  } catch (error) {
-    yield call(show, i18n.t('Attachments'), error, ALERT_TYPES.DANGER);
-  }
-}
+function* uploadFilesWorker(action: PayloadAction<IUploadCommentAttachmentsFiles>) {}
 
 function* uploadFileWorker(action: PayloadAction<IUploadCommentAttachmentsFile>) {

[NoCoverage] BlockStatement
src/store/sagas/comment-attachments.ts:34:7
 }
 
 function* uploadFilesWorker(action: PayloadAction<IUploadCommentAttachmentsFiles>) {
-  try {
-    const { files, commentId } = action.payload;
-    for (let i = 0; i < files.length; i += 1) { // TODO: foreach?
-      const file = files[i];
-      yield put(CommentAttachmentsActions.uploadFile({
-        commentId,
-        file,
-      }));
-    }
-  } catch (error) {
+  try {} catch (error) {
     yield call(show, i18n.t('Attachments'), error, ALERT_TYPES.DANGER);
   }

[NoCoverage] EqualityOperator
src/store/sagas/comment-attachments.ts:36:21
 function* uploadFilesWorker(action: PayloadAction<IUploadCommentAttachmentsFiles>) {
   try {
     const { files, commentId } = action.payload;
-    for (let i = 0; i < files.length; i += 1) { // TODO: foreach?
+    for (let i = 0; i >= files.length; i += 1) { // TODO: foreach?
       const file = files[i];
       yield put(CommentAttachmentsActions.uploadFile({

[NoCoverage] ConditionalExpression
src/store/sagas/comment-attachments.ts:36:21
 function* uploadFilesWorker(action: PayloadAction<IUploadCommentAttachmentsFiles>) {
   try {
     const { files, commentId } = action.payload;
-    for (let i = 0; i < files.length; i += 1) { // TODO: foreach?
+    for (let i = 0; false; i += 1) { // TODO: foreach?
       const file = files[i];
       yield put(CommentAttachmentsActions.uploadFile({

[NoCoverage] BlockStatement
src/store/sagas/comment-attachments.ts:43:19
         file,
       }));
     }
-  } catch (error) {
-    yield call(show, i18n.t('Attachments'), error, ALERT_TYPES.DANGER);
-  }
+  } catch (error) {}
 }
 

[NoCoverage] StringLiteral
src/store/sagas/comment-attachments.ts:44:29
       }));
     }
   } catch (error) {
-    yield call(show, i18n.t('Attachments'), error, ALERT_TYPES.DANGER);
+    yield call(show, i18n.t(""), error, ALERT_TYPES.DANGER);
   }
 }

[NoCoverage] BlockStatement
src/store/sagas/comment-attachments.ts:48:82
   }
 }
 
-function* uploadFileWorker(action: PayloadAction<IUploadCommentAttachmentsFile>) {
-  try {
-    const response = yield* apply(
-      commentAttachmentService, commentAttachmentService.uploadFile, [action.payload],
-    );
-    const { data } = response;
-    yield put(CommentAttachmentsActions.add(data));
-  } catch (error) {
-    yield call(show, i18n.t('Attachments'), error, ALERT_TYPES.DANGER);
-  }
-}
+function* uploadFileWorker(action: PayloadAction<IUploadCommentAttachmentsFile>) {}
 
 function* removeWorker(action: PayloadAction<IRemoveCommentAttachment>) {

[NoCoverage] BlockStatement
src/store/sagas/comment-attachments.ts:49:7
 }
 
 function* uploadFileWorker(action: PayloadAction<IUploadCommentAttachmentsFile>) {
-  try {
-    const response = yield* apply(
-      commentAttachmentService, commentAttachmentService.uploadFile, [action.payload],
-    );
-    const { data } = response;
-    yield put(CommentAttachmentsActions.add(data));
-  } catch (error) {
+  try {} catch (error) {
     yield call(show, i18n.t('Attachments'), error, ALERT_TYPES.DANGER);
   }

[NoCoverage] BlockStatement
src/store/sagas/comment-attachments.ts:55:19
     );
     const { data } = response;
     yield put(CommentAttachmentsActions.add(data));
-  } catch (error) {
-    yield call(show, i18n.t('Attachments'), error, ALERT_TYPES.DANGER);
-  }
+  } catch (error) {}
 }
 

[NoCoverage] BlockStatement
src/store/sagas/comment-attachments.ts:60:73
   }
 }
 
-function* removeWorker(action: PayloadAction<IRemoveCommentAttachment>) {
-  try {
-    yield* apply(commentAttachmentService, commentAttachmentService.remove, [action.payload]);
-    yield call(show, i18n.t('Attachments'), i18n.t('Attachment removed successfully'), ALERT_TYPES.SUCCESS);
-  } catch (error) {
-    yield call(show, i18n.t('Attachments'), error, ALERT_TYPES.DANGER);
-  }
-}
+function* removeWorker(action: PayloadAction<IRemoveCommentAttachment>) {}
 
 export function* watchCommentAttachments() {

[NoCoverage] BlockStatement
src/store/sagas/comment-attachments.ts:61:7
 }
 
 function* removeWorker(action: PayloadAction<IRemoveCommentAttachment>) {
-  try {
-    yield* apply(commentAttachmentService, commentAttachmentService.remove, [action.payload]);
-    yield call(show, i18n.t('Attachments'), i18n.t('Attachment removed successfully'), ALERT_TYPES.SUCCESS);
-  } catch (error) {
+  try {} catch (error) {
     yield call(show, i18n.t('Attachments'), error, ALERT_TYPES.DANGER);
   }

[NoCoverage] BlockStatement
src/store/sagas/comment-attachments.ts:64:19
   try {
     yield* apply(commentAttachmentService, commentAttachmentService.remove, [action.payload]);
     yield call(show, i18n.t('Attachments'), i18n.t('Attachment removed successfully'), ALERT_TYPES.SUCCESS);
-  } catch (error) {
-    yield call(show, i18n.t('Attachments'), error, ALERT_TYPES.DANGER);
-  }
+  } catch (error) {}
 }
 

[NoCoverage] BlockStatement
src/store/sagas/comment-attachments.ts:69:44
   }
 }
 
-export function* watchCommentAttachments() {
-  yield all([
-    takeLatest(CommentAttachmentsActions.fetchByTodoId, fetchByTodoIdWorker),
-    takeLatest(CommentAttachmentsActions.uploadFiles, uploadFilesWorker),
-    takeEvery(CommentAttachmentsActions.uploadFile, uploadFileWorker),
-    takeLatest(CommentAttachmentsActions.remove, removeWorker),
-  ]);
-}
+export function* watchCommentAttachments() {}
 
