[NoCoverage] BlockStatement
src/store/sagas/comments.ts:26:78
 const { commentService } = container.get<IServices>(TYPES.Services);
 const { show, ALERT_TYPES } = useAlert();
 
-function* fetchByTodoIdWorker(action: PayloadAction<IFetchCommentsByTodoId>) {
-  try {
-    const response = yield* apply(commentService, commentService.getByTodoId, [action.payload]);
-    const { comments } = response.data;
-    yield put(CommentsActions.setAll(comments));
-  } catch (error) {
-    yield call(show, i18n.t('Comment'), error, ALERT_TYPES.DANGER);
-  }
-}
+function* fetchByTodoIdWorker(action: PayloadAction<IFetchCommentsByTodoId>) {}
 
 function* createWorker(action: PayloadAction<ICreateComment>) {

[NoCoverage] BlockStatement
src/store/sagas/comments.ts:27:7
 const { show, ALERT_TYPES } = useAlert();
 
 function* fetchByTodoIdWorker(action: PayloadAction<IFetchCommentsByTodoId>) {
-  try {
-    const response = yield* apply(commentService, commentService.getByTodoId, [action.payload]);
-    const { comments } = response.data;
-    yield put(CommentsActions.setAll(comments));
-  } catch (error) {
+  try {} catch (error) {
     yield call(show, i18n.t('Comment'), error, ALERT_TYPES.DANGER);
   }

[NoCoverage] ArrayDeclaration
src/store/sagas/comments.ts:28:79
 
 function* fetchByTodoIdWorker(action: PayloadAction<IFetchCommentsByTodoId>) {
   try {
-    const response = yield* apply(commentService, commentService.getByTodoId, [action.payload]);
+    const response = yield* apply(commentService, commentService.getByTodoId, []);
     const { comments } = response.data;
     yield put(CommentsActions.setAll(comments));

[NoCoverage] BlockStatement
src/store/sagas/comments.ts:31:19
     const response = yield* apply(commentService, commentService.getByTodoId, [action.payload]);
     const { comments } = response.data;
     yield put(CommentsActions.setAll(comments));
-  } catch (error) {
-    yield call(show, i18n.t('Comment'), error, ALERT_TYPES.DANGER);
-  }
+  } catch (error) {}
 }
 

[NoCoverage] StringLiteral
src/store/sagas/comments.ts:32:29
     const { comments } = response.data;
     yield put(CommentsActions.setAll(comments));
   } catch (error) {
-    yield call(show, i18n.t('Comment'), error, ALERT_TYPES.DANGER);
+    yield call(show, i18n.t(""), error, ALERT_TYPES.DANGER);
   }
 }

[NoCoverage] BlockStatement
src/store/sagas/comments.ts:36:63
   }
 }
 
-function* createWorker(action: PayloadAction<ICreateComment>) {
-  try {
-    const { files, ...comment } = action.payload;
-    const response = yield* apply(commentService, commentService.create, [comment]);
-    const { commentId } = response.data;
-    yield put(CommentsActions.add({
-      ...action.payload,
-      id: commentId,
-    }));
-    if (files) {
-      yield put(CommentAttachmentsActions.uploadFiles({
-        commentId,
-        files,
-      }));
-    }
-    yield call(show, i18n.t('Comment'), i18n.t('Comment added successfully'), ALERT_TYPES.SUCCESS);
-  } catch (error) {
-    yield call(show, i18n.t('Comment'), error, ALERT_TYPES.DANGER);
-  }
-}
+function* createWorker(action: PayloadAction<ICreateComment>) {}
 
 function* removeWorker(action: PayloadAction<IRemoveComment>) {

[NoCoverage] BlockStatement
src/store/sagas/comments.ts:37:7
 }
 
 function* createWorker(action: PayloadAction<ICreateComment>) {
-  try {
-    const { files, ...comment } = action.payload;
-    const response = yield* apply(commentService, commentService.create, [comment]);
-    const { commentId } = response.data;
-    yield put(CommentsActions.add({
-      ...action.payload,
-      id: commentId,
-    }));
-    if (files) {
-      yield put(CommentAttachmentsActions.uploadFiles({
-        commentId,
-        files,
-      }));
-    }
-    yield call(show, i18n.t('Comment'), i18n.t('Comment added successfully'), ALERT_TYPES.SUCCESS);
-  } catch (error) {
+  try {} catch (error) {
     yield call(show, i18n.t('Comment'), error, ALERT_TYPES.DANGER);
   }

[NoCoverage] ObjectLiteral
src/store/sagas/comments.ts:41:35
     const { files, ...comment } = action.payload;
     const response = yield* apply(commentService, commentService.create, [comment]);
     const { commentId } = response.data;
-    yield put(CommentsActions.add({
-      ...action.payload,
-      id: commentId,
-    }));
+    yield put(CommentsActions.add({}));
     if (files) {
       yield put(CommentAttachmentsActions.uploadFiles({

[NoCoverage] ConditionalExpression
src/store/sagas/comments.ts:45:9
       ...action.payload,
       id: commentId,
     }));
-    if (files) {
+    if (false) {
       yield put(CommentAttachmentsActions.uploadFiles({
         commentId,

[NoCoverage] ObjectLiteral
src/store/sagas/comments.ts:46:55
       id: commentId,
     }));
     if (files) {
-      yield put(CommentAttachmentsActions.uploadFiles({
-        commentId,
-        files,
-      }));
+      yield put(CommentAttachmentsActions.uploadFiles({}));
     }
     yield call(show, i18n.t('Comment'), i18n.t('Comment added successfully'), ALERT_TYPES.SUCCESS);

[NoCoverage] StringLiteral
src/store/sagas/comments.ts:51:29
         files,
       }));
     }
-    yield call(show, i18n.t('Comment'), i18n.t('Comment added successfully'), ALERT_TYPES.SUCCESS);
+    yield call(show, i18n.t(""), i18n.t('Comment added successfully'), ALERT_TYPES.SUCCESS);
   } catch (error) {
     yield call(show, i18n.t('Comment'), error, ALERT_TYPES.DANGER);

[NoCoverage] BlockStatement
src/store/sagas/comments.ts:52:19
       }));
     }
     yield call(show, i18n.t('Comment'), i18n.t('Comment added successfully'), ALERT_TYPES.SUCCESS);
-  } catch (error) {
-    yield call(show, i18n.t('Comment'), error, ALERT_TYPES.DANGER);
-  }
+  } catch (error) {}
 }
 

[NoCoverage] BlockStatement
src/store/sagas/comments.ts:57:63
   }
 }
 
-function* removeWorker(action: PayloadAction<IRemoveComment>) {
-  try {
-    yield put(CommentsActions.remove(action.payload));
-    yield* apply(commentService, commentService.remove, [action.payload]);
-    yield call(show, i18n.t('Comment'), i18n.t('Comment removed successfully'), ALERT_TYPES.SUCCESS);
-  } catch (error) {
-    yield call(show, i18n.t('Comment'), error, ALERT_TYPES.DANGER);
-  }
-}
+function* removeWorker(action: PayloadAction<IRemoveComment>) {}
 
 function* updateWorker(action: PayloadAction<IUpdateCommentText>) {

[NoCoverage] BlockStatement
src/store/sagas/comments.ts:58:7
 }
 
 function* removeWorker(action: PayloadAction<IRemoveComment>) {
-  try {
-    yield put(CommentsActions.remove(action.payload));
-    yield* apply(commentService, commentService.remove, [action.payload]);
-    yield call(show, i18n.t('Comment'), i18n.t('Comment removed successfully'), ALERT_TYPES.SUCCESS);
-  } catch (error) {
+  try {} catch (error) {
     yield call(show, i18n.t('Comment'), error, ALERT_TYPES.DANGER);
   }

[NoCoverage] BlockStatement
src/store/sagas/comments.ts:62:19
     yield put(CommentsActions.remove(action.payload));
     yield* apply(commentService, commentService.remove, [action.payload]);
     yield call(show, i18n.t('Comment'), i18n.t('Comment removed successfully'), ALERT_TYPES.SUCCESS);
-  } catch (error) {
-    yield call(show, i18n.t('Comment'), error, ALERT_TYPES.DANGER);
-  }
+  } catch (error) {}
 }
 

[NoCoverage] BlockStatement
src/store/sagas/comments.ts:67:67
   }
 }
 
-function* updateWorker(action: PayloadAction<IUpdateCommentText>) {
-  try {
-    yield put(CommentsActions.updateText(action.payload));
-    yield* apply(commentService, commentService.update, [action.payload]);
-    yield call(show, i18n.t('Comment'), i18n.t('Comment updated successfully'), ALERT_TYPES.SUCCESS);
-  } catch (error) {
-    yield call(show, i18n.t('Comment'), error, ALERT_TYPES.DANGER);
-  }
-}
+function* updateWorker(action: PayloadAction<IUpdateCommentText>) {}
 
 function* addLikeWorker(action: PayloadAction<IAddCommentLike>) {

[NoCoverage] BlockStatement
src/store/sagas/comments.ts:68:7
 }
 
 function* updateWorker(action: PayloadAction<IUpdateCommentText>) {
-  try {
-    yield put(CommentsActions.updateText(action.payload));
-    yield* apply(commentService, commentService.update, [action.payload]);
-    yield call(show, i18n.t('Comment'), i18n.t('Comment updated successfully'), ALERT_TYPES.SUCCESS);
-  } catch (error) {
+  try {} catch (error) {
     yield call(show, i18n.t('Comment'), error, ALERT_TYPES.DANGER);
   }

[NoCoverage] BlockStatement
src/store/sagas/comments.ts:72:19
     yield put(CommentsActions.updateText(action.payload));
     yield* apply(commentService, commentService.update, [action.payload]);
     yield call(show, i18n.t('Comment'), i18n.t('Comment updated successfully'), ALERT_TYPES.SUCCESS);
-  } catch (error) {
-    yield call(show, i18n.t('Comment'), error, ALERT_TYPES.DANGER);
-  }
+  } catch (error) {}
 }
 

[NoCoverage] BlockStatement
src/store/sagas/comments.ts:77:65
   }
 }
 
-function* addLikeWorker(action: PayloadAction<IAddCommentLike>) {
-  try {
-    yield* apply(commentService, commentService.addLike, [action.payload]);
-    const { commentId } = action.payload;
-    const name = yield select(getName);
-    const surname = yield select(getSurname);
-    const username = yield select(getUsername);
-    const avatar = yield select(getAvatarUrl);
-    yield put(CommentsActions.updateLike({
-      commentId,
-      like: {
-        name,
-        surname,
-        username,
-        avatar,
-      },
-      isLiked: true,
-    }));
-  } catch (error) {
-    yield call(show, i18n.t('Comment'), error, ALERT_TYPES.DANGER);
-  }
-}
+function* addLikeWorker(action: PayloadAction<IAddCommentLike>) {}
 
 function* removeLikeWorker(action: PayloadAction<IRemoveCommentLike>) {

[NoCoverage] BlockStatement
src/store/sagas/comments.ts:78:7
 }
 
 function* addLikeWorker(action: PayloadAction<IAddCommentLike>) {
-  try {
-    yield* apply(commentService, commentService.addLike, [action.payload]);
-    const { commentId } = action.payload;
-    const name = yield select(getName);
-    const surname = yield select(getSurname);
-    const username = yield select(getUsername);
-    const avatar = yield select(getAvatarUrl);
-    yield put(CommentsActions.updateLike({
-      commentId,
-      like: {
-        name,
-        surname,
-        username,
-        avatar,
-      },
-      isLiked: true,
-    }));
-  } catch (error) {
+  try {} catch (error) {
     yield call(show, i18n.t('Comment'), error, ALERT_TYPES.DANGER);
   }

[NoCoverage] ObjectLiteral
src/store/sagas/comments.ts:85:42
     const surname = yield select(getSurname);
     const username = yield select(getUsername);
     const avatar = yield select(getAvatarUrl);
-    yield put(CommentsActions.updateLike({
-      commentId,
-      like: {
-        name,
-        surname,
-        username,
-        avatar,
-      },
-      isLiked: true,
-    }));
+    yield put(CommentsActions.updateLike({}));
   } catch (error) {
     yield call(show, i18n.t('Comment'), error, ALERT_TYPES.DANGER);

[NoCoverage] BooleanLiteral
src/store/sagas/comments.ts:93:16
         username,
         avatar,
       },
-      isLiked: true,
+      isLiked: false,
     }));
   } catch (error) {

[NoCoverage] BlockStatement
src/store/sagas/comments.ts:95:19
       },
       isLiked: true,
     }));
-  } catch (error) {
-    yield call(show, i18n.t('Comment'), error, ALERT_TYPES.DANGER);
-  }
+  } catch (error) {}
 }
 

[NoCoverage] BlockStatement
src/store/sagas/comments.ts:100:71
   }
 }
 
-function* removeLikeWorker(action: PayloadAction<IRemoveCommentLike>) {
-  try {
-    yield* apply(commentService, commentService.removeLike, [action.payload]);
-    const { commentId } = action.payload;
-    const name = yield select(getName);
-    const surname = yield select(getSurname);
-    const username = yield select(getUsername);
-    const avatar = yield select(getAvatarUrl);
-    yield put(CommentsActions.updateLike({
-      commentId,
-      like: {
-        name,
-        surname,
-        username,
-        avatar,
-      },
-      isLiked: false,
-    }));
-  } catch (error) {
-    yield call(show, i18n.t('Comment'), error, ALERT_TYPES.DANGER);
-  }
-}
+function* removeLikeWorker(action: PayloadAction<IRemoveCommentLike>) {}
 
 export function* watchComment() {

[NoCoverage] BlockStatement
src/store/sagas/comments.ts:101:7
 }
 
 function* removeLikeWorker(action: PayloadAction<IRemoveCommentLike>) {
-  try {
-    yield* apply(commentService, commentService.removeLike, [action.payload]);
-    const { commentId } = action.payload;
-    const name = yield select(getName);
-    const surname = yield select(getSurname);
-    const username = yield select(getUsername);
-    const avatar = yield select(getAvatarUrl);
-    yield put(CommentsActions.updateLike({
-      commentId,
-      like: {
-        name,
-        surname,
-        username,
-        avatar,
-      },
-      isLiked: false,
-    }));
-  } catch (error) {
+  try {} catch (error) {
     yield call(show, i18n.t('Comment'), error, ALERT_TYPES.DANGER);
   }

[NoCoverage] ArrayDeclaration
src/store/sagas/comments.ts:102:61
 
 function* removeLikeWorker(action: PayloadAction<IRemoveCommentLike>) {
   try {
-    yield* apply(commentService, commentService.removeLike, [action.payload]);
+    yield* apply(commentService, commentService.removeLike, []);
     const { commentId } = action.payload;
     const name = yield select(getName);

[NoCoverage] ObjectLiteral
src/store/sagas/comments.ts:110:13
     const avatar = yield select(getAvatarUrl);
     yield put(CommentsActions.updateLike({
       commentId,
-      like: {
-        name,
-        surname,
-        username,
-        avatar,
-      },
+      like: {},
       isLiked: false,
     }));

[NoCoverage] BooleanLiteral
src/store/sagas/comments.ts:116:16
         username,
         avatar,
       },
-      isLiked: false,
+      isLiked: true,
     }));
   } catch (error) {

[NoCoverage] BlockStatement
src/store/sagas/comments.ts:123:33
   }
 }
 
-export function* watchComment() {
-  yield all([
-    takeLatest(CommentsActions.effect.fetchByTodoId, fetchByTodoIdWorker),
-    takeLatest(CommentsActions.effect.create, createWorker),
-    takeLatest(CommentsActions.effect.remove, removeWorker),
-    takeLatest(CommentsActions.effect.updateText, updateWorker),
-    takeLeading(CommentsActions.effect.addLike, addLikeWorker),
-    takeLeading(CommentsActions.effect.removeLike, removeLikeWorker),
-  ]);
-}
+export function* watchComment() {}
 
