[NoCoverage] BlockStatement
src/store/sagas/index.ts:13:29
 import { watchSystem } from '@store/sagas/system';
 import { watchUpdate } from '@store/sagas/update';
 
-export function* rootSaga() {
-  yield all([
-    fork(watchAuth),
-    fork(watchUser),
-    fork(watchBoard),
-    fork(watchColumn),
-    fork(watchTodo),
-    fork(watchComment),
-    fork(watchCommentAttachments),
-    fork(watchSearch),
-    fork(watchSystem),
-    fork(watchUpdate),
-  ]);
-}
+export function* rootSaga() {}
 
