[NoCoverage] BlockStatement
src/store/sagas/search.ts:18:78
 const { searchService } = container.get<IServices>(TYPES.Services);
 const { show, ALERT_TYPES } = useAlert();
 
-function* searchByTodoTitleWorker(action: PayloadAction<ISearchByTodoTitle>) {
-  try {
-    const response = yield* apply(searchService, searchService.searchByTodoTitle, [action.payload]);
-    const { todos, columns, boards } = response.data;
-    yield put(BoardsActions.setAll(boards));
-    yield put(ColumnsActions.setAll(columns));
-    yield put(TodosActions.setAll(todos));
-    yield put(SystemActions.setIsSearchMode(true));
-  } catch (error) {
-    yield call(show, i18n.t('Search'), error, ALERT_TYPES.DANGER);
-  }
-}
+function* searchByTodoTitleWorker(action: PayloadAction<ISearchByTodoTitle>) {}
 
 export function* watchSearch() {

[NoCoverage] BlockStatement
src/store/sagas/search.ts:19:7
 const { show, ALERT_TYPES } = useAlert();
 
 function* searchByTodoTitleWorker(action: PayloadAction<ISearchByTodoTitle>) {
-  try {
-    const response = yield* apply(searchService, searchService.searchByTodoTitle, [action.payload]);
-    const { todos, columns, boards } = response.data;
-    yield put(BoardsActions.setAll(boards));
-    yield put(ColumnsActions.setAll(columns));
-    yield put(TodosActions.setAll(todos));
-    yield put(SystemActions.setIsSearchMode(true));
-  } catch (error) {
+  try {} catch (error) {
     yield call(show, i18n.t('Search'), error, ALERT_TYPES.DANGER);
   }

[NoCoverage] ArrayDeclaration
src/store/sagas/search.ts:20:83
 
 function* searchByTodoTitleWorker(action: PayloadAction<ISearchByTodoTitle>) {
   try {
-    const response = yield* apply(searchService, searchService.searchByTodoTitle, [action.payload]);
+    const response = yield* apply(searchService, searchService.searchByTodoTitle, []);
     const { todos, columns, boards } = response.data;
     yield put(BoardsActions.setAll(boards));

[NoCoverage] BooleanLiteral
src/store/sagas/search.ts:25:45
     yield put(BoardsActions.setAll(boards));
     yield put(ColumnsActions.setAll(columns));
     yield put(TodosActions.setAll(todos));
-    yield put(SystemActions.setIsSearchMode(true));
+    yield put(SystemActions.setIsSearchMode(false));
   } catch (error) {
     yield call(show, i18n.t('Search'), error, ALERT_TYPES.DANGER);

[NoCoverage] BlockStatement
src/store/sagas/search.ts:26:19
     yield put(ColumnsActions.setAll(columns));
     yield put(TodosActions.setAll(todos));
     yield put(SystemActions.setIsSearchMode(true));
-  } catch (error) {
-    yield call(show, i18n.t('Search'), error, ALERT_TYPES.DANGER);
-  }
+  } catch (error) {}
 }
 

[NoCoverage] BlockStatement
src/store/sagas/search.ts:31:32
   }
 }
 
-export function* watchSearch() {
-  yield all([
-    takeLatest(SearchActions.searchByTodoTitle, searchByTodoTitleWorker),
-  ]);
-}
+export function* watchSearch() {}
 

[NoCoverage] ArrayDeclaration
src/store/sagas/search.ts:32:13
 }
 
 export function* watchSearch() {
-  yield all([
-    takeLatest(SearchActions.searchByTodoTitle, searchByTodoTitleWorker),
-  ]);
+  yield all([]);
 }
 
