[NoCoverage] BlockStatement
src/store/sagas/system.ts:14:72
 
 const { show, ALERT_TYPES } = useAlert();
 
-function* setLanguageWorker(action: PayloadAction<ISetSystemLanguage>) {
-  try {
-    const languageCode = LANGUAGE_CODES[action.payload];
-    yield* apply(i18n, i18n.changeLanguage, [languageCode]);
-    yield* apply(storage, storage.setLanguage, [action.payload]);
-  } catch (error) {
-    yield call(show, i18n.t('System'), error, ALERT_TYPES.DANGER);
-  }
-}
+function* setLanguageWorker(action: PayloadAction<ISetSystemLanguage>) {}
 
 function* fetchLanguageWorker() {

[NoCoverage] BlockStatement
src/store/sagas/system.ts:15:7
 const { show, ALERT_TYPES } = useAlert();
 
 function* setLanguageWorker(action: PayloadAction<ISetSystemLanguage>) {
-  try {
-    const languageCode = LANGUAGE_CODES[action.payload];
-    yield* apply(i18n, i18n.changeLanguage, [languageCode]);
-    yield* apply(storage, storage.setLanguage, [action.payload]);
-  } catch (error) {
+  try {} catch (error) {
     yield call(show, i18n.t('System'), error, ALERT_TYPES.DANGER);
   }

[NoCoverage] ArrayDeclaration
src/store/sagas/system.ts:18:48
   try {
     const languageCode = LANGUAGE_CODES[action.payload];
     yield* apply(i18n, i18n.changeLanguage, [languageCode]);
-    yield* apply(storage, storage.setLanguage, [action.payload]);
+    yield* apply(storage, storage.setLanguage, []);
   } catch (error) {
     yield call(show, i18n.t('System'), error, ALERT_TYPES.DANGER);

[NoCoverage] BlockStatement
src/store/sagas/system.ts:19:19
     const languageCode = LANGUAGE_CODES[action.payload];
     yield* apply(i18n, i18n.changeLanguage, [languageCode]);
     yield* apply(storage, storage.setLanguage, [action.payload]);
-  } catch (error) {
-    yield call(show, i18n.t('System'), error, ALERT_TYPES.DANGER);
-  }
+  } catch (error) {}
 }
 

[NoCoverage] StringLiteral
src/store/sagas/system.ts:20:29
     yield* apply(i18n, i18n.changeLanguage, [languageCode]);
     yield* apply(storage, storage.setLanguage, [action.payload]);
   } catch (error) {
-    yield call(show, i18n.t('System'), error, ALERT_TYPES.DANGER);
+    yield call(show, i18n.t(""), error, ALERT_TYPES.DANGER);
   }
 }

[NoCoverage] BlockStatement
src/store/sagas/system.ts:24:33
   }
 }
 
-function* fetchLanguageWorker() {
-  try {
-    const language = yield* apply(storage, storage.getLanguage, []);
-    const normalizedLanguage = language || 0;
-    yield put(SystemActions.setLanguage(normalizedLanguage));
-  } catch (error) {
-    yield call(show, i18n.t('System'), error, ALERT_TYPES.DANGER);
-  }
-}
+function* fetchLanguageWorker() {}
 
 export function* watchSystem() {

[NoCoverage] BlockStatement
src/store/sagas/system.ts:25:7
 }
 
 function* fetchLanguageWorker() {
-  try {
-    const language = yield* apply(storage, storage.getLanguage, []);
-    const normalizedLanguage = language || 0;
-    yield put(SystemActions.setLanguage(normalizedLanguage));
-  } catch (error) {
+  try {} catch (error) {
     yield call(show, i18n.t('System'), error, ALERT_TYPES.DANGER);
   }

[NoCoverage] ArrayDeclaration
src/store/sagas/system.ts:26:65
 
 function* fetchLanguageWorker() {
   try {
-    const language = yield* apply(storage, storage.getLanguage, []);
+    const language = yield* apply(storage, storage.getLanguage, ["Stryker was here"]);
     const normalizedLanguage = language || 0;
     yield put(SystemActions.setLanguage(normalizedLanguage));

[NoCoverage] LogicalOperator
src/store/sagas/system.ts:27:32
 function* fetchLanguageWorker() {
   try {
     const language = yield* apply(storage, storage.getLanguage, []);
-    const normalizedLanguage = language || 0;
+    const normalizedLanguage = language && 0;
     yield put(SystemActions.setLanguage(normalizedLanguage));
   } catch (error) {

[NoCoverage] ConditionalExpression
src/store/sagas/system.ts:27:32
 function* fetchLanguageWorker() {
   try {
     const language = yield* apply(storage, storage.getLanguage, []);
-    const normalizedLanguage = language || 0;
+    const normalizedLanguage = true;
     yield put(SystemActions.setLanguage(normalizedLanguage));
   } catch (error) {

[NoCoverage] BlockStatement
src/store/sagas/system.ts:29:19
     const language = yield* apply(storage, storage.getLanguage, []);
     const normalizedLanguage = language || 0;
     yield put(SystemActions.setLanguage(normalizedLanguage));
-  } catch (error) {
-    yield call(show, i18n.t('System'), error, ALERT_TYPES.DANGER);
-  }
+  } catch (error) {}
 }
 

[NoCoverage] BlockStatement
src/store/sagas/system.ts:34:32
   }
 }
 
-export function* watchSystem() {
-  yield all([
-    takeLatest(SystemActions.setLanguage, setLanguageWorker),
-    takeLatest(SystemActions.fetchLanguage, fetchLanguageWorker),
-  ]);
-}
+export function* watchSystem() {}
 
