[NoCoverage] BlockStatement
src/store/sagas/todo.ts:23:77
 const { todoService } = container.get<IServices>(TYPES.Services);
 const { show, ALERT_TYPES } = useAlert();
 
-function* fetchByBoardIdWorker(action: PayloadAction<IFetchTodosByBoardId>) {
-  try {
-    const response = yield* apply(todoService, todoService.getByBoardId, [action.payload]);
-    const { todos } = response.data;
-    yield put(TodosActions.setAll(todos));
-    yield put(SystemActions.setIsLoadedTodos(true));
-  } catch (error) {
-    yield call(show, i18n.t('Todo'), error, ALERT_TYPES.DANGER);
-  }
-}
+function* fetchByBoardIdWorker(action: PayloadAction<IFetchTodosByBoardId>) {}
 
 function* fetchRemovedWorker() {

[NoCoverage] BlockStatement
src/store/sagas/todo.ts:24:7
 const { show, ALERT_TYPES } = useAlert();
 
 function* fetchByBoardIdWorker(action: PayloadAction<IFetchTodosByBoardId>) {
-  try {
-    const response = yield* apply(todoService, todoService.getByBoardId, [action.payload]);
-    const { todos } = response.data;
-    yield put(TodosActions.setAll(todos));
-    yield put(SystemActions.setIsLoadedTodos(true));
-  } catch (error) {
+  try {} catch (error) {
     yield call(show, i18n.t('Todo'), error, ALERT_TYPES.DANGER);
   }

[NoCoverage] BooleanLiteral
src/store/sagas/todo.ts:28:46
     const response = yield* apply(todoService, todoService.getByBoardId, [action.payload]);
     const { todos } = response.data;
     yield put(TodosActions.setAll(todos));
-    yield put(SystemActions.setIsLoadedTodos(true));
+    yield put(SystemActions.setIsLoadedTodos(false));
   } catch (error) {
     yield call(show, i18n.t('Todo'), error, ALERT_TYPES.DANGER);

[NoCoverage] BlockStatement
src/store/sagas/todo.ts:29:19
     const { todos } = response.data;
     yield put(TodosActions.setAll(todos));
     yield put(SystemActions.setIsLoadedTodos(true));
-  } catch (error) {
-    yield call(show, i18n.t('Todo'), error, ALERT_TYPES.DANGER);
-  }
+  } catch (error) {}
 }
 

[NoCoverage] BlockStatement
src/store/sagas/todo.ts:34:32
   }
 }
 
-function* fetchRemovedWorker() {
-  try {
-    const response = yield* apply(todoService, todoService.getRemoved, []);
-    const { todos } = response.data;
-    yield put(TodosActions.setAll(todos));
-    yield put(SystemActions.setIsLoadedColumns(true));
-    yield put(SystemActions.setIsLoadedTodos(true));
-  } catch (error) {
-    yield call(show, i18n.t('Todo'), error, ALERT_TYPES.DANGER);
-  }
-}
+function* fetchRemovedWorker() {}
 
 function* createWorker(action: PayloadAction<ICreateTodo>) {

[NoCoverage] BlockStatement
src/store/sagas/todo.ts:35:7
 }
 
 function* fetchRemovedWorker() {
-  try {
-    const response = yield* apply(todoService, todoService.getRemoved, []);
-    const { todos } = response.data;
-    yield put(TodosActions.setAll(todos));
-    yield put(SystemActions.setIsLoadedColumns(true));
-    yield put(SystemActions.setIsLoadedTodos(true));
-  } catch (error) {
+  try {} catch (error) {
     yield call(show, i18n.t('Todo'), error, ALERT_TYPES.DANGER);
   }

[NoCoverage] BooleanLiteral
src/store/sagas/todo.ts:39:48
     const response = yield* apply(todoService, todoService.getRemoved, []);
     const { todos } = response.data;
     yield put(TodosActions.setAll(todos));
-    yield put(SystemActions.setIsLoadedColumns(true));
+    yield put(SystemActions.setIsLoadedColumns(false));
     yield put(SystemActions.setIsLoadedTodos(true));
   } catch (error) {

[NoCoverage] BooleanLiteral
src/store/sagas/todo.ts:40:46
     const { todos } = response.data;
     yield put(TodosActions.setAll(todos));
     yield put(SystemActions.setIsLoadedColumns(true));
-    yield put(SystemActions.setIsLoadedTodos(true));
+    yield put(SystemActions.setIsLoadedTodos(false));
   } catch (error) {
     yield call(show, i18n.t('Todo'), error, ALERT_TYPES.DANGER);

[NoCoverage] ConditionalExpression
src/store/sagas/todo.ts:51:9
     const { belowId, files, ...entity } = action.payload;
     const response = yield* apply(todoService, todoService.create, [action.payload]);
     const { todoId, position } = response.data;
-    if (files?.length) {
+    if (false) {
       yield put(CommentsActions.effect.create({
         todoId,

[NoCoverage] BlockStatement
src/store/sagas/todo.ts:51:24
     const { belowId, files, ...entity } = action.payload;
     const response = yield* apply(todoService, todoService.create, [action.payload]);
     const { todoId, position } = response.data;
-    if (files?.length) {
-      yield put(CommentsActions.effect.create({
-        todoId,
-        text: '',
-        files,
-      }));
-    }
+    if (files?.length) {}
     if (belowId) {
       yield put(TodosActions.removeTemp());

[NoCoverage] StringLiteral
src/store/sagas/todo.ts:54:15
     if (files?.length) {
       yield put(CommentsActions.effect.create({
         todoId,
-        text: '',
+        text: "Stryker was here!",
         files,
       }));

[NoCoverage] ConditionalExpression
src/store/sagas/todo.ts:58:9
         files,
       }));
     }
-    if (belowId) {
+    if (true) {
       yield put(TodosActions.removeTemp());
       yield put(TodosActions.insertInPosition({

[NoCoverage] ConditionalExpression
src/store/sagas/todo.ts:58:9
         files,
       }));
     }
-    if (belowId) {
+    if (false) {
       yield put(TodosActions.removeTemp());
       yield put(TodosActions.insertInPosition({

[NoCoverage] ObjectLiteral
src/store/sagas/todo.ts:61:17
     if (belowId) {
       yield put(TodosActions.removeTemp());
       yield put(TodosActions.insertInPosition({
-        entity: {
-          ...entity,
-          id: todoId,
-          attachmentsCount: 0,
-          commentsCount: 0,
-          imagesCount: 0,
-        },
+        entity: {},
         position,
       }));

[NoCoverage] BlockStatement
src/store/sagas/todo.ts:70:12
         },
         position,
       }));
-    } else {
-      yield put(TodosActions.add({
-        ...entity,
-        id: todoId,
-        attachmentsCount: 0,
-        commentsCount: 0,
-        imagesCount: 0,
-      }));
-    }
+    } else {}
     yield call(show, i18n.t('Todo'), i18n.t('Todo created successfully'), ALERT_TYPES.SUCCESS);
   } catch (error) {

[NoCoverage] StringLiteral
src/store/sagas/todo.ts:79:29
         imagesCount: 0,
       }));
     }
-    yield call(show, i18n.t('Todo'), i18n.t('Todo created successfully'), ALERT_TYPES.SUCCESS);
+    yield call(show, i18n.t(""), i18n.t('Todo created successfully'), ALERT_TYPES.SUCCESS);
   } catch (error) {
     yield call(show, i18n.t('Todo'), error, ALERT_TYPES.DANGER);

[NoCoverage] BlockStatement
src/store/sagas/todo.ts:80:19
       }));
     }
     yield call(show, i18n.t('Todo'), i18n.t('Todo created successfully'), ALERT_TYPES.SUCCESS);
-  } catch (error) {
-    yield call(show, i18n.t('Todo'), error, ALERT_TYPES.DANGER);
-  }
+  } catch (error) {}
 }
 

[NoCoverage] StringLiteral
src/store/sagas/todo.ts:81:29
     }
     yield call(show, i18n.t('Todo'), i18n.t('Todo created successfully'), ALERT_TYPES.SUCCESS);
   } catch (error) {
-    yield call(show, i18n.t('Todo'), error, ALERT_TYPES.DANGER);
+    yield call(show, i18n.t(""), error, ALERT_TYPES.DANGER);
   }
 }

[NoCoverage] BlockStatement
src/store/sagas/todo.ts:85:60
   }
 }
 
-function* removeWorker(action: PayloadAction<IRemoveTodo>) {
-  try {
-    yield put(TodosActions.remove(action.payload));
-    yield* apply(todoService, todoService.remove, [action.payload]);
-    yield call(show, i18n.t('Todo'), i18n.t('Todo removed successfully'), ALERT_TYPES.SUCCESS);
-  } catch (error) {
-    yield call(show, i18n.t('Todo'), error, ALERT_TYPES.DANGER);
-  }
-}
+function* removeWorker(action: PayloadAction<IRemoveTodo>) {}
 
 function* updateWorker(action: PayloadAction<IUpdateTodo>) {

[NoCoverage] BlockStatement
src/store/sagas/todo.ts:86:7
 }
 
 function* removeWorker(action: PayloadAction<IRemoveTodo>) {
-  try {
-    yield put(TodosActions.remove(action.payload));
-    yield* apply(todoService, todoService.remove, [action.payload]);
-    yield call(show, i18n.t('Todo'), i18n.t('Todo removed successfully'), ALERT_TYPES.SUCCESS);
-  } catch (error) {
+  try {} catch (error) {
     yield call(show, i18n.t('Todo'), error, ALERT_TYPES.DANGER);
   }

[NoCoverage] BlockStatement
src/store/sagas/todo.ts:90:19
     yield put(TodosActions.remove(action.payload));
     yield* apply(todoService, todoService.remove, [action.payload]);
     yield call(show, i18n.t('Todo'), i18n.t('Todo removed successfully'), ALERT_TYPES.SUCCESS);
-  } catch (error) {
-    yield call(show, i18n.t('Todo'), error, ALERT_TYPES.DANGER);
-  }
+  } catch (error) {}
 }
 

[NoCoverage] BlockStatement
src/store/sagas/todo.ts:95:60
   }
 }
 
-function* updateWorker(action: PayloadAction<IUpdateTodo>) {
-  try {
-    yield put(TodosActions.updateEntity(action.payload));
-    yield* apply(todoService, todoService.update, [action.payload]);
-    yield call(show, i18n.t('Todo'), i18n.t('Todo updated successfully'), ALERT_TYPES.SUCCESS);
-  } catch (error) {
-    yield call(show, i18n.t('Todo'), error, ALERT_TYPES.DANGER);
-  }
-}
+function* updateWorker(action: PayloadAction<IUpdateTodo>) {}
 
 function* moveWorker(action: PayloadAction<IMoveTodo>) {

[NoCoverage] BlockStatement
src/store/sagas/todo.ts:96:7
 }
 
 function* updateWorker(action: PayloadAction<IUpdateTodo>) {
-  try {
-    yield put(TodosActions.updateEntity(action.payload));
-    yield* apply(todoService, todoService.update, [action.payload]);
-    yield call(show, i18n.t('Todo'), i18n.t('Todo updated successfully'), ALERT_TYPES.SUCCESS);
-  } catch (error) {
+  try {} catch (error) {
     yield call(show, i18n.t('Todo'), error, ALERT_TYPES.DANGER);
   }

[NoCoverage] ArrayDeclaration
src/store/sagas/todo.ts:98:51
 function* updateWorker(action: PayloadAction<IUpdateTodo>) {
   try {
     yield put(TodosActions.updateEntity(action.payload));
-    yield* apply(todoService, todoService.update, [action.payload]);
+    yield* apply(todoService, todoService.update, []);
     yield call(show, i18n.t('Todo'), i18n.t('Todo updated successfully'), ALERT_TYPES.SUCCESS);
   } catch (error) {

[NoCoverage] BlockStatement
src/store/sagas/todo.ts:100:19
     yield put(TodosActions.updateEntity(action.payload));
     yield* apply(todoService, todoService.update, [action.payload]);
     yield call(show, i18n.t('Todo'), i18n.t('Todo updated successfully'), ALERT_TYPES.SUCCESS);
-  } catch (error) {
-    yield call(show, i18n.t('Todo'), error, ALERT_TYPES.DANGER);
-  }
+  } catch (error) {}
 }
 

[NoCoverage] BlockStatement
src/store/sagas/todo.ts:105:56
   }
 }
 
-function* moveWorker(action: PayloadAction<IMoveTodo>) {
-  try {
-    yield put(TodosActions.move(action.payload));
-    yield* apply(todoService, todoService.updatePosition, [action.payload]);
-    yield call(show, i18n.t('Todo'), i18n.t('Todo position updated successfully'), ALERT_TYPES.SUCCESS);
-  } catch (error) {
-    yield call(show, i18n.t('Todo'), error, ALERT_TYPES.DANGER);
-  }
-}
+function* moveWorker(action: PayloadAction<IMoveTodo>) {}
 
 function* duplicateWorker(action: PayloadAction<IDuplicateTodo>) {

[NoCoverage] BlockStatement
src/store/sagas/todo.ts:106:7
 }
 
 function* moveWorker(action: PayloadAction<IMoveTodo>) {
-  try {
-    yield put(TodosActions.move(action.payload));
-    yield* apply(todoService, todoService.updatePosition, [action.payload]);
-    yield call(show, i18n.t('Todo'), i18n.t('Todo position updated successfully'), ALERT_TYPES.SUCCESS);
-  } catch (error) {
+  try {} catch (error) {
     yield call(show, i18n.t('Todo'), error, ALERT_TYPES.DANGER);
   }

[NoCoverage] ArrayDeclaration
src/store/sagas/todo.ts:108:59
 function* moveWorker(action: PayloadAction<IMoveTodo>) {
   try {
     yield put(TodosActions.move(action.payload));
-    yield* apply(todoService, todoService.updatePosition, [action.payload]);
+    yield* apply(todoService, todoService.updatePosition, []);
     yield call(show, i18n.t('Todo'), i18n.t('Todo position updated successfully'), ALERT_TYPES.SUCCESS);
   } catch (error) {

[NoCoverage] BlockStatement
src/store/sagas/todo.ts:110:19
     yield put(TodosActions.move(action.payload));
     yield* apply(todoService, todoService.updatePosition, [action.payload]);
     yield call(show, i18n.t('Todo'), i18n.t('Todo position updated successfully'), ALERT_TYPES.SUCCESS);
-  } catch (error) {
-    yield call(show, i18n.t('Todo'), error, ALERT_TYPES.DANGER);
-  }
+  } catch (error) {}
 }
 

[NoCoverage] BlockStatement
src/store/sagas/todo.ts:115:66
   }
 }
 
-function* duplicateWorker(action: PayloadAction<IDuplicateTodo>) {
-  try {
-    const response = yield* apply(todoService, todoService.duplicate, [action.payload]);
-    const { columnId, todoId, ...todo } = response.data;
-    yield put(TodosActions.insertInPosition({
-      entity: {
-        id: todoId,
-        columnId,
-        ...todo,
-        attachmentsCount: 0,
-        commentsCount: 0,
-        imagesCount: 0,
-      },
-      position: todo.position,
-    }));
-    yield call(show, i18n.t('Todo'), i18n.t('Todo duplicated successfully'), ALERT_TYPES.SUCCESS);
-  } catch (error) {
-    yield call(show, i18n.t('Todo'), error, ALERT_TYPES.DANGER);
-  }
-}
+function* duplicateWorker(action: PayloadAction<IDuplicateTodo>) {}
 
 export function* watchTodo() {

[NoCoverage] BlockStatement
src/store/sagas/todo.ts:116:7
 }
 
 function* duplicateWorker(action: PayloadAction<IDuplicateTodo>) {
-  try {
-    const response = yield* apply(todoService, todoService.duplicate, [action.payload]);
-    const { columnId, todoId, ...todo } = response.data;
-    yield put(TodosActions.insertInPosition({
-      entity: {
-        id: todoId,
-        columnId,
-        ...todo,
-        attachmentsCount: 0,
-        commentsCount: 0,
-        imagesCount: 0,
-      },
-      position: todo.position,
-    }));
-    yield call(show, i18n.t('Todo'), i18n.t('Todo duplicated successfully'), ALERT_TYPES.SUCCESS);
-  } catch (error) {
+  try {} catch (error) {
     yield call(show, i18n.t('Todo'), error, ALERT_TYPES.DANGER);
   }

[NoCoverage] ObjectLiteral
src/store/sagas/todo.ts:120:15
     const response = yield* apply(todoService, todoService.duplicate, [action.payload]);
     const { columnId, todoId, ...todo } = response.data;
     yield put(TodosActions.insertInPosition({
-      entity: {
-        id: todoId,
-        columnId,
-        ...todo,
-        attachmentsCount: 0,
-        commentsCount: 0,
-        imagesCount: 0,
-      },
+      entity: {},
       position: todo.position,
     }));

[NoCoverage] BlockStatement
src/store/sagas/todo.ts:131:19
       position: todo.position,
     }));
     yield call(show, i18n.t('Todo'), i18n.t('Todo duplicated successfully'), ALERT_TYPES.SUCCESS);
-  } catch (error) {
-    yield call(show, i18n.t('Todo'), error, ALERT_TYPES.DANGER);
-  }
+  } catch (error) {}
 }
 

[NoCoverage] BlockStatement
src/store/sagas/todo.ts:136:30
   }
 }
 
-export function* watchTodo() {
-  yield all([
-    takeLatest(TodosActions.effect.fetchByBoardId, fetchByBoardIdWorker),
-    takeLatest(TodosActions.effect.fetchRemoved, fetchRemovedWorker),
-    takeLatest(TodosActions.effect.create, createWorker),
-    takeLatest(TodosActions.effect.remove, removeWorker),
-    takeLatest(TodosActions.effect.update, updateWorker),
-    takeLatest(TodosActions.effect.move, moveWorker),
-    takeLatest(TodosActions.effect.duplicate, duplicateWorker),
-  ]);
-}
+export function* watchTodo() {}
 

[NoCoverage] ArrayDeclaration
src/store/sagas/todo.ts:137:13
 }
 
 export function* watchTodo() {
-  yield all([
-    takeLatest(TodosActions.effect.fetchByBoardId, fetchByBoardIdWorker),
-    takeLatest(TodosActions.effect.fetchRemoved, fetchRemovedWorker),
-    takeLatest(TodosActions.effect.create, createWorker),
-    takeLatest(TodosActions.effect.remove, removeWorker),
-    takeLatest(TodosActions.effect.update, updateWorker),
-    takeLatest(TodosActions.effect.move, moveWorker),
-    takeLatest(TodosActions.effect.duplicate, duplicateWorker),
-  ]);
+  yield all([]);
 }
 
