[NoCoverage] ConditionalExpression
src/store/sagas/update.ts:33:10
   subscribeFunction: () => Promise<IUpdateData<T>>,
   handlers: IOperationHandlers<T>,
 ) {
-  while (true) {
+  while (false) {
     const { operation, data } = yield* apply(context, subscribeFunction, []);
     console.log('>>>>update', data);

[NoCoverage] BlockStatement
src/store/sagas/update.ts:37:35
     const { operation, data } = yield* apply(context, subscribeFunction, []);
     console.log('>>>>update', data);
     switch (operation) {
-      case EnumOperations.Insert: {
-        if (handlers.insert) {
-          yield put(handlers.insert(data));
-        }
-        break;
-      }
+      case EnumOperations.Insert: {}
       case EnumOperations.Update: {
         if (handlers.update) {

[NoCoverage] ConditionalExpression
src/store/sagas/update.ts:37:7
     const { operation, data } = yield* apply(context, subscribeFunction, []);
     console.log('>>>>update', data);
     switch (operation) {
-      case EnumOperations.Insert: {
-        if (handlers.insert) {
-          yield put(handlers.insert(data));
-        }
-        break;
-      }
+      case EnumOperations.Insert:
       case EnumOperations.Update: {
         if (handlers.update) {

[NoCoverage] ConditionalExpression
src/store/sagas/update.ts:38:13
     console.log('>>>>update', data);
     switch (operation) {
       case EnumOperations.Insert: {
-        if (handlers.insert) {
+        if (true) {
           yield put(handlers.insert(data));
         }

[NoCoverage] BlockStatement
src/store/sagas/update.ts:38:30
     console.log('>>>>update', data);
     switch (operation) {
       case EnumOperations.Insert: {
-        if (handlers.insert) {
-          yield put(handlers.insert(data));
-        }
+        if (handlers.insert) {}
         break;
       }

[NoCoverage] ConditionalExpression
src/store/sagas/update.ts:43:7
         }
         break;
       }
-      case EnumOperations.Update: {
-        if (handlers.update) {
-          yield put(handlers.update(data));
-        }
-        break;
-      }
+      case EnumOperations.Update:
       case EnumOperations.Delete: {
         if (handlers.delete) {

[NoCoverage] BlockStatement
src/store/sagas/update.ts:43:35
         }
         break;
       }
-      case EnumOperations.Update: {
-        if (handlers.update) {
-          yield put(handlers.update(data));
-        }
-        break;
-      }
+      case EnumOperations.Update: {}
       case EnumOperations.Delete: {
         if (handlers.delete) {

[NoCoverage] BlockStatement
src/store/sagas/update.ts:44:30
         break;
       }
       case EnumOperations.Update: {
-        if (handlers.update) {
-          yield put(handlers.update(data));
-        }
+        if (handlers.update) {}
         break;
       }

[NoCoverage] ConditionalExpression
src/store/sagas/update.ts:44:13
         break;
       }
       case EnumOperations.Update: {
-        if (handlers.update) {
+        if (true) {
           yield put(handlers.update(data));
         }

[NoCoverage] ConditionalExpression
src/store/sagas/update.ts:49:7
         }
         break;
       }
-      case EnumOperations.Delete: {
-        if (handlers.delete) {
-          yield put(handlers.delete(data));
-        }
-        break;
-      }
+      case EnumOperations.Delete:
       default: break;
     }

[NoCoverage] BlockStatement
src/store/sagas/update.ts:49:35
         }
         break;
       }
-      case EnumOperations.Delete: {
-        if (handlers.delete) {
-          yield put(handlers.delete(data));
-        }
-        break;
-      }
+      case EnumOperations.Delete: {}
       default: break;
     }

[NoCoverage] ConditionalExpression
src/store/sagas/update.ts:50:13
         break;
       }
       case EnumOperations.Delete: {
-        if (handlers.delete) {
+        if (false) {
           yield put(handlers.delete(data));
         }

[NoCoverage] BlockStatement
src/store/sagas/update.ts:50:30
         break;
       }
       case EnumOperations.Delete: {
-        if (handlers.delete) {
-          yield put(handlers.delete(data));
-        }
+        if (handlers.delete) {}
         break;
       }

[NoCoverage] ArrayDeclaration
src/store/sagas/update.ts:62:60
 
 function* subscribeOnUpdatesWorker() {
   try {
-    yield* apply(updateService, updateService.openChannel, []);
+    yield* apply(updateService, updateService.openChannel, ["Stryker was here"]);
 
     yield* fork(() => subscribeOnEntity<IBoardUpdateData>(

[NoCoverage] ArrowFunction
src/store/sagas/update.ts:64:17
   try {
     yield* apply(updateService, updateService.openChannel, []);
 
-    yield* fork(() => subscribeOnEntity<IBoardUpdateData>(
-      updateService,
-      updateService.onBoardsUpdate, {
-        insert: BoardsActions.add,
-        update: BoardsActions.updateEntity,
-        delete: BoardsActions.remove,
-      },
-    ));
+    yield* fork(() => undefined);
     yield* fork(() => subscribeOnEntity<IColumnUpdateData>(
       updateService,

[NoCoverage] ArrowFunction
src/store/sagas/update.ts:72:17
         delete: BoardsActions.remove,
       },
     ));
-    yield* fork(() => subscribeOnEntity<IColumnUpdateData>(
-      updateService,
-      updateService.onColumnsUpdate, {
-        insert: ColumnsActions.add,
-        update: ColumnsActions.updateEntity,
-        delete: ColumnsActions.remove,
-      },
-    ));
+    yield* fork(() => undefined);
     yield* fork(() => subscribeOnEntity<ITodoUpdateData>(
       updateService, updateService.onTodosUpdate, {

[NoCoverage] ObjectLiteral
src/store/sagas/update.ts:74:38
     ));
     yield* fork(() => subscribeOnEntity<IColumnUpdateData>(
       updateService,
-      updateService.onColumnsUpdate, {
-        insert: ColumnsActions.add,
-        update: ColumnsActions.updateEntity,
-        delete: ColumnsActions.remove,
-      },
+      updateService.onColumnsUpdate, {},
     ));
     yield* fork(() => subscribeOnEntity<ITodoUpdateData>(

[NoCoverage] ArrowFunction
src/store/sagas/update.ts:80:17
         delete: ColumnsActions.remove,
       },
     ));
-    yield* fork(() => subscribeOnEntity<ITodoUpdateData>(
-      updateService, updateService.onTodosUpdate, {
-        insert: TodosActions.add,
-        update: TodosActions.updateEntity,
-        delete: TodosActions.remove,
-      },
-    ));
+    yield* fork(() => undefined);
     yield* fork(() => subscribeOnEntity<IBoardPositionsUpdateData>(
       updateService,

[NoCoverage] ObjectLiteral
src/store/sagas/update.ts:81:51
       },
     ));
     yield* fork(() => subscribeOnEntity<ITodoUpdateData>(
-      updateService, updateService.onTodosUpdate, {
-        insert: TodosActions.add,
-        update: TodosActions.updateEntity,
-        delete: TodosActions.remove,
-      },
+      updateService, updateService.onTodosUpdate, {},
     ));
     yield* fork(() => subscribeOnEntity<IBoardPositionsUpdateData>(

[NoCoverage] ArrowFunction
src/store/sagas/update.ts:87:17
         delete: TodosActions.remove,
       },
     ));
-    yield* fork(() => subscribeOnEntity<IBoardPositionsUpdateData>(
-      updateService,
-      updateService.onBoardPositionsUpdate, {
-        update: (data) => BoardsActions.setPositions(data.order),
-      },
-    ));
+    yield* fork(() => undefined);
     yield* fork(() => subscribeOnEntity<IColumnPositionsUpdateData>(
       updateService,

[NoCoverage] ArrowFunction
src/store/sagas/update.ts:90:17
     yield* fork(() => subscribeOnEntity<IBoardPositionsUpdateData>(
       updateService,
       updateService.onBoardPositionsUpdate, {
-        update: (data) => BoardsActions.setPositions(data.order),
+        update: () => undefined,
       },
     ));

[NoCoverage] ArrowFunction
src/store/sagas/update.ts:93:17
         update: (data) => BoardsActions.setPositions(data.order),
       },
     ));
-    yield* fork(() => subscribeOnEntity<IColumnPositionsUpdateData>(
-      updateService,
-      updateService.onColumnPositionsUpdate, {
-        insert: (data) => ColumnsActions.setPositionsByBoardId({
-          positions: data.order,
-          boardId: data.boardId,
-        }),
-        update: (data) => ColumnsActions.setPositionsByBoardId({
-          positions: data.order,
-          boardId: data.boardId,
-        }),
-      },
-    ));
+    yield* fork(() => undefined);
     yield* fork(() => subscribeOnEntity<ITodoPositionsUpdateData>(
       updateService,

[NoCoverage] ArrowFunction
src/store/sagas/update.ts:96:17
     yield* fork(() => subscribeOnEntity<IColumnPositionsUpdateData>(
       updateService,
       updateService.onColumnPositionsUpdate, {
-        insert: (data) => ColumnsActions.setPositionsByBoardId({
-          positions: data.order,
-          boardId: data.boardId,
-        }),
+        insert: () => undefined,
         update: (data) => ColumnsActions.setPositionsByBoardId({
           positions: data.order,

[NoCoverage] ArrowFunction
src/store/sagas/update.ts:100:17
           positions: data.order,
           boardId: data.boardId,
         }),
-        update: (data) => ColumnsActions.setPositionsByBoardId({
-          positions: data.order,
-          boardId: data.boardId,
-        }),
+        update: () => undefined,
       },
     ));

[NoCoverage] ArrowFunction
src/store/sagas/update.ts:106:17
         }),
       },
     ));
-    yield* fork(() => subscribeOnEntity<ITodoPositionsUpdateData>(
-      updateService,
-      updateService.onTodoPositionsUpdate, {
-        insert: (data) => TodosActions.setPositionsByColumnId({
-          positions: data.order,
-          columnId: data.columnId,
-        }),
-        update: (data) => TodosActions.setPositionsByColumnId({
-          positions: data.order,
-          columnId: data.columnId,
-        }),
-      },
-    ));
+    yield* fork(() => undefined);
     yield* fork(() => subscribeOnEntity<ICommentUpdateData>(
       updateService,

[NoCoverage] ArrowFunction
src/store/sagas/update.ts:109:17
     yield* fork(() => subscribeOnEntity<ITodoPositionsUpdateData>(
       updateService,
       updateService.onTodoPositionsUpdate, {
-        insert: (data) => TodosActions.setPositionsByColumnId({
-          positions: data.order,
-          columnId: data.columnId,
-        }),
+        insert: () => undefined,
         update: (data) => TodosActions.setPositionsByColumnId({
           positions: data.order,

[NoCoverage] ArrowFunction
src/store/sagas/update.ts:113:17
           positions: data.order,
           columnId: data.columnId,
         }),
-        update: (data) => TodosActions.setPositionsByColumnId({
-          positions: data.order,
-          columnId: data.columnId,
-        }),
+        update: () => undefined,
       },
     ));

[NoCoverage] ArrowFunction
src/store/sagas/update.ts:119:17
         }),
       },
     ));
-    yield* fork(() => subscribeOnEntity<ICommentUpdateData>(
-      updateService,
-      updateService.onCommentsUpdate, {
-        insert: CommentsActions.add,
-        update: CommentsActions.updateText,
-        delete: CommentsActions.remove,
-      },
-    ));
+    yield* fork(() => undefined);
   } catch (error) {
     console.error(error);

[NoCoverage] BlockStatement
src/store/sagas/update.ts:127:19
         delete: CommentsActions.remove,
       },
     ));
-  } catch (error) {
-    console.error(error);
-  }
+  } catch (error) {}
 }
 

[NoCoverage] BlockStatement
src/store/sagas/update.ts:132:32
   }
 }
 
-export function* watchUpdate() {
-  yield all([
-    takeLatest(UpdatesActions.subscribe, subscribeOnUpdatesWorker),
-  ]);
-}
+export function* watchUpdate() {}
 
