[NoCoverage] BlockStatement
src/store/sagas/user.ts:18:27
 const { userService } = container.get<IServices>(TYPES.Services);
 const { show, ALERT_TYPES } = useAlert();
 
-function* fetchMeWorker() {
-  try {
-    const response = yield* apply(userService, userService.getMe, []);
-    const { data } = response;
-    yield put(UserActions.setUserData(data));
-  } catch (error) {
-    yield call(show, i18n.t('User'), error, ALERT_TYPES.DANGER);
-  }
-}
+function* fetchMeWorker() {}
 
 function* updateUsernameWorker(action: PayloadAction<IUpdateUsername>) {

[NoCoverage] BlockStatement
src/store/sagas/user.ts:19:7
 const { show, ALERT_TYPES } = useAlert();
 
 function* fetchMeWorker() {
-  try {
-    const response = yield* apply(userService, userService.getMe, []);
-    const { data } = response;
-    yield put(UserActions.setUserData(data));
-  } catch (error) {
+  try {} catch (error) {
     yield call(show, i18n.t('User'), error, ALERT_TYPES.DANGER);
   }

[NoCoverage] ArrayDeclaration
src/store/sagas/user.ts:20:67
 
 function* fetchMeWorker() {
   try {
-    const response = yield* apply(userService, userService.getMe, []);
+    const response = yield* apply(userService, userService.getMe, ["Stryker was here"]);
     const { data } = response;
     yield put(UserActions.setUserData(data));

[NoCoverage] BlockStatement
src/store/sagas/user.ts:23:19
     const response = yield* apply(userService, userService.getMe, []);
     const { data } = response;
     yield put(UserActions.setUserData(data));
-  } catch (error) {
-    yield call(show, i18n.t('User'), error, ALERT_TYPES.DANGER);
-  }
+  } catch (error) {}
 }
 

[NoCoverage] BlockStatement
src/store/sagas/user.ts:28:72
   }
 }
 
-function* updateUsernameWorker(action: PayloadAction<IUpdateUsername>) {
-  try {
-    yield* apply(userService, userService.update, [action.payload]);
-    yield put(UserActions.setUsername(action.payload.username));
-    yield call(show, i18n.t('User'), i18n.t('Username updated successfully'), ALERT_TYPES.SUCCESS);
-  } catch (error) {
-    yield call(show, i18n.t('User'), error, ALERT_TYPES.DANGER);
-  }
-}
+function* updateUsernameWorker(action: PayloadAction<IUpdateUsername>) {}
 
 function* updateEmailWorker(action: PayloadAction<IUpdateEmail>) {

[NoCoverage] BlockStatement
src/store/sagas/user.ts:29:7
 }
 
 function* updateUsernameWorker(action: PayloadAction<IUpdateUsername>) {
-  try {
-    yield* apply(userService, userService.update, [action.payload]);
-    yield put(UserActions.setUsername(action.payload.username));
-    yield call(show, i18n.t('User'), i18n.t('Username updated successfully'), ALERT_TYPES.SUCCESS);
-  } catch (error) {
+  try {} catch (error) {
     yield call(show, i18n.t('User'), error, ALERT_TYPES.DANGER);
   }

[NoCoverage] StringLiteral
src/store/sagas/user.ts:32:45
   try {
     yield* apply(userService, userService.update, [action.payload]);
     yield put(UserActions.setUsername(action.payload.username));
-    yield call(show, i18n.t('User'), i18n.t('Username updated successfully'), ALERT_TYPES.SUCCESS);
+    yield call(show, i18n.t('User'), i18n.t(""), ALERT_TYPES.SUCCESS);
   } catch (error) {
     yield call(show, i18n.t('User'), error, ALERT_TYPES.DANGER);

[NoCoverage] BlockStatement
src/store/sagas/user.ts:33:19
     yield* apply(userService, userService.update, [action.payload]);
     yield put(UserActions.setUsername(action.payload.username));
     yield call(show, i18n.t('User'), i18n.t('Username updated successfully'), ALERT_TYPES.SUCCESS);
-  } catch (error) {
-    yield call(show, i18n.t('User'), error, ALERT_TYPES.DANGER);
-  }
+  } catch (error) {}
 }
 

[NoCoverage] BlockStatement
src/store/sagas/user.ts:38:66
   }
 }
 
-function* updateEmailWorker(action: PayloadAction<IUpdateEmail>) {
-  try {
-    yield* apply(userService, userService.update, [action.payload]);
-    yield put(UserActions.setEmail(action.payload.email));
-    yield call(show, i18n.t('User'), i18n.t('Email updated successfully'), ALERT_TYPES.SUCCESS);
-  } catch (error) {
-    yield call(show, i18n.t('User'), error, ALERT_TYPES.DANGER);
-  }
-}
+function* updateEmailWorker(action: PayloadAction<IUpdateEmail>) {}
 
 function* updatePersonalDataWorker(action: PayloadAction<IUpdatePersonalData>) {

[NoCoverage] BlockStatement
src/store/sagas/user.ts:39:7
 }
 
 function* updateEmailWorker(action: PayloadAction<IUpdateEmail>) {
-  try {
-    yield* apply(userService, userService.update, [action.payload]);
-    yield put(UserActions.setEmail(action.payload.email));
-    yield call(show, i18n.t('User'), i18n.t('Email updated successfully'), ALERT_TYPES.SUCCESS);
-  } catch (error) {
+  try {} catch (error) {
     yield call(show, i18n.t('User'), error, ALERT_TYPES.DANGER);
   }

[NoCoverage] StringLiteral
src/store/sagas/user.ts:42:29
   try {
     yield* apply(userService, userService.update, [action.payload]);
     yield put(UserActions.setEmail(action.payload.email));
-    yield call(show, i18n.t('User'), i18n.t('Email updated successfully'), ALERT_TYPES.SUCCESS);
+    yield call(show, i18n.t(""), i18n.t('Email updated successfully'), ALERT_TYPES.SUCCESS);
   } catch (error) {
     yield call(show, i18n.t('User'), error, ALERT_TYPES.DANGER);

[NoCoverage] StringLiteral
src/store/sagas/user.ts:42:45
   try {
     yield* apply(userService, userService.update, [action.payload]);
     yield put(UserActions.setEmail(action.payload.email));
-    yield call(show, i18n.t('User'), i18n.t('Email updated successfully'), ALERT_TYPES.SUCCESS);
+    yield call(show, i18n.t('User'), i18n.t(""), ALERT_TYPES.SUCCESS);
   } catch (error) {
     yield call(show, i18n.t('User'), error, ALERT_TYPES.DANGER);

[NoCoverage] BlockStatement
src/store/sagas/user.ts:43:19
     yield* apply(userService, userService.update, [action.payload]);
     yield put(UserActions.setEmail(action.payload.email));
     yield call(show, i18n.t('User'), i18n.t('Email updated successfully'), ALERT_TYPES.SUCCESS);
-  } catch (error) {
-    yield call(show, i18n.t('User'), error, ALERT_TYPES.DANGER);
-  }
+  } catch (error) {}
 }
 

[NoCoverage] StringLiteral
src/store/sagas/user.ts:44:29
     yield put(UserActions.setEmail(action.payload.email));
     yield call(show, i18n.t('User'), i18n.t('Email updated successfully'), ALERT_TYPES.SUCCESS);
   } catch (error) {
-    yield call(show, i18n.t('User'), error, ALERT_TYPES.DANGER);
+    yield call(show, i18n.t(""), error, ALERT_TYPES.DANGER);
   }
 }

[NoCoverage] BlockStatement
src/store/sagas/user.ts:48:80
   }
 }
 
-function* updatePersonalDataWorker(action: PayloadAction<IUpdatePersonalData>) {
-  try {
-    yield* apply(userService, userService.update, [action.payload]);
-    const { name, surname, bio } = action.payload;
-    yield put(UserActions.setPersonalData({
-      name: name!,
-      surname: surname!,
-      bio: bio!,
-    }));
-    yield call(
-      show, i18n.t('User'), i18n.t('Personal data updated successfully'), ALERT_TYPES.SUCCESS,
-    );
-  } catch (error) {
-    yield call(show, i18n.t('User'), error, ALERT_TYPES.DANGER);
-  }
-}
+function* updatePersonalDataWorker(action: PayloadAction<IUpdatePersonalData>) {}
 
 function* uploadAvatarWorker(action: PayloadAction<IUploadAvatar>) {

[NoCoverage] BlockStatement
src/store/sagas/user.ts:49:7
 }
 
 function* updatePersonalDataWorker(action: PayloadAction<IUpdatePersonalData>) {
-  try {
-    yield* apply(userService, userService.update, [action.payload]);
-    const { name, surname, bio } = action.payload;
-    yield put(UserActions.setPersonalData({
-      name: name!,
-      surname: surname!,
-      bio: bio!,
-    }));
-    yield call(
-      show, i18n.t('User'), i18n.t('Personal data updated successfully'), ALERT_TYPES.SUCCESS,
-    );
-  } catch (error) {
+  try {} catch (error) {
     yield call(show, i18n.t('User'), error, ALERT_TYPES.DANGER);
   }

[NoCoverage] StringLiteral
src/store/sagas/user.ts:58:20
       bio: bio!,
     }));
     yield call(
-      show, i18n.t('User'), i18n.t('Personal data updated successfully'), ALERT_TYPES.SUCCESS,
+      show, i18n.t(""), i18n.t('Personal data updated successfully'), ALERT_TYPES.SUCCESS,
     );
   } catch (error) {

[NoCoverage] BlockStatement
src/store/sagas/user.ts:60:19
     yield call(
       show, i18n.t('User'), i18n.t('Personal data updated successfully'), ALERT_TYPES.SUCCESS,
     );
-  } catch (error) {
-    yield call(show, i18n.t('User'), error, ALERT_TYPES.DANGER);
-  }
+  } catch (error) {}
 }
 

[NoCoverage] BlockStatement
src/store/sagas/user.ts:65:68
   }
 }
 
-function* uploadAvatarWorker(action: PayloadAction<IUploadAvatar>) {
-  try {
-    const response = yield* apply(userService, userService.uploadAvatar, [action.payload]);
-    const { avatar } = response.data;
-    yield put(UserActions.setAvatar(avatar));
-    yield call(
-      show, i18n.t('User'), i18n.t('Avatar successfully uploaded'), ALERT_TYPES.SUCCESS,
-    );
-  } catch (error) {
-    yield call(show, i18n.t('User'), error, ALERT_TYPES.DANGER);
-  }
-}
+function* uploadAvatarWorker(action: PayloadAction<IUploadAvatar>) {}
 
 function* removeAvatarWorker() {

[NoCoverage] BlockStatement
src/store/sagas/user.ts:66:7
 }
 
 function* uploadAvatarWorker(action: PayloadAction<IUploadAvatar>) {
-  try {
-    const response = yield* apply(userService, userService.uploadAvatar, [action.payload]);
-    const { avatar } = response.data;
-    yield put(UserActions.setAvatar(avatar));
-    yield call(
-      show, i18n.t('User'), i18n.t('Avatar successfully uploaded'), ALERT_TYPES.SUCCESS,
-    );
-  } catch (error) {
+  try {} catch (error) {
     yield call(show, i18n.t('User'), error, ALERT_TYPES.DANGER);
   }

[NoCoverage] BlockStatement
src/store/sagas/user.ts:78:32
   }
 }
 
-function* removeAvatarWorker() {
-  try {
-    yield* apply(userService, userService.removeAvatar, []);
-    yield call(
-      show, i18n.t('User'), i18n.t('Avatar removed successfully'), ALERT_TYPES.SUCCESS,
-    );
-    yield put(UserActions.setAvatar(null));
-  } catch (error) {
-    yield call(show, i18n.t('User'), error, ALERT_TYPES.DANGER);
-  }
-}
+function* removeAvatarWorker() {}
 
 export function* watchUser() {

[NoCoverage] BlockStatement
src/store/sagas/user.ts:79:7
 }
 
 function* removeAvatarWorker() {
-  try {
-    yield* apply(userService, userService.removeAvatar, []);
-    yield call(
-      show, i18n.t('User'), i18n.t('Avatar removed successfully'), ALERT_TYPES.SUCCESS,
-    );
-    yield put(UserActions.setAvatar(null));
-  } catch (error) {
+  try {} catch (error) {
     yield call(show, i18n.t('User'), error, ALERT_TYPES.DANGER);
   }

[NoCoverage] ArrayDeclaration
src/store/sagas/user.ts:80:57
 
 function* removeAvatarWorker() {
   try {
-    yield* apply(userService, userService.removeAvatar, []);
+    yield* apply(userService, userService.removeAvatar, ["Stryker was here"]);
     yield call(
       show, i18n.t('User'), i18n.t('Avatar removed successfully'), ALERT_TYPES.SUCCESS,

[NoCoverage] StringLiteral
src/store/sagas/user.ts:82:36
   try {
     yield* apply(userService, userService.removeAvatar, []);
     yield call(
-      show, i18n.t('User'), i18n.t('Avatar removed successfully'), ALERT_TYPES.SUCCESS,
+      show, i18n.t('User'), i18n.t(""), ALERT_TYPES.SUCCESS,
     );
     yield put(UserActions.setAvatar(null));

[NoCoverage] BlockStatement
src/store/sagas/user.ts:85:19
       show, i18n.t('User'), i18n.t('Avatar removed successfully'), ALERT_TYPES.SUCCESS,
     );
     yield put(UserActions.setAvatar(null));
-  } catch (error) {
-    yield call(show, i18n.t('User'), error, ALERT_TYPES.DANGER);
-  }
+  } catch (error) {}
 }
 

[NoCoverage] BlockStatement
src/store/sagas/user.ts:90:30
   }
 }
 
-export function* watchUser() {
-  yield all([
-    takeLatest(UserActions.fetchMe, fetchMeWorker),
-    takeLatest(UserActions.updateUsername, updateUsernameWorker),
-    takeLatest(UserActions.updateEmail, updateEmailWorker),
-    takeLatest(UserActions.updatePersonalData, updatePersonalDataWorker),
-    takeLatest(UserActions.uploadAvatar, uploadAvatarWorker),
-    takeLatest(UserActions.removeAvatar, removeAvatarWorker),
-  ]);
-}
+export function* watchUser() {}
 
