[NoCoverage] ArrowFunction
src/store/selectors/columns.ts:5:27
 import { IRootState } from '@store/reducers';
 import { IColumn } from '@type/entities';
 
-export const getColumns = (state: IRootState) => state.columns;
+export const getColumns = () => undefined;
 export const getOrderedColumnsByBoardId = (boardId: number | null) => createSelector(
   [getColumns],

[NoCoverage] ArrowFunction
src/store/selectors/columns.ts:6:43
 import { IColumn } from '@type/entities';
 
 export const getColumns = (state: IRootState) => state.columns;
-export const getOrderedColumnsByBoardId = (boardId: number | null) => createSelector(
-  [getColumns],
-  (columns) => {
-    if (boardId === null) return [];
-
-    const { entities, positions } = columns;
-    const positionsForBoard = positions[boardId];
-    if (!positionsForBoard) return [];
-
-    const orderedColumns: Array<IColumn> = [];
-
-    positionsForBoard.forEach((columnId) => {
-      const columnByOrder = entities.find((column) => column.id === columnId);
-      if (columnByOrder) {
-        orderedColumns.push(columnByOrder);
-      }
-    });
-
-    return orderedColumns;
-  },
-);
+export const getOrderedColumnsByBoardId = () => undefined;
 
 export const getWidthByColumnId = (columnId: number) => createSelector(

[NoCoverage] BlockStatement
src/store/selectors/columns.ts:8:16
 export const getColumns = (state: IRootState) => state.columns;
 export const getOrderedColumnsByBoardId = (boardId: number | null) => createSelector(
   [getColumns],
-  (columns) => {
-    if (boardId === null) return [];
-
-    const { entities, positions } = columns;
-    const positionsForBoard = positions[boardId];
-    if (!positionsForBoard) return [];
-
-    const orderedColumns: Array<IColumn> = [];
-
-    positionsForBoard.forEach((columnId) => {
-      const columnByOrder = entities.find((column) => column.id === columnId);
-      if (columnByOrder) {
-        orderedColumns.push(columnByOrder);
-      }
-    });
-
-    return orderedColumns;
-  },
+  (columns) => {},
 );
 

[NoCoverage] ConditionalExpression
src/store/selectors/columns.ts:9:9
 export const getOrderedColumnsByBoardId = (boardId: number | null) => createSelector(
   [getColumns],
   (columns) => {
-    if (boardId === null) return [];
+    if (false) return [];
 
     const { entities, positions } = columns;

[NoCoverage] ConditionalExpression
src/store/selectors/columns.ts:9:9
 export const getOrderedColumnsByBoardId = (boardId: number | null) => createSelector(
   [getColumns],
   (columns) => {
-    if (boardId === null) return [];
+    if (true) return [];
 
     const { entities, positions } = columns;

[NoCoverage] ConditionalExpression
src/store/selectors/columns.ts:13:9
 
     const { entities, positions } = columns;
     const positionsForBoard = positions[boardId];
-    if (!positionsForBoard) return [];
+    if (true) return [];
 
     const orderedColumns: Array<IColumn> = [];

[NoCoverage] BooleanLiteral
src/store/selectors/columns.ts:13:9
 
     const { entities, positions } = columns;
     const positionsForBoard = positions[boardId];
-    if (!positionsForBoard) return [];
+    if (positionsForBoard) return [];
 
     const orderedColumns: Array<IColumn> = [];

[NoCoverage] ArrayDeclaration
src/store/selectors/columns.ts:15:44
     const positionsForBoard = positions[boardId];
     if (!positionsForBoard) return [];
 
-    const orderedColumns: Array<IColumn> = [];
+    const orderedColumns: Array<IColumn> = ["Stryker was here"];
 
     positionsForBoard.forEach((columnId) => {

[NoCoverage] BlockStatement
src/store/selectors/columns.ts:17:45
 
     const orderedColumns: Array<IColumn> = [];
 
-    positionsForBoard.forEach((columnId) => {
-      const columnByOrder = entities.find((column) => column.id === columnId);
-      if (columnByOrder) {
-        orderedColumns.push(columnByOrder);
-      }
-    });
+    positionsForBoard.forEach((columnId) => {});
 
     return orderedColumns;

[NoCoverage] ArrowFunction
src/store/selectors/columns.ts:18:43
     const orderedColumns: Array<IColumn> = [];
 
     positionsForBoard.forEach((columnId) => {
-      const columnByOrder = entities.find((column) => column.id === columnId);
+      const columnByOrder = entities.find(() => undefined);
       if (columnByOrder) {
         orderedColumns.push(columnByOrder);

[NoCoverage] ConditionalExpression
src/store/selectors/columns.ts:18:55
     const orderedColumns: Array<IColumn> = [];
 
     positionsForBoard.forEach((columnId) => {
-      const columnByOrder = entities.find((column) => column.id === columnId);
+      const columnByOrder = entities.find((column) => false);
       if (columnByOrder) {
         orderedColumns.push(columnByOrder);

[NoCoverage] BlockStatement
src/store/selectors/columns.ts:19:26
 
     positionsForBoard.forEach((columnId) => {
       const columnByOrder = entities.find((column) => column.id === columnId);
-      if (columnByOrder) {
-        orderedColumns.push(columnByOrder);
-      }
+      if (columnByOrder) {}
     });
 

[NoCoverage] ConditionalExpression
src/store/selectors/columns.ts:19:11
 
     positionsForBoard.forEach((columnId) => {
       const columnByOrder = entities.find((column) => column.id === columnId);
-      if (columnByOrder) {
+      if (false) {
         orderedColumns.push(columnByOrder);
       }

[NoCoverage] ArrowFunction
src/store/selectors/columns.ts:28:35
   },
 );
 
-export const getWidthByColumnId = (columnId: number) => createSelector(
-  [getColumns],
-  (columns) => {
-    const targetColumn = columns.entities.find((column) => column.id === columnId);
-    return targetColumn?.width ?? null;
-  },
-);
+export const getWidthByColumnId = () => undefined;
 

[NoCoverage] ArrayDeclaration
src/store/selectors/columns.ts:29:3
 );
 
 export const getWidthByColumnId = (columnId: number) => createSelector(
-  [getColumns],
+  [],
   (columns) => {
     const targetColumn = columns.entities.find((column) => column.id === columnId);

[NoCoverage] BlockStatement
src/store/selectors/columns.ts:30:16
 
 export const getWidthByColumnId = (columnId: number) => createSelector(
   [getColumns],
-  (columns) => {
-    const targetColumn = columns.entities.find((column) => column.id === columnId);
-    return targetColumn?.width ?? null;
-  },
+  (columns) => {},
 );
 

[NoCoverage] ArrowFunction
src/store/selectors/columns.ts:31:48
 export const getWidthByColumnId = (columnId: number) => createSelector(
   [getColumns],
   (columns) => {
-    const targetColumn = columns.entities.find((column) => column.id === columnId);
+    const targetColumn = columns.entities.find(() => undefined);
     return targetColumn?.width ?? null;
   },

[NoCoverage] ConditionalExpression
src/store/selectors/columns.ts:31:60
 export const getWidthByColumnId = (columnId: number) => createSelector(
   [getColumns],
   (columns) => {
-    const targetColumn = columns.entities.find((column) => column.id === columnId);
+    const targetColumn = columns.entities.find((column) => false);
     return targetColumn?.width ?? null;
   },
