[NoCoverage] ArrowFunction
src/store/selectors/comment-attachments.ts:6:38
 
 const imageTypes = ['image/png', 'image/jpeg'];
 
-export const getCommentAttachments = (state: IRootState) => state.commentAttachments;
+export const getCommentAttachments = () => undefined;
 export const getCommentAttachmentsByCommentId = (commentId: number) => createSelector(
   [getCommentAttachments],

[NoCoverage] ArrowFunction
src/store/selectors/comment-attachments.ts:7:49
 const imageTypes = ['image/png', 'image/jpeg'];
 
 export const getCommentAttachments = (state: IRootState) => state.commentAttachments;
-export const getCommentAttachmentsByCommentId = (commentId: number) => createSelector(
-  [getCommentAttachments],
-  (attachments) => attachments.filter((attachment) => attachment.commentId === commentId),
-);
+export const getCommentAttachmentsByCommentId = () => undefined;
 export const getCommentFileAttachmentsByTodoId = (todoId: number | null) => createSelector(
   [getCommentAttachments],

[NoCoverage] ArrayDeclaration
src/store/selectors/comment-attachments.ts:8:3
 
 export const getCommentAttachments = (state: IRootState) => state.commentAttachments;
 export const getCommentAttachmentsByCommentId = (commentId: number) => createSelector(
-  [getCommentAttachments],
+  [],
   (attachments) => attachments.filter((attachment) => attachment.commentId === commentId),
 );

[NoCoverage] ArrowFunction
src/store/selectors/comment-attachments.ts:9:3
 export const getCommentAttachments = (state: IRootState) => state.commentAttachments;
 export const getCommentAttachmentsByCommentId = (commentId: number) => createSelector(
   [getCommentAttachments],
-  (attachments) => attachments.filter((attachment) => attachment.commentId === commentId),
+  () => undefined,
 );
 export const getCommentFileAttachmentsByTodoId = (todoId: number | null) => createSelector(

[NoCoverage] ConditionalExpression
src/store/selectors/comment-attachments.ts:9:55
 export const getCommentAttachments = (state: IRootState) => state.commentAttachments;
 export const getCommentAttachmentsByCommentId = (commentId: number) => createSelector(
   [getCommentAttachments],
-  (attachments) => attachments.filter((attachment) => attachment.commentId === commentId),
+  (attachments) => attachments.filter((attachment) => false),
 );
 export const getCommentFileAttachmentsByTodoId = (todoId: number | null) => createSelector(

[NoCoverage] ArrowFunction
src/store/selectors/comment-attachments.ts:11:50
   [getCommentAttachments],
   (attachments) => attachments.filter((attachment) => attachment.commentId === commentId),
 );
-export const getCommentFileAttachmentsByTodoId = (todoId: number | null) => createSelector(
-  [getCommentAttachments],
-  (attachments) => attachments
-    .filter((attachment) => !imageTypes.includes(attachment.mimeType)
-        && attachment.todoId === todoId),
-);
+export const getCommentFileAttachmentsByTodoId = () => undefined;
 export const getCommentImageAttachmentsByTodoId = (todoId: number | null) => createSelector(
   [getCommentAttachments],

[NoCoverage] ArrowFunction
src/store/selectors/comment-attachments.ts:13:3
 );
 export const getCommentFileAttachmentsByTodoId = (todoId: number | null) => createSelector(
   [getCommentAttachments],
-  (attachments) => attachments
-    .filter((attachment) => !imageTypes.includes(attachment.mimeType)
-        && attachment.todoId === todoId),
+  () => undefined,
 );
 export const getCommentImageAttachmentsByTodoId = (todoId: number | null) => createSelector(

[NoCoverage] BooleanLiteral
src/store/selectors/comment-attachments.ts:14:29
 export const getCommentFileAttachmentsByTodoId = (todoId: number | null) => createSelector(
   [getCommentAttachments],
   (attachments) => attachments
-    .filter((attachment) => !imageTypes.includes(attachment.mimeType)
+    .filter((attachment) => imageTypes.includes(attachment.mimeType)
         && attachment.todoId === todoId),
 );

[NoCoverage] ConditionalExpression
src/store/selectors/comment-attachments.ts:14:29
 export const getCommentFileAttachmentsByTodoId = (todoId: number | null) => createSelector(
   [getCommentAttachments],
   (attachments) => attachments
-    .filter((attachment) => !imageTypes.includes(attachment.mimeType)
-        && attachment.todoId === todoId),
+    .filter((attachment) => false),
 );
 export const getCommentImageAttachmentsByTodoId = (todoId: number | null) => createSelector(

[NoCoverage] EqualityOperator
src/store/selectors/comment-attachments.ts:15:12
   [getCommentAttachments],
   (attachments) => attachments
     .filter((attachment) => !imageTypes.includes(attachment.mimeType)
-        && attachment.todoId === todoId),
+        && attachment.todoId !== todoId),
 );
 export const getCommentImageAttachmentsByTodoId = (todoId: number | null) => createSelector(

[NoCoverage] ConditionalExpression
src/store/selectors/comment-attachments.ts:15:12
   [getCommentAttachments],
   (attachments) => attachments
     .filter((attachment) => !imageTypes.includes(attachment.mimeType)
-        && attachment.todoId === todoId),
+        && false),
 );
 export const getCommentImageAttachmentsByTodoId = (todoId: number | null) => createSelector(

[NoCoverage] ArrowFunction
src/store/selectors/comment-attachments.ts:17:51
     .filter((attachment) => !imageTypes.includes(attachment.mimeType)
         && attachment.todoId === todoId),
 );
-export const getCommentImageAttachmentsByTodoId = (todoId: number | null) => createSelector(
-  [getCommentAttachments],
-  (attachments) => attachments
-    .filter((attachment) => imageTypes.includes(attachment.mimeType)
-        && attachment.todoId === todoId),
-);
+export const getCommentImageAttachmentsByTodoId = () => undefined;
 

[NoCoverage] ArrayDeclaration
src/store/selectors/comment-attachments.ts:18:3
         && attachment.todoId === todoId),
 );
 export const getCommentImageAttachmentsByTodoId = (todoId: number | null) => createSelector(
-  [getCommentAttachments],
+  [],
   (attachments) => attachments
     .filter((attachment) => imageTypes.includes(attachment.mimeType)

[NoCoverage] ArrowFunction
src/store/selectors/comment-attachments.ts:19:3
 );
 export const getCommentImageAttachmentsByTodoId = (todoId: number | null) => createSelector(
   [getCommentAttachments],
-  (attachments) => attachments
-    .filter((attachment) => imageTypes.includes(attachment.mimeType)
-        && attachment.todoId === todoId),
+  () => undefined,
 );
 

[NoCoverage] ConditionalExpression
src/store/selectors/comment-attachments.ts:20:29
 export const getCommentImageAttachmentsByTodoId = (todoId: number | null) => createSelector(
   [getCommentAttachments],
   (attachments) => attachments
-    .filter((attachment) => imageTypes.includes(attachment.mimeType)
-        && attachment.todoId === todoId),
+    .filter((attachment) => true),
 );
 

[NoCoverage] ConditionalExpression
src/store/selectors/comment-attachments.ts:20:29
 export const getCommentImageAttachmentsByTodoId = (todoId: number | null) => createSelector(
   [getCommentAttachments],
   (attachments) => attachments
-    .filter((attachment) => imageTypes.includes(attachment.mimeType)
-        && attachment.todoId === todoId),
+    .filter((attachment) => false),
 );
 

[NoCoverage] ConditionalExpression
src/store/selectors/comment-attachments.ts:21:12
   [getCommentAttachments],
   (attachments) => attachments
     .filter((attachment) => imageTypes.includes(attachment.mimeType)
-        && attachment.todoId === todoId),
+        && true),
 );
 

[NoCoverage] EqualityOperator
src/store/selectors/comment-attachments.ts:21:12
   [getCommentAttachments],
   (attachments) => attachments
     .filter((attachment) => imageTypes.includes(attachment.mimeType)
-        && attachment.todoId === todoId),
+        && attachment.todoId !== todoId),
 );
 
