[NoCoverage] ArrowFunction
src/store/selectors/system.ts:6:34
 import { getBoards } from '@store/selectors/boards';
 import { getTodos } from '@store/selectors/todos';
 
-export const getIsLoadedBoards = (state: IRootState) => state.system.isLoadedBoards;
+export const getIsLoadedBoards = () => undefined;
 export const getIsLoadedColumns = (state: IRootState) => state.system.isLoadedColumns;
 export const getIsLoadedTodos = (state: IRootState) => state.system.isLoadedTodos;

[NoCoverage] ArrowFunction
src/store/selectors/system.ts:7:35
 import { getTodos } from '@store/selectors/todos';
 
 export const getIsLoadedBoards = (state: IRootState) => state.system.isLoadedBoards;
-export const getIsLoadedColumns = (state: IRootState) => state.system.isLoadedColumns;
+export const getIsLoadedColumns = () => undefined;
 export const getIsLoadedTodos = (state: IRootState) => state.system.isLoadedTodos;
 export const getActivePopupId = (state: IRootState) => state.system.activePopupId;

[NoCoverage] ArrowFunction
src/store/selectors/system.ts:8:33
 
 export const getIsLoadedBoards = (state: IRootState) => state.system.isLoadedBoards;
 export const getIsLoadedColumns = (state: IRootState) => state.system.isLoadedColumns;
-export const getIsLoadedTodos = (state: IRootState) => state.system.isLoadedTodos;
+export const getIsLoadedTodos = () => undefined;
 export const getActivePopupId = (state: IRootState) => state.system.activePopupId;
 export const getEditableBoardId = (state: IRootState) => state.system.editableBoardId;

[NoCoverage] ArrowFunction
src/store/selectors/system.ts:9:33
 export const getIsLoadedBoards = (state: IRootState) => state.system.isLoadedBoards;
 export const getIsLoadedColumns = (state: IRootState) => state.system.isLoadedColumns;
 export const getIsLoadedTodos = (state: IRootState) => state.system.isLoadedTodos;
-export const getActivePopupId = (state: IRootState) => state.system.activePopupId;
+export const getActivePopupId = () => undefined;
 export const getEditableBoardId = (state: IRootState) => state.system.editableBoardId;
 export const getEditableColumnId = (state: IRootState) => state.system.editableColumnId;

[NoCoverage] ArrowFunction
src/store/selectors/system.ts:10:35
 export const getIsLoadedColumns = (state: IRootState) => state.system.isLoadedColumns;
 export const getIsLoadedTodos = (state: IRootState) => state.system.isLoadedTodos;
 export const getActivePopupId = (state: IRootState) => state.system.activePopupId;
-export const getEditableBoardId = (state: IRootState) => state.system.editableBoardId;
+export const getEditableBoardId = () => undefined;
 export const getEditableColumnId = (state: IRootState) => state.system.editableColumnId;
 export const getEditableCardId = (state: IRootState) => state.system.editableCardId;

[NoCoverage] ArrowFunction
src/store/selectors/system.ts:11:36
 export const getIsLoadedTodos = (state: IRootState) => state.system.isLoadedTodos;
 export const getActivePopupId = (state: IRootState) => state.system.activePopupId;
 export const getEditableBoardId = (state: IRootState) => state.system.editableBoardId;
-export const getEditableColumnId = (state: IRootState) => state.system.editableColumnId;
+export const getEditableColumnId = () => undefined;
 export const getEditableCardId = (state: IRootState) => state.system.editableCardId;
 export const getIsSearchMode = (state: IRootState) => state.system.isSearchMode;

[NoCoverage] ArrowFunction
src/store/selectors/system.ts:12:34
 export const getActivePopupId = (state: IRootState) => state.system.activePopupId;
 export const getEditableBoardId = (state: IRootState) => state.system.editableBoardId;
 export const getEditableColumnId = (state: IRootState) => state.system.editableColumnId;
-export const getEditableCardId = (state: IRootState) => state.system.editableCardId;
+export const getEditableCardId = () => undefined;
 export const getIsSearchMode = (state: IRootState) => state.system.isSearchMode;
 export const getLanguage = (state: IRootState) => state.system.language;

[NoCoverage] ArrowFunction
src/store/selectors/system.ts:13:32
 export const getEditableBoardId = (state: IRootState) => state.system.editableBoardId;
 export const getEditableColumnId = (state: IRootState) => state.system.editableColumnId;
 export const getEditableCardId = (state: IRootState) => state.system.editableCardId;
-export const getIsSearchMode = (state: IRootState) => state.system.isSearchMode;
+export const getIsSearchMode = () => undefined;
 export const getLanguage = (state: IRootState) => state.system.language;
 export const getActiveTodoId = (state: IRootState) => state.system.activeTodoId;

[NoCoverage] ArrowFunction
src/store/selectors/system.ts:14:28
 export const getEditableColumnId = (state: IRootState) => state.system.editableColumnId;
 export const getEditableCardId = (state: IRootState) => state.system.editableCardId;
 export const getIsSearchMode = (state: IRootState) => state.system.isSearchMode;
-export const getLanguage = (state: IRootState) => state.system.language;
+export const getLanguage = () => undefined;
 export const getActiveTodoId = (state: IRootState) => state.system.activeTodoId;
 export const getEditCommentId = (state: IRootState) => state.system.editCommentId;

[NoCoverage] ArrowFunction
src/store/selectors/system.ts:15:32
 export const getEditableCardId = (state: IRootState) => state.system.editableCardId;
 export const getIsSearchMode = (state: IRootState) => state.system.isSearchMode;
 export const getLanguage = (state: IRootState) => state.system.language;
-export const getActiveTodoId = (state: IRootState) => state.system.activeTodoId;
+export const getActiveTodoId = () => undefined;
 export const getEditCommentId = (state: IRootState) => state.system.editCommentId;
 export const getReplyCommentId = (state: IRootState) => state.system.replyCommentId;

[NoCoverage] ArrowFunction
src/store/selectors/system.ts:16:33
 export const getIsSearchMode = (state: IRootState) => state.system.isSearchMode;
 export const getLanguage = (state: IRootState) => state.system.language;
 export const getActiveTodoId = (state: IRootState) => state.system.activeTodoId;
-export const getEditCommentId = (state: IRootState) => state.system.editCommentId;
+export const getEditCommentId = () => undefined;
 export const getReplyCommentId = (state: IRootState) => state.system.replyCommentId;
 export const getIsOpenProfile = (state: IRootState) => state.system.isOpenProfile;

[NoCoverage] ArrowFunction
src/store/selectors/system.ts:17:34
 export const getLanguage = (state: IRootState) => state.system.language;
 export const getActiveTodoId = (state: IRootState) => state.system.activeTodoId;
 export const getEditCommentId = (state: IRootState) => state.system.editCommentId;
-export const getReplyCommentId = (state: IRootState) => state.system.replyCommentId;
+export const getReplyCommentId = () => undefined;
 export const getIsOpenProfile = (state: IRootState) => state.system.isOpenProfile;
 export const getActiveBoardId = (state: IRootState) => state.system.activeBoardId;

[NoCoverage] ArrowFunction
src/store/selectors/system.ts:18:33
 export const getActiveTodoId = (state: IRootState) => state.system.activeTodoId;
 export const getEditCommentId = (state: IRootState) => state.system.editCommentId;
 export const getReplyCommentId = (state: IRootState) => state.system.replyCommentId;
-export const getIsOpenProfile = (state: IRootState) => state.system.isOpenProfile;
+export const getIsOpenProfile = () => undefined;
 export const getActiveBoardId = (state: IRootState) => state.system.activeBoardId;
 export const getActiveBoardTitle = createSelector(

[NoCoverage] ArrowFunction
src/store/selectors/system.ts:19:33
 export const getEditCommentId = (state: IRootState) => state.system.editCommentId;
 export const getReplyCommentId = (state: IRootState) => state.system.replyCommentId;
 export const getIsOpenProfile = (state: IRootState) => state.system.isOpenProfile;
-export const getActiveBoardId = (state: IRootState) => state.system.activeBoardId;
+export const getActiveBoardId = () => undefined;
 export const getActiveBoardTitle = createSelector(
   [getActiveBoardId, getBoards], (activeBoardId, boards) => {

[NoCoverage] BlockStatement
src/store/selectors/system.ts:21:61
 export const getIsOpenProfile = (state: IRootState) => state.system.isOpenProfile;
 export const getActiveBoardId = (state: IRootState) => state.system.activeBoardId;
 export const getActiveBoardTitle = createSelector(
-  [getActiveBoardId, getBoards], (activeBoardId, boards) => {
-    if (!activeBoardId) return;
-    const activeBoard = boards.entities.find((board) => board.id === activeBoardId);
-    return activeBoard?.title;
-  },
+  [getActiveBoardId, getBoards], (activeBoardId, boards) => {},
 );
 export const getActiveTodoTitle = createSelector(

[NoCoverage] BooleanLiteral
src/store/selectors/system.ts:22:9
 export const getActiveBoardId = (state: IRootState) => state.system.activeBoardId;
 export const getActiveBoardTitle = createSelector(
   [getActiveBoardId, getBoards], (activeBoardId, boards) => {
-    if (!activeBoardId) return;
+    if (activeBoardId) return;
     const activeBoard = boards.entities.find((board) => board.id === activeBoardId);
     return activeBoard?.title;

[NoCoverage] ConditionalExpression
src/store/selectors/system.ts:22:9
 export const getActiveBoardId = (state: IRootState) => state.system.activeBoardId;
 export const getActiveBoardTitle = createSelector(
   [getActiveBoardId, getBoards], (activeBoardId, boards) => {
-    if (!activeBoardId) return;
+    if (true) return;
     const activeBoard = boards.entities.find((board) => board.id === activeBoardId);
     return activeBoard?.title;

[NoCoverage] ConditionalExpression
src/store/selectors/system.ts:23:57
 export const getActiveBoardTitle = createSelector(
   [getActiveBoardId, getBoards], (activeBoardId, boards) => {
     if (!activeBoardId) return;
-    const activeBoard = boards.entities.find((board) => board.id === activeBoardId);
+    const activeBoard = boards.entities.find((board) => true);
     return activeBoard?.title;
   },

[NoCoverage] ArrowFunction
src/store/selectors/system.ts:23:46
 export const getActiveBoardTitle = createSelector(
   [getActiveBoardId, getBoards], (activeBoardId, boards) => {
     if (!activeBoardId) return;
-    const activeBoard = boards.entities.find((board) => board.id === activeBoardId);
+    const activeBoard = boards.entities.find(() => undefined);
     return activeBoard?.title;
   },

[NoCoverage] BlockStatement
src/store/selectors/system.ts:28:57
   },
 );
 export const getActiveTodoTitle = createSelector(
-  [getActiveTodoId, getTodos], (activeTodoId, todos) => {
-    if (!activeTodoId) return;
-    const activeTodo = todos.entities.find((todo) => todo.id === activeTodoId);
-    return activeTodo?.title;
-  },
+  [getActiveTodoId, getTodos], (activeTodoId, todos) => {},
 );
 export const getActiveBoardReadableId = (state: IRootState) => state.system.activeBoardReadableId;

[NoCoverage] ConditionalExpression
src/store/selectors/system.ts:29:9
 );
 export const getActiveTodoTitle = createSelector(
   [getActiveTodoId, getTodos], (activeTodoId, todos) => {
-    if (!activeTodoId) return;
+    if (false) return;
     const activeTodo = todos.entities.find((todo) => todo.id === activeTodoId);
     return activeTodo?.title;

[NoCoverage] BooleanLiteral
src/store/selectors/system.ts:29:9
 );
 export const getActiveTodoTitle = createSelector(
   [getActiveTodoId, getTodos], (activeTodoId, todos) => {
-    if (!activeTodoId) return;
+    if (activeTodoId) return;
     const activeTodo = todos.entities.find((todo) => todo.id === activeTodoId);
     return activeTodo?.title;

[NoCoverage] ConditionalExpression
src/store/selectors/system.ts:30:54
 export const getActiveTodoTitle = createSelector(
   [getActiveTodoId, getTodos], (activeTodoId, todos) => {
     if (!activeTodoId) return;
-    const activeTodo = todos.entities.find((todo) => todo.id === activeTodoId);
+    const activeTodo = todos.entities.find((todo) => true);
     return activeTodo?.title;
   },

[NoCoverage] ArrowFunction
src/store/selectors/system.ts:30:44
 export const getActiveTodoTitle = createSelector(
   [getActiveTodoId, getTodos], (activeTodoId, todos) => {
     if (!activeTodoId) return;
-    const activeTodo = todos.entities.find((todo) => todo.id === activeTodoId);
+    const activeTodo = todos.entities.find(() => undefined);
     return activeTodo?.title;
   },

[NoCoverage] ArrowFunction
src/store/selectors/system.ts:34:41
     return activeTodo?.title;
   },
 );
-export const getActiveBoardReadableId = (state: IRootState) => state.system.activeBoardReadableId;
+export const getActiveBoardReadableId = () => undefined;
 export const getActiveTodoReadableId = (state: IRootState) => state.system.activeTodoReadableId;
 export const getDroppedFiles = (state: IRootState) => state.system.droppedFiles;

[NoCoverage] ArrowFunction
src/store/selectors/system.ts:35:40
   },
 );
 export const getActiveBoardReadableId = (state: IRootState) => state.system.activeBoardReadableId;
-export const getActiveTodoReadableId = (state: IRootState) => state.system.activeTodoReadableId;
+export const getActiveTodoReadableId = () => undefined;
 export const getDroppedFiles = (state: IRootState) => state.system.droppedFiles;
 export const getGalleryImagesInfo = (state: IRootState) => state.system.galleryImagesInfo;

[NoCoverage] ArrowFunction
src/store/selectors/system.ts:36:32
 );
 export const getActiveBoardReadableId = (state: IRootState) => state.system.activeBoardReadableId;
 export const getActiveTodoReadableId = (state: IRootState) => state.system.activeTodoReadableId;
-export const getDroppedFiles = (state: IRootState) => state.system.droppedFiles;
+export const getDroppedFiles = () => undefined;
 export const getGalleryImagesInfo = (state: IRootState) => state.system.galleryImagesInfo;
 export const getIsOpenFormattingHelp = (state: IRootState) => state.system.isOpenFormattingHelp;

[NoCoverage] ArrowFunction
src/store/selectors/system.ts:37:37
 export const getActiveBoardReadableId = (state: IRootState) => state.system.activeBoardReadableId;
 export const getActiveTodoReadableId = (state: IRootState) => state.system.activeTodoReadableId;
 export const getDroppedFiles = (state: IRootState) => state.system.droppedFiles;
-export const getGalleryImagesInfo = (state: IRootState) => state.system.galleryImagesInfo;
+export const getGalleryImagesInfo = () => undefined;
 export const getIsOpenFormattingHelp = (state: IRootState) => state.system.isOpenFormattingHelp;
 

[NoCoverage] ArrowFunction
src/store/selectors/system.ts:38:40
 export const getActiveTodoReadableId = (state: IRootState) => state.system.activeTodoReadableId;
 export const getDroppedFiles = (state: IRootState) => state.system.droppedFiles;
 export const getGalleryImagesInfo = (state: IRootState) => state.system.galleryImagesInfo;
-export const getIsOpenFormattingHelp = (state: IRootState) => state.system.isOpenFormattingHelp;
+export const getIsOpenFormattingHelp = () => undefined;
 
