[NoCoverage] ArrowFunction
src/store/selectors/user.ts:4:28
 import { createSelector } from '@reduxjs/toolkit';
 import { IRootState } from '@store/reducers';
 
-export const getUsername = (state: IRootState) => state.user.username;
+export const getUsername = () => undefined;
 export const getEmail = (state: IRootState) => state.user.email;
 export const getName = (state: IRootState) => state.user.name;

[NoCoverage] ArrowFunction
src/store/selectors/user.ts:5:25
 import { IRootState } from '@store/reducers';
 
 export const getUsername = (state: IRootState) => state.user.username;
-export const getEmail = (state: IRootState) => state.user.email;
+export const getEmail = () => undefined;
 export const getName = (state: IRootState) => state.user.name;
 export const getSurname = (state: IRootState) => state.user.surname;

[NoCoverage] ArrowFunction
src/store/selectors/user.ts:6:24
 
 export const getUsername = (state: IRootState) => state.user.username;
 export const getEmail = (state: IRootState) => state.user.email;
-export const getName = (state: IRootState) => state.user.name;
+export const getName = () => undefined;
 export const getSurname = (state: IRootState) => state.user.surname;
 export const getBio = (state: IRootState) => state.user.bio;

[NoCoverage] ArrowFunction
src/store/selectors/user.ts:7:27
 export const getUsername = (state: IRootState) => state.user.username;
 export const getEmail = (state: IRootState) => state.user.email;
 export const getName = (state: IRootState) => state.user.name;
-export const getSurname = (state: IRootState) => state.user.surname;
+export const getSurname = () => undefined;
 export const getBio = (state: IRootState) => state.user.bio;
 export const getAvatarUrl = (state: IRootState) => state.user.avatar;

[NoCoverage] ArrowFunction
src/store/selectors/user.ts:8:23
 export const getEmail = (state: IRootState) => state.user.email;
 export const getName = (state: IRootState) => state.user.name;
 export const getSurname = (state: IRootState) => state.user.surname;
-export const getBio = (state: IRootState) => state.user.bio;
+export const getBio = () => undefined;
 export const getAvatarUrl = (state: IRootState) => state.user.avatar;
 export const getFullName = createSelector(

[NoCoverage] ArrowFunction
src/store/selectors/user.ts:9:29
 export const getName = (state: IRootState) => state.user.name;
 export const getSurname = (state: IRootState) => state.user.surname;
 export const getBio = (state: IRootState) => state.user.bio;
-export const getAvatarUrl = (state: IRootState) => state.user.avatar;
+export const getAvatarUrl = () => undefined;
 export const getFullName = createSelector(
   [getName, getSurname],

[NoCoverage] ArrowFunction
src/store/selectors/user.ts:12:3
 export const getAvatarUrl = (state: IRootState) => state.user.avatar;
 export const getFullName = createSelector(
   [getName, getSurname],
-  (name, surname) => `${name} ${surname}`,
+  () => undefined,
 );
 
