[NoCoverage] BlockStatement
verticals/src/use/animationHeight.ts:3:61
 /* eslint-disable no-param-reassign,no-caller,no-restricted-properties */
 export const useCollapse = () => {
-  const collapse = (element: HTMLElement, delay: number) => {
-    const sectionHeight = element.scrollHeight;
-    element.style.transition = '';
-
-    requestAnimationFrame(() => {
-      element.style.height = `${sectionHeight}px`;
-      element.style.transition = `height ${delay}ms ease-in-out`;
-
-      requestAnimationFrame(() => {
-        element.style.height = `${0}px`;
-      });
-    });
-  };
+  const collapse = (element: HTMLElement, delay: number) => {};
 
   const expand = (element: HTMLElement, delay: number) => {

[NoCoverage] BlockStatement
verticals/src/use/animationHeight.ts:7:33
     const sectionHeight = element.scrollHeight;
     element.style.transition = '';
 
-    requestAnimationFrame(() => {
-      element.style.height = `${sectionHeight}px`;
-      element.style.transition = `height ${delay}ms ease-in-out`;
-
-      requestAnimationFrame(() => {
-        element.style.height = `${0}px`;
-      });
-    });
+    requestAnimationFrame(() => {});
   };
 

[NoCoverage] StringLiteral
verticals/src/use/animationHeight.ts:9:34
 
     requestAnimationFrame(() => {
       element.style.height = `${sectionHeight}px`;
-      element.style.transition = `height ${delay}ms ease-in-out`;
+      element.style.transition = ``;
 
       requestAnimationFrame(() => {

[NoCoverage] BlockStatement
verticals/src/use/animationHeight.ts:11:35
       element.style.height = `${sectionHeight}px`;
       element.style.transition = `height ${delay}ms ease-in-out`;
 
-      requestAnimationFrame(() => {
-        element.style.height = `${0}px`;
-      });
+      requestAnimationFrame(() => {});
     });
   };

[NoCoverage] BlockStatement
verticals/src/use/animationHeight.ts:17:59
     });
   };
 
-  const expand = (element: HTMLElement, delay: number) => {
-    const sectionHeight = element.scrollHeight;
-
-    element.style.height = `${sectionHeight}px`;
-
-    setTimeout(() => {
-      element.style.height = 'auto';
-    }, delay);
-  };
+  const expand = (element: HTMLElement, delay: number) => {};
 
   return {

[NoCoverage] BlockStatement
verticals/src/use/animationHeight.ts:22:22
 
     element.style.height = `${sectionHeight}px`;
 
-    setTimeout(() => {
-      element.style.height = 'auto';
-    }, delay);
+    setTimeout(() => {}, delay);
   };
 

[NoCoverage] StringLiteral
verticals/src/use/animationHeight.ts:23:30
     element.style.height = `${sectionHeight}px`;
 
     setTimeout(() => {
-      element.style.height = 'auto';
+      element.style.height = "";
     }, delay);
   };
