[NoCoverage] BooleanLiteral
verticals/src/use/autoScroll.ts:19:47
   dependencies?: Array<any>,
   observeDirectionLimit?: ScrollDirection,
 ) => {
-  const [isLimit, setIsLimit] = useState<any>(true);
+  const [isLimit, setIsLimit] = useState<any>(false);
 
   const scrollToTop = () => {

[NoCoverage] BlockStatement
verticals/src/use/autoScroll.ts:21:29
 ) => {
   const [isLimit, setIsLimit] = useState<any>(true);
 
-  const scrollToTop = () => {
-    if (ref.current) {
-      ref.current.scrollTop = 0;
-    }
-  };
+  const scrollToTop = () => {};
 
   const scrollToBottom = () => {

[NoCoverage] ConditionalExpression
verticals/src/use/autoScroll.ts:22:9
   const [isLimit, setIsLimit] = useState<any>(true);
 
   const scrollToTop = () => {
-    if (ref.current) {
+    if (true) {
       ref.current.scrollTop = 0;
     }

[NoCoverage] ConditionalExpression
verticals/src/use/autoScroll.ts:22:9
   const [isLimit, setIsLimit] = useState<any>(true);
 
   const scrollToTop = () => {
-    if (ref.current) {
+    if (false) {
       ref.current.scrollTop = 0;
     }

[NoCoverage] BlockStatement
verticals/src/use/autoScroll.ts:27:32
     }
   };
 
-  const scrollToBottom = () => {
-    if (ref.current) {
-      ref.current.scrollTop = ref.current.scrollHeight;
-    }
-  };
+  const scrollToBottom = () => {};
 
   const scrollToRight = () => {

[NoCoverage] ConditionalExpression
verticals/src/use/autoScroll.ts:28:9
   };
 
   const scrollToBottom = () => {
-    if (ref.current) {
+    if (true) {
       ref.current.scrollTop = ref.current.scrollHeight;
     }

[NoCoverage] ConditionalExpression
verticals/src/use/autoScroll.ts:28:9
   };
 
   const scrollToBottom = () => {
-    if (ref.current) {
+    if (false) {
       ref.current.scrollTop = ref.current.scrollHeight;
     }

[NoCoverage] BlockStatement
verticals/src/use/autoScroll.ts:33:31
     }
   };
 
-  const scrollToRight = () => {
-    if (ref.current) {
-      ref.current.scrollLeft = ref.current.scrollWidth;
-    }
-  };
+  const scrollToRight = () => {};
 
   const scrollToLeft = () => {

[NoCoverage] ConditionalExpression
verticals/src/use/autoScroll.ts:34:9
   };
 
   const scrollToRight = () => {
-    if (ref.current) {
+    if (true) {
       ref.current.scrollLeft = ref.current.scrollWidth;
     }

[NoCoverage] BlockStatement
verticals/src/use/autoScroll.ts:34:22
   };
 
   const scrollToRight = () => {
-    if (ref.current) {
-      ref.current.scrollLeft = ref.current.scrollWidth;
-    }
+    if (ref.current) {}
   };
 

[NoCoverage] BlockStatement
verticals/src/use/autoScroll.ts:39:30
     }
   };
 
-  const scrollToLeft = () => {
-    if (ref.current) {
-      ref.current.scrollLeft = 0;
-    }
-  };
+  const scrollToLeft = () => {};
 
   const handleScroll = () => {

[NoCoverage] BlockStatement
verticals/src/use/autoScroll.ts:40:22
   };
 
   const scrollToLeft = () => {
-    if (ref.current) {
-      ref.current.scrollLeft = 0;
-    }
+    if (ref.current) {}
   };
 

[NoCoverage] ConditionalExpression
verticals/src/use/autoScroll.ts:40:9
   };
 
   const scrollToLeft = () => {
-    if (ref.current) {
+    if (true) {
       ref.current.scrollLeft = 0;
     }

[NoCoverage] BlockStatement
verticals/src/use/autoScroll.ts:45:30
     }
   };
 
-  const handleScroll = () => {
-    switch (observeDirectionLimit) {
-      case ScrollDirection.Top: {
-        setIsLimit(ref.current.scrollTop === 0);
-        break;
-      }
-      case ScrollDirection.Bottom: {
-        setIsLimit(ref.current.scrollTop + ref.current.clientHeight === ref.current.scrollHeight);
-        break;
-      }
-      case ScrollDirection.Right: {
-        setIsLimit(ref.current.scrollLeft + ref.current.clientWidth === ref.current.scrollWidth);
-        break;
-      }
-      case ScrollDirection.Left: {
-        setIsLimit(ref.current.scrollLeft === 0);
-        break;
-      }
-      default: break;
-    }
-  };
+  const handleScroll = () => {};
 
   useLayoutEffect(() => {

[NoCoverage] BlockStatement
verticals/src/use/autoScroll.ts:47:33
 
   const handleScroll = () => {
     switch (observeDirectionLimit) {
-      case ScrollDirection.Top: {
-        setIsLimit(ref.current.scrollTop === 0);
-        break;
-      }
+      case ScrollDirection.Top: {}
       case ScrollDirection.Bottom: {
         setIsLimit(ref.current.scrollTop + ref.current.clientHeight === ref.current.scrollHeight);

[NoCoverage] ConditionalExpression
verticals/src/use/autoScroll.ts:47:7
 
   const handleScroll = () => {
     switch (observeDirectionLimit) {
-      case ScrollDirection.Top: {
-        setIsLimit(ref.current.scrollTop === 0);
-        break;
-      }
+      case ScrollDirection.Top:
       case ScrollDirection.Bottom: {
         setIsLimit(ref.current.scrollTop + ref.current.clientHeight === ref.current.scrollHeight);

[NoCoverage] ConditionalExpression
verticals/src/use/autoScroll.ts:48:20
   const handleScroll = () => {
     switch (observeDirectionLimit) {
       case ScrollDirection.Top: {
-        setIsLimit(ref.current.scrollTop === 0);
+        setIsLimit(true);
         break;
       }

[NoCoverage] EqualityOperator
verticals/src/use/autoScroll.ts:48:20
   const handleScroll = () => {
     switch (observeDirectionLimit) {
       case ScrollDirection.Top: {
-        setIsLimit(ref.current.scrollTop === 0);
+        setIsLimit(ref.current.scrollTop !== 0);
         break;
       }

[NoCoverage] BlockStatement
verticals/src/use/autoScroll.ts:51:36
         setIsLimit(ref.current.scrollTop === 0);
         break;
       }
-      case ScrollDirection.Bottom: {
-        setIsLimit(ref.current.scrollTop + ref.current.clientHeight === ref.current.scrollHeight);
-        break;
-      }
+      case ScrollDirection.Bottom: {}
       case ScrollDirection.Right: {
         setIsLimit(ref.current.scrollLeft + ref.current.clientWidth === ref.current.scrollWidth);

[NoCoverage] ConditionalExpression
verticals/src/use/autoScroll.ts:51:7
         setIsLimit(ref.current.scrollTop === 0);
         break;
       }
-      case ScrollDirection.Bottom: {
-        setIsLimit(ref.current.scrollTop + ref.current.clientHeight === ref.current.scrollHeight);
-        break;
-      }
+      case ScrollDirection.Bottom:
       case ScrollDirection.Right: {
         setIsLimit(ref.current.scrollLeft + ref.current.clientWidth === ref.current.scrollWidth);

[NoCoverage] EqualityOperator
verticals/src/use/autoScroll.ts:52:20
         break;
       }
       case ScrollDirection.Bottom: {
-        setIsLimit(ref.current.scrollTop + ref.current.clientHeight === ref.current.scrollHeight);
+        setIsLimit(ref.current.scrollTop + ref.current.clientHeight !== ref.current.scrollHeight);
         break;
       }

[NoCoverage] ArithmeticOperator
verticals/src/use/autoScroll.ts:52:20
         break;
       }
       case ScrollDirection.Bottom: {
-        setIsLimit(ref.current.scrollTop + ref.current.clientHeight === ref.current.scrollHeight);
+        setIsLimit(ref.current.scrollTop - ref.current.clientHeight === ref.current.scrollHeight);
         break;
       }

[NoCoverage] ConditionalExpression
verticals/src/use/autoScroll.ts:55:7
         setIsLimit(ref.current.scrollTop + ref.current.clientHeight === ref.current.scrollHeight);
         break;
       }
-      case ScrollDirection.Right: {
-        setIsLimit(ref.current.scrollLeft + ref.current.clientWidth === ref.current.scrollWidth);
-        break;
-      }
+      case ScrollDirection.Right:
       case ScrollDirection.Left: {
         setIsLimit(ref.current.scrollLeft === 0);

[NoCoverage] BlockStatement
verticals/src/use/autoScroll.ts:55:35
         setIsLimit(ref.current.scrollTop + ref.current.clientHeight === ref.current.scrollHeight);
         break;
       }
-      case ScrollDirection.Right: {
-        setIsLimit(ref.current.scrollLeft + ref.current.clientWidth === ref.current.scrollWidth);
-        break;
-      }
+      case ScrollDirection.Right: {}
       case ScrollDirection.Left: {
         setIsLimit(ref.current.scrollLeft === 0);

[NoCoverage] ConditionalExpression
verticals/src/use/autoScroll.ts:56:20
         break;
       }
       case ScrollDirection.Right: {
-        setIsLimit(ref.current.scrollLeft + ref.current.clientWidth === ref.current.scrollWidth);
+        setIsLimit(true);
         break;
       }

[NoCoverage] ArithmeticOperator
verticals/src/use/autoScroll.ts:56:20
         break;
       }
       case ScrollDirection.Right: {
-        setIsLimit(ref.current.scrollLeft + ref.current.clientWidth === ref.current.scrollWidth);
+        setIsLimit(ref.current.scrollLeft - ref.current.clientWidth === ref.current.scrollWidth);
         break;
       }

[NoCoverage] BlockStatement
verticals/src/use/autoScroll.ts:59:34
         setIsLimit(ref.current.scrollLeft + ref.current.clientWidth === ref.current.scrollWidth);
         break;
       }
-      case ScrollDirection.Left: {
-        setIsLimit(ref.current.scrollLeft === 0);
-        break;
-      }
+      case ScrollDirection.Left: {}
       default: break;
     }

[NoCoverage] ConditionalExpression
verticals/src/use/autoScroll.ts:59:7
         setIsLimit(ref.current.scrollLeft + ref.current.clientWidth === ref.current.scrollWidth);
         break;
       }
-      case ScrollDirection.Left: {
-        setIsLimit(ref.current.scrollLeft === 0);
-        break;
-      }
+      case ScrollDirection.Left:
       default: break;
     }

[NoCoverage] EqualityOperator
verticals/src/use/autoScroll.ts:60:20
         break;
       }
       case ScrollDirection.Left: {
-        setIsLimit(ref.current.scrollLeft === 0);
+        setIsLimit(ref.current.scrollLeft !== 0);
         break;
       }

[NoCoverage] ConditionalExpression
verticals/src/use/autoScroll.ts:60:20
         break;
       }
       case ScrollDirection.Left: {
-        setIsLimit(ref.current.scrollLeft === 0);
+        setIsLimit(true);
         break;
       }

[NoCoverage] BlockStatement
verticals/src/use/autoScroll.ts:67:25
     }
   };
 
-  useLayoutEffect(() => {
-    if (observeDirectionLimit !== undefined) {
-      ref.current.addEventListener('scroll', handleScroll);
-      return () => {
-        ref.current.removeEventListener('scroll', handleScroll);
-      };
-    }
-  }, []);
+  useLayoutEffect(() => {}, []);
 
   useEffect(() => {

[NoCoverage] ConditionalExpression
verticals/src/use/autoScroll.ts:68:9
   };
 
   useLayoutEffect(() => {
-    if (observeDirectionLimit !== undefined) {
+    if (true) {
       ref.current.addEventListener('scroll', handleScroll);
       return () => {

[NoCoverage] ConditionalExpression
verticals/src/use/autoScroll.ts:68:9
   };
 
   useLayoutEffect(() => {
-    if (observeDirectionLimit !== undefined) {
+    if (false) {
       ref.current.addEventListener('scroll', handleScroll);
       return () => {

[NoCoverage] BlockStatement
verticals/src/use/autoScroll.ts:70:20
   useLayoutEffect(() => {
     if (observeDirectionLimit !== undefined) {
       ref.current.addEventListener('scroll', handleScroll);
-      return () => {
-        ref.current.removeEventListener('scroll', handleScroll);
-      };
+      return () => {};
     }
   }, []);

[NoCoverage] BlockStatement
verticals/src/use/autoScroll.ts:77:38
   }, []);
 
   useEffect(() => {
-    const timeout = setTimeout(() => {
-      if (!ref.current) return;
-      ref.current.style.scrollBehavior = 'smooth';
-      switch (scrollDirection) {
-        case ScrollDirection.Top: {
-          scrollToTop();
-          break;
-        }
-        case ScrollDirection.Bottom: {
-          scrollToBottom();
-          break;
-        }
-        case ScrollDirection.Right: {
-          scrollToRight();
-          break;
-        }
-        case ScrollDirection.Left: {
-          scrollToLeft();
-          break;
-        }
-        default: break;
-      }
-    }, 100);
+    const timeout = setTimeout(() => {}, 100);
     return () => {
       clearTimeout(timeout);

[NoCoverage] ConditionalExpression
verticals/src/use/autoScroll.ts:78:11
 
   useEffect(() => {
     const timeout = setTimeout(() => {
-      if (!ref.current) return;
+      if (false) return;
       ref.current.style.scrollBehavior = 'smooth';
       switch (scrollDirection) {

[NoCoverage] BooleanLiteral
verticals/src/use/autoScroll.ts:78:11
 
   useEffect(() => {
     const timeout = setTimeout(() => {
-      if (!ref.current) return;
+      if (ref.current) return;
       ref.current.style.scrollBehavior = 'smooth';
       switch (scrollDirection) {

[NoCoverage] ConditionalExpression
verticals/src/use/autoScroll.ts:81:9
       if (!ref.current) return;
       ref.current.style.scrollBehavior = 'smooth';
       switch (scrollDirection) {
-        case ScrollDirection.Top: {
-          scrollToTop();
-          break;
-        }
+        case ScrollDirection.Top:
         case ScrollDirection.Bottom: {
           scrollToBottom();

[NoCoverage] BlockStatement
verticals/src/use/autoScroll.ts:81:35
       if (!ref.current) return;
       ref.current.style.scrollBehavior = 'smooth';
       switch (scrollDirection) {
-        case ScrollDirection.Top: {
-          scrollToTop();
-          break;
-        }
+        case ScrollDirection.Top: {}
         case ScrollDirection.Bottom: {
           scrollToBottom();

[NoCoverage] ConditionalExpression
verticals/src/use/autoScroll.ts:85:9
           scrollToTop();
           break;
         }
-        case ScrollDirection.Bottom: {
-          scrollToBottom();
-          break;
-        }
+        case ScrollDirection.Bottom:
         case ScrollDirection.Right: {
           scrollToRight();

[NoCoverage] BlockStatement
verticals/src/use/autoScroll.ts:85:38
           scrollToTop();
           break;
         }
-        case ScrollDirection.Bottom: {
-          scrollToBottom();
-          break;
-        }
+        case ScrollDirection.Bottom: {}
         case ScrollDirection.Right: {
           scrollToRight();

[NoCoverage] ConditionalExpression
verticals/src/use/autoScroll.ts:89:9
           scrollToBottom();
           break;
         }
-        case ScrollDirection.Right: {
-          scrollToRight();
-          break;
-        }
+        case ScrollDirection.Right:
         case ScrollDirection.Left: {
           scrollToLeft();

[NoCoverage] BlockStatement
verticals/src/use/autoScroll.ts:89:37
           scrollToBottom();
           break;
         }
-        case ScrollDirection.Right: {
-          scrollToRight();
-          break;
-        }
+        case ScrollDirection.Right: {}
         case ScrollDirection.Left: {
           scrollToLeft();

[NoCoverage] ConditionalExpression
verticals/src/use/autoScroll.ts:93:9
           scrollToRight();
           break;
         }
-        case ScrollDirection.Left: {
-          scrollToLeft();
-          break;
-        }
+        case ScrollDirection.Left:
         default: break;
       }

[NoCoverage] BlockStatement
verticals/src/use/autoScroll.ts:93:36
           scrollToRight();
           break;
         }
-        case ScrollDirection.Left: {
-          scrollToLeft();
-          break;
-        }
+        case ScrollDirection.Left: {}
         default: break;
       }
