[NoCoverage] ArrowFunction
verticals/src/use/cancellablePromise.ts:7:32
 export const useCancellablePromises = () => {
   const pendingPromises = useRef<any[]>([]);
 
-  const appendPendingPromise = (promise: any) => (pendingPromises.current = [...pendingPromises.current, promise]);
+  const appendPendingPromise = () => undefined;
 
   const removePendingPromise = (promise: any) => (pendingPromises.current = pendingPromises.current.filter(

[NoCoverage] ArrayDeclaration
verticals/src/use/cancellablePromise.ts:7:77
 export const useCancellablePromises = () => {
   const pendingPromises = useRef<any[]>([]);
 
-  const appendPendingPromise = (promise: any) => (pendingPromises.current = [...pendingPromises.current, promise]);
+  const appendPendingPromise = (promise: any) => (pendingPromises.current = []);
 
   const removePendingPromise = (promise: any) => (pendingPromises.current = pendingPromises.current.filter(

[NoCoverage] ArrowFunction
verticals/src/use/cancellablePromise.ts:9:32
 
   const appendPendingPromise = (promise: any) => (pendingPromises.current = [...pendingPromises.current, promise]);
 
-  const removePendingPromise = (promise: any) => (pendingPromises.current = pendingPromises.current.filter(
-    (p) => p !== promise,
-  ));
+  const removePendingPromise = () => undefined;
 
   const clearPendingPromises = () => pendingPromises.current.map((p) => p.cancel());

[NoCoverage] ArrowFunction
verticals/src/use/cancellablePromise.ts:10:5
   const appendPendingPromise = (promise: any) => (pendingPromises.current = [...pendingPromises.current, promise]);
 
   const removePendingPromise = (promise: any) => (pendingPromises.current = pendingPromises.current.filter(
-    (p) => p !== promise,
+    () => undefined,
   ));
 

[NoCoverage] EqualityOperator
verticals/src/use/cancellablePromise.ts:10:12
   const appendPendingPromise = (promise: any) => (pendingPromises.current = [...pendingPromises.current, promise]);
 
   const removePendingPromise = (promise: any) => (pendingPromises.current = pendingPromises.current.filter(
-    (p) => p !== promise,
+    (p) => p === promise,
   ));
 

[NoCoverage] ArrowFunction
verticals/src/use/cancellablePromise.ts:13:32
     (p) => p !== promise,
   ));
 
-  const clearPendingPromises = () => pendingPromises.current.map((p) => p.cancel());
+  const clearPendingPromises = () => undefined;
 
   const cancellablePromise = (promise: any) => {

[NoCoverage] ArrowFunction
verticals/src/use/cancellablePromise.ts:13:66
     (p) => p !== promise,
   ));
 
-  const clearPendingPromises = () => pendingPromises.current.map((p) => p.cancel());
+  const clearPendingPromises = () => pendingPromises.current.map(() => undefined);
 
   const cancellablePromise = (promise: any) => {

[NoCoverage] BlockStatement
verticals/src/use/cancellablePromise.ts:15:48
 
   const clearPendingPromises = () => pendingPromises.current.map((p) => p.cancel());
 
-  const cancellablePromise = (promise: any) => {
-    let isCanceled = false;
-
-    const wrappedPromise = new Promise((resolve, reject) => {
-      promise.then(
-        (value: any) => (isCanceled ? reject({ isCanceled, value }) : resolve(value)),
-        (error: any) => reject({ isCanceled, error }),
-      );
-    });
-
-    return {
-      promise: wrappedPromise,
-      cancel: () => (isCanceled = true),
-    };
-  };
+  const cancellablePromise = (promise: any) => {};
 
   const delay = (n: number) => new Promise((resolve) => setTimeout(resolve, n));

[NoCoverage] BooleanLiteral
verticals/src/use/cancellablePromise.ts:16:22
   const clearPendingPromises = () => pendingPromises.current.map((p) => p.cancel());
 
   const cancellablePromise = (promise: any) => {
-    let isCanceled = false;
+    let isCanceled = true;
 
     const wrappedPromise = new Promise((resolve, reject) => {

[NoCoverage] BlockStatement
verticals/src/use/cancellablePromise.ts:18:61
   const cancellablePromise = (promise: any) => {
     let isCanceled = false;
 
-    const wrappedPromise = new Promise((resolve, reject) => {
-      promise.then(
-        (value: any) => (isCanceled ? reject({ isCanceled, value }) : resolve(value)),
-        (error: any) => reject({ isCanceled, error }),
-      );
-    });
+    const wrappedPromise = new Promise((resolve, reject) => {});
 
     return {

[NoCoverage] ArrowFunction
verticals/src/use/cancellablePromise.ts:20:9
 
     const wrappedPromise = new Promise((resolve, reject) => {
       promise.then(
-        (value: any) => (isCanceled ? reject({ isCanceled, value }) : resolve(value)),
+        () => undefined,
         (error: any) => reject({ isCanceled, error }),
       );

[NoCoverage] ObjectLiteral
verticals/src/use/cancellablePromise.ts:20:46
 
     const wrappedPromise = new Promise((resolve, reject) => {
       promise.then(
-        (value: any) => (isCanceled ? reject({ isCanceled, value }) : resolve(value)),
+        (value: any) => (isCanceled ? reject({}) : resolve(value)),
         (error: any) => reject({ isCanceled, error }),
       );

[NoCoverage] ArrowFunction
verticals/src/use/cancellablePromise.ts:21:9
     const wrappedPromise = new Promise((resolve, reject) => {
       promise.then(
         (value: any) => (isCanceled ? reject({ isCanceled, value }) : resolve(value)),
-        (error: any) => reject({ isCanceled, error }),
+        () => undefined,
       );
     });

[NoCoverage] ObjectLiteral
verticals/src/use/cancellablePromise.ts:21:32
     const wrappedPromise = new Promise((resolve, reject) => {
       promise.then(
         (value: any) => (isCanceled ? reject({ isCanceled, value }) : resolve(value)),
-        (error: any) => reject({ isCanceled, error }),
+        (error: any) => reject({}),
       );
     });

[NoCoverage] ArrowFunction
verticals/src/use/cancellablePromise.ts:27:15
 
     return {
       promise: wrappedPromise,
-      cancel: () => (isCanceled = true),
+      cancel: () => undefined,
     };
   };

[NoCoverage] BooleanLiteral
verticals/src/use/cancellablePromise.ts:27:35
 
     return {
       promise: wrappedPromise,
-      cancel: () => (isCanceled = true),
+      cancel: () => (isCanceled = false),
     };
   };

[NoCoverage] ArrowFunction
verticals/src/use/cancellablePromise.ts:31:44
     };
   };
 
-  const delay = (n: number) => new Promise((resolve) => setTimeout(resolve, n));
+  const delay = (n: number) => new Promise(() => undefined);
 
   return {

[NoCoverage] ArrowFunction
verticals/src/use/cancellablePromise.ts:31:17
     };
   };
 
-  const delay = (n: number) => new Promise((resolve) => setTimeout(resolve, n));
+  const delay = () => undefined;
 
   return {
