[NoCoverage] BlockStatement
verticals/src/use/clickPreventionOnDoubleClick.ts:17:56
     delay,
   } = useCancellablePromises();
 
-  const handleClick = (event: React.SyntheticEvent) => {
-    if (isStopPropagation) {
-      event.stopPropagation();
-    }
-    clearPendingPromises();
-    const waitForClick = cancellablePromise(delay(200));
-    appendPendingPromise(waitForClick);
-
-    return waitForClick.promise
-      .then(() => {
-        removePendingPromise(waitForClick);
-        onClick?.(event);
-      })
-      .catch((errorInfo: any) => {
-        removePendingPromise(waitForClick);
-        if (!errorInfo.isCanceled) {
-          throw errorInfo.error;
-        }
-      });
-  };
+  const handleClick = (event: React.SyntheticEvent) => {};
 
   const handleDoubleClick = (event: React.SyntheticEvent) => {

[NoCoverage] ConditionalExpression
verticals/src/use/clickPreventionOnDoubleClick.ts:18:9
   } = useCancellablePromises();
 
   const handleClick = (event: React.SyntheticEvent) => {
-    if (isStopPropagation) {
+    if (true) {
       event.stopPropagation();
     }

[NoCoverage] ConditionalExpression
verticals/src/use/clickPreventionOnDoubleClick.ts:18:9
   } = useCancellablePromises();
 
   const handleClick = (event: React.SyntheticEvent) => {
-    if (isStopPropagation) {
+    if (false) {
       event.stopPropagation();
     }

[NoCoverage] BlockStatement
verticals/src/use/clickPreventionOnDoubleClick.ts:26:19
     appendPendingPromise(waitForClick);
 
     return waitForClick.promise
-      .then(() => {
-        removePendingPromise(waitForClick);
-        onClick?.(event);
-      })
+      .then(() => {})
       .catch((errorInfo: any) => {
         removePendingPromise(waitForClick);

[NoCoverage] BlockStatement
verticals/src/use/clickPreventionOnDoubleClick.ts:30:34
         removePendingPromise(waitForClick);
         onClick?.(event);
       })
-      .catch((errorInfo: any) => {
-        removePendingPromise(waitForClick);
-        if (!errorInfo.isCanceled) {
-          throw errorInfo.error;
-        }
-      });
+      .catch((errorInfo: any) => {});
   };
 

[NoCoverage] BlockStatement
verticals/src/use/clickPreventionOnDoubleClick.ts:32:36
       })
       .catch((errorInfo: any) => {
         removePendingPromise(waitForClick);
-        if (!errorInfo.isCanceled) {
-          throw errorInfo.error;
-        }
+        if (!errorInfo.isCanceled) {}
       });
   };

[NoCoverage] ConditionalExpression
verticals/src/use/clickPreventionOnDoubleClick.ts:32:13
       })
       .catch((errorInfo: any) => {
         removePendingPromise(waitForClick);
-        if (!errorInfo.isCanceled) {
+        if (false) {
           throw errorInfo.error;
         }

[NoCoverage] BlockStatement
verticals/src/use/clickPreventionOnDoubleClick.ts:38:62
       });
   };
 
-  const handleDoubleClick = (event: React.SyntheticEvent) => {
-    if (isStopPropagation) {
-      event.stopPropagation();
-    }
-    clearPendingPromises();
-    onDoubleClick?.(event);
-  };
+  const handleDoubleClick = (event: React.SyntheticEvent) => {};
 
   return { handleClick, handleDoubleClick };

[NoCoverage] ConditionalExpression
verticals/src/use/clickPreventionOnDoubleClick.ts:39:9
   };
 
   const handleDoubleClick = (event: React.SyntheticEvent) => {
-    if (isStopPropagation) {
+    if (true) {
       event.stopPropagation();
     }

[NoCoverage] BlockStatement
verticals/src/use/clickPreventionOnDoubleClick.ts:39:28
   };
 
   const handleDoubleClick = (event: React.SyntheticEvent) => {
-    if (isStopPropagation) {
-      event.stopPropagation();
-    }
+    if (isStopPropagation) {}
     clearPendingPromises();
     onDoubleClick?.(event);
