[NoCoverage] BlockStatement
verticals/src/use/colorClass.ts:3:69
 import { EnumColors, IColor } from '@type/entities';
 
-export const useColorClass = (baseClass: string, color?: IColor) => {
-  if (color === undefined || color === null) {
-    return '';
-  }
-  const colorValues = Object.values(EnumColors);
-  const colorString = colorValues[color] as string;
-  return `${baseClass}--${colorString?.toLowerCase()}`;
-};
+export const useColorClass = (baseClass: string, color?: IColor) => {};
 

[NoCoverage] ConditionalExpression
verticals/src/use/colorClass.ts:4:30
 import { EnumColors, IColor } from '@type/entities';
 
 export const useColorClass = (baseClass: string, color?: IColor) => {
-  if (color === undefined || color === null) {
+  if (color === undefined || false) {
     return '';
   }

[NoCoverage] ConditionalExpression
verticals/src/use/colorClass.ts:4:7
 import { EnumColors, IColor } from '@type/entities';
 
 export const useColorClass = (baseClass: string, color?: IColor) => {
-  if (color === undefined || color === null) {
+  if (false) {
     return '';
   }

[NoCoverage] StringLiteral
verticals/src/use/colorClass.ts:5:12
 
 export const useColorClass = (baseClass: string, color?: IColor) => {
   if (color === undefined || color === null) {
-    return '';
+    return "Stryker was here!";
   }
   const colorValues = Object.values(EnumColors);
