[NoCoverage] BlockStatement
verticals/src/use/download.ts:3:34
 import downloadjs from 'downloadjs';
 
-export const useDownload = () => {
-  const download = (link: string) => downloadjs(link);
-
-  return {
-    download,
-  };
-};
+export const useDownload = () => {};
 

[NoCoverage] ArrowFunction
verticals/src/use/download.ts:4:20
 import downloadjs from 'downloadjs';
 
 export const useDownload = () => {
-  const download = (link: string) => downloadjs(link);
+  const download = () => undefined;
 
   return {

[NoCoverage] ObjectLiteral
verticals/src/use/download.ts:6:10
 export const useDownload = () => {
   const download = (link: string) => downloadjs(link);
 
-  return {
-    download,
-  };
+  return {};
 };
 
