[NoCoverage] BlockStatement
verticals/src/use/focus.ts:3:71
 import { useEffect } from 'react';
 
-export const useFocus = (ref?: any, dependencies?: Array<boolean>) => {
-  const focus = (focusRef: any) => {
-    console.log('focusRef.c', focusRef);
-    if (!focusRef.current) return;
-    focusRef.current.focus();
-    focusRef.current.setSelectionRange(focusRef.current.value.length, focusRef.current.value.length);
-  };
-
-  useEffect(() => {
-    const isValid = dependencies?.some((predicate) => predicate);
-    if (isValid) {
-      focus(ref);
-    }
-  }, dependencies);
-
-  return {
-    focus,
-  };
-};
+export const useFocus = (ref?: any, dependencies?: Array<boolean>) => {};
 

[NoCoverage] BlockStatement
verticals/src/use/focus.ts:4:36
 import { useEffect } from 'react';
 
 export const useFocus = (ref?: any, dependencies?: Array<boolean>) => {
-  const focus = (focusRef: any) => {
-    console.log('focusRef.c', focusRef);
-    if (!focusRef.current) return;
-    focusRef.current.focus();
-    focusRef.current.setSelectionRange(focusRef.current.value.length, focusRef.current.value.length);
-  };
+  const focus = (focusRef: any) => {};
 
   useEffect(() => {

[NoCoverage] StringLiteral
verticals/src/use/focus.ts:5:17
 
 export const useFocus = (ref?: any, dependencies?: Array<boolean>) => {
   const focus = (focusRef: any) => {
-    console.log('focusRef.c', focusRef);
+    console.log("", focusRef);
     if (!focusRef.current) return;
     focusRef.current.focus();

[NoCoverage] ConditionalExpression
verticals/src/use/focus.ts:6:9
 export const useFocus = (ref?: any, dependencies?: Array<boolean>) => {
   const focus = (focusRef: any) => {
     console.log('focusRef.c', focusRef);
-    if (!focusRef.current) return;
+    if (false) return;
     focusRef.current.focus();
     focusRef.current.setSelectionRange(focusRef.current.value.length, focusRef.current.value.length);

[NoCoverage] ConditionalExpression
verticals/src/use/focus.ts:6:9
 export const useFocus = (ref?: any, dependencies?: Array<boolean>) => {
   const focus = (focusRef: any) => {
     console.log('focusRef.c', focusRef);
-    if (!focusRef.current) return;
+    if (true) return;
     focusRef.current.focus();
     focusRef.current.setSelectionRange(focusRef.current.value.length, focusRef.current.value.length);

[NoCoverage] BlockStatement
verticals/src/use/focus.ts:11:19
     focusRef.current.setSelectionRange(focusRef.current.value.length, focusRef.current.value.length);
   };
 
-  useEffect(() => {
-    const isValid = dependencies?.some((predicate) => predicate);
-    if (isValid) {
-      focus(ref);
-    }
-  }, dependencies);
+  useEffect(() => {}, dependencies);
 
   return {

[NoCoverage] ArrowFunction
verticals/src/use/focus.ts:12:40
   };
 
   useEffect(() => {
-    const isValid = dependencies?.some((predicate) => predicate);
+    const isValid = dependencies?.some(() => undefined);
     if (isValid) {
       focus(ref);

[NoCoverage] ConditionalExpression
verticals/src/use/focus.ts:13:9
 
   useEffect(() => {
     const isValid = dependencies?.some((predicate) => predicate);
-    if (isValid) {
+    if (false) {
       focus(ref);
     }

[NoCoverage] BlockStatement
verticals/src/use/focus.ts:13:18
 
   useEffect(() => {
     const isValid = dependencies?.some((predicate) => predicate);
-    if (isValid) {
-      focus(ref);
-    }
+    if (isValid) {}
   }, dependencies);
 
