[NoCoverage] BlockStatement
verticals/src/use/form.ts:49:8
 
   const handleValidatorResult = (
     key: string, value: IValidatorPayload, error: IValidatorResult,
-  ) => {
-    setValues((prev) => ({ ...prev, [key]: value }));
-    setErrors((prev) => ({ ...prev, [key]: error?.message! }));
-  };
+  ) => {};
 
   const initialValuesKeys = Object.keys(initialValues);

[NoCoverage] ArrowFunction
verticals/src/use/form.ts:50:15
   const handleValidatorResult = (
     key: string, value: IValidatorPayload, error: IValidatorResult,
   ) => {
-    setValues((prev) => ({ ...prev, [key]: value }));
+    setValues(() => undefined);
     setErrors((prev) => ({ ...prev, [key]: error?.message! }));
   };

[NoCoverage] ArrowFunction
verticals/src/use/form.ts:51:15
     key: string, value: IValidatorPayload, error: IValidatorResult,
   ) => {
     setValues((prev) => ({ ...prev, [key]: value }));
-    setErrors((prev) => ({ ...prev, [key]: error?.message! }));
+    setErrors(() => undefined);
   };
 

[NoCoverage] BlockStatement
verticals/src/use/form.ts:55:38
   };
 
   const initialValuesKeys = Object.keys(initialValues);
-  initialValuesKeys.forEach((key) => {
-    validators[key] = useValidator(
-      initialValues[key],
-      formValidator[key],
-      undefined,
-      (...rest) => handleValidatorResult(key, ...rest),
-    );
-  });
+  initialValuesKeys.forEach((key) => {});
 
   const handleChange = (event: React.BaseSyntheticEvent) => {

[NoCoverage] ArrowFunction
verticals/src/use/form.ts:60:7
       initialValues[key],
       formValidator[key],
       undefined,
-      (...rest) => handleValidatorResult(key, ...rest),
+      () => undefined,
     );
   });

[NoCoverage] BlockStatement
verticals/src/use/form.ts:64:61
     );
   });
 
-  const handleChange = (event: React.BaseSyntheticEvent) => {
-    const { name } = event.target;
-    validators[name].handleChange(event);
-  };
+  const handleChange = (event: React.BaseSyntheticEvent) => {};
 
   const handleSubmit = (event: React.BaseSyntheticEvent) => {

[NoCoverage] BlockStatement
verticals/src/use/form.ts:69:61
     validators[name].handleChange(event);
   };
 
-  const handleSubmit = (event: React.BaseSyntheticEvent) => {
-    if (event) {
-      event.preventDefault();
-    }
-
-    const validatorsKeys = Object.keys(validators);
-    const allTouched: IFormTouched = validatorsKeys
-      .reduce((acc, value) => ({
-        ...acc,
-        [value]: true,
-      }), {});
-    setTouches(allTouched);
-
-    const errorsKeys = Object.keys(errors);
-    const isValidForm = errorsKeys.every((key) => !errors[key]);
-
-    if (isValidForm) {
-      callback(values as any);
-    }
-  };
+  const handleSubmit = (event: React.BaseSyntheticEvent) => {};
 
   const handleBlur = (event: React.BaseSyntheticEvent, selectName?: string) => {

[NoCoverage] ConditionalExpression
verticals/src/use/form.ts:70:9
   };
 
   const handleSubmit = (event: React.BaseSyntheticEvent) => {
-    if (event) {
+    if (true) {
       event.preventDefault();
     }

[NoCoverage] ConditionalExpression
verticals/src/use/form.ts:70:9
   };
 
   const handleSubmit = (event: React.BaseSyntheticEvent) => {
-    if (event) {
+    if (false) {
       event.preventDefault();
     }

[NoCoverage] ArrowFunction
verticals/src/use/form.ts:76:15
 
     const validatorsKeys = Object.keys(validators);
     const allTouched: IFormTouched = validatorsKeys
-      .reduce((acc, value) => ({
-        ...acc,
-        [value]: true,
-      }), {});
+      .reduce(() => undefined, {});
     setTouches(allTouched);
 

[NoCoverage] ObjectLiteral
verticals/src/use/form.ts:76:32
 
     const validatorsKeys = Object.keys(validators);
     const allTouched: IFormTouched = validatorsKeys
-      .reduce((acc, value) => ({
-        ...acc,
-        [value]: true,
-      }), {});
+      .reduce((acc, value) => ({}), {});
     setTouches(allTouched);
 

[NoCoverage] BooleanLiteral
verticals/src/use/form.ts:78:18
     const allTouched: IFormTouched = validatorsKeys
       .reduce((acc, value) => ({
         ...acc,
-        [value]: true,
+        [value]: false,
       }), {});
     setTouches(allTouched);

[NoCoverage] BooleanLiteral
verticals/src/use/form.ts:83:51
     setTouches(allTouched);
 
     const errorsKeys = Object.keys(errors);
-    const isValidForm = errorsKeys.every((key) => !errors[key]);
+    const isValidForm = errorsKeys.every((key) => errors[key]);
 
     if (isValidForm) {

[NoCoverage] ArrowFunction
verticals/src/use/form.ts:83:42
     setTouches(allTouched);
 
     const errorsKeys = Object.keys(errors);
-    const isValidForm = errorsKeys.every((key) => !errors[key]);
+    const isValidForm = errorsKeys.every(() => undefined);
 
     if (isValidForm) {

[NoCoverage] ConditionalExpression
verticals/src/use/form.ts:85:9
     const errorsKeys = Object.keys(errors);
     const isValidForm = errorsKeys.every((key) => !errors[key]);
 
-    if (isValidForm) {
+    if (false) {
       callback(values as any);
     }

[NoCoverage] ConditionalExpression
verticals/src/use/form.ts:85:9
     const errorsKeys = Object.keys(errors);
     const isValidForm = errorsKeys.every((key) => !errors[key]);
 
-    if (isValidForm) {
+    if (true) {
       callback(values as any);
     }

[NoCoverage] BlockStatement
verticals/src/use/form.ts:90:80
     }
   };
 
-  const handleBlur = (event: React.BaseSyntheticEvent, selectName?: string) => {
-    const { target } = event;
-    const name = target?.name ?? selectName;
-    setTouches(() => ({
-      ...touches,
-      [name]: true,
-    }));
-  };
+  const handleBlur = (event: React.BaseSyntheticEvent, selectName?: string) => {};
 
   return {

[NoCoverage] ArrowFunction
verticals/src/use/form.ts:93:16
   const handleBlur = (event: React.BaseSyntheticEvent, selectName?: string) => {
     const { target } = event;
     const name = target?.name ?? selectName;
-    setTouches(() => ({
-      ...touches,
-      [name]: true,
-    }));
+    setTouches(() => undefined);
   };
 

[NoCoverage] BooleanLiteral
verticals/src/use/form.ts:95:15
     const name = target?.name ?? selectName;
     setTouches(() => ({
       ...touches,
-      [name]: true,
+      [name]: false,
     }));
   };
