[NoCoverage] BlockStatement
verticals/src/use/hover.ts:3:31
 import { useState } from 'react';
 
-export const useHover = () => {
-  const [isHovering, setIsHovering] = useState<boolean>(false);
-
-  return {
-    isHovering,
-    hoveringProps: {
-      onMouseEnter: () => {
-        setIsHovering(true);
-      },
-      onMouseLeave: () => {
-        setIsHovering(false);
-      },
-      // onMouseOver: () => {
-      //   setIsHovering(true);
-      // },
-      // onMouseOut: () => {
-      //   setIsHovering(false);
-      // },
-    },
-  };
-};
+export const useHover = () => {};
 

[NoCoverage] BooleanLiteral
verticals/src/use/hover.ts:4:57
 import { useState } from 'react';
 
 export const useHover = () => {
-  const [isHovering, setIsHovering] = useState<boolean>(false);
+  const [isHovering, setIsHovering] = useState<boolean>(true);
 
   return {

[NoCoverage] BlockStatement
verticals/src/use/hover.ts:9:27
   return {
     isHovering,
     hoveringProps: {
-      onMouseEnter: () => {
-        setIsHovering(true);
-      },
+      onMouseEnter: () => {},
       onMouseLeave: () => {
         setIsHovering(false);

[NoCoverage] BooleanLiteral
verticals/src/use/hover.ts:10:23
     isHovering,
     hoveringProps: {
       onMouseEnter: () => {
-        setIsHovering(true);
+        setIsHovering(false);
       },
       onMouseLeave: () => {

[NoCoverage] BlockStatement
verticals/src/use/hover.ts:12:27
       onMouseEnter: () => {
         setIsHovering(true);
       },
-      onMouseLeave: () => {
-        setIsHovering(false);
-      },
+      onMouseLeave: () => {},
       // onMouseOver: () => {
       //   setIsHovering(true);

[NoCoverage] BooleanLiteral
verticals/src/use/hover.ts:13:23
         setIsHovering(true);
       },
       onMouseLeave: () => {
-        setIsHovering(false);
+        setIsHovering(true);
       },
       // onMouseOver: () => {
