[NoCoverage] BooleanLiteral
verticals/src/use/markdown.ts:21:16
 
 // @ts-ignore
 const md = new MarkdownIt({
-  typographer: true,
+  typographer: false,
   linkify: true,
   xhtmlOut: true,

[NoCoverage] BooleanLiteral
verticals/src/use/markdown.ts:22:12
 // @ts-ignore
 const md = new MarkdownIt({
   typographer: true,
-  linkify: true,
+  linkify: false,
   xhtmlOut: true,
   breaks: true,

[NoCoverage] BooleanLiteral
verticals/src/use/markdown.ts:23:13
 const md = new MarkdownIt({
   typographer: true,
   linkify: true,
-  xhtmlOut: true,
+  xhtmlOut: false,
   breaks: true,
   highlight(str, lang) {

[NoCoverage] BooleanLiteral
verticals/src/use/markdown.ts:24:11
   typographer: true,
   linkify: true,
   xhtmlOut: true,
-  breaks: true,
+  breaks: false,
   highlight(str, lang) {
     if (lang && hljs.getLanguage(lang)) {

[NoCoverage] BlockStatement
verticals/src/use/markdown.ts:25:24
   linkify: true,
   xhtmlOut: true,
   breaks: true,
-  highlight(str, lang) {
-    if (lang && hljs.getLanguage(lang)) {
-      try {
-        return `<pre class="hljs"><code>${
-          hljs.highlight(lang, str, true).value
-        }</code></pre>`;
-      } catch (e) { console.error(e); }
-    }
-    return `<pre class="hljs"><code>${md.utils.escapeHtml(str)}</code></pre>`;
-  },
+  highlight(str, lang) {},
 });
 

[NoCoverage] ConditionalExpression
verticals/src/use/markdown.ts:26:9
   xhtmlOut: true,
   breaks: true,
   highlight(str, lang) {
-    if (lang && hljs.getLanguage(lang)) {
+    if (true) {
       try {
         return `<pre class="hljs"><code>${

[NoCoverage] LogicalOperator
verticals/src/use/markdown.ts:26:9
   xhtmlOut: true,
   breaks: true,
   highlight(str, lang) {
-    if (lang && hljs.getLanguage(lang)) {
+    if (lang || hljs.getLanguage(lang)) {
       try {
         return `<pre class="hljs"><code>${

[NoCoverage] BlockStatement
verticals/src/use/markdown.ts:27:11
   breaks: true,
   highlight(str, lang) {
     if (lang && hljs.getLanguage(lang)) {
-      try {
-        return `<pre class="hljs"><code>${
-          hljs.highlight(lang, str, true).value
-        }</code></pre>`;
-      } catch (e) { console.error(e); }
+      try {} catch (e) { console.error(e); }
     }
     return `<pre class="hljs"><code>${md.utils.escapeHtml(str)}</code></pre>`;

[NoCoverage] BooleanLiteral
verticals/src/use/markdown.ts:29:37
     if (lang && hljs.getLanguage(lang)) {
       try {
         return `<pre class="hljs"><code>${
-          hljs.highlight(lang, str, true).value
+          hljs.highlight(lang, str, false).value
         }</code></pre>`;
       } catch (e) { console.error(e); }

[NoCoverage] BlockStatement
verticals/src/use/markdown.ts:31:19
         return `<pre class="hljs"><code>${
           hljs.highlight(lang, str, true).value
         }</code></pre>`;
-      } catch (e) { console.error(e); }
+      } catch (e) {}
     }
     return `<pre class="hljs"><code>${md.utils.escapeHtml(str)}</code></pre>`;

[NoCoverage] BlockStatement
verticals/src/use/markdown.ts:45:34
   .use(MarkdownItFootnote)
   .use(MarkdownItDeflist);
 
-export const useMarkdown = () => {
-  const renderMarkdown = (data: string) => md.render(data);
-
-  return {
-    renderMarkdown,
-  };
-};
+export const useMarkdown = () => {};
 

[NoCoverage] ArrowFunction
verticals/src/use/markdown.ts:46:26
   .use(MarkdownItDeflist);
 
 export const useMarkdown = () => {
-  const renderMarkdown = (data: string) => md.render(data);
+  const renderMarkdown = () => undefined;
 
   return {
