[NoCoverage] BlockStatement
verticals/src/use/normalizeDate.ts:5:39
 import subMinutes from 'date-fns/subMinutes';
 import addMinutes from 'date-fns/addMinutes';
 
-export const useNormalizeDate = () => {
-  const normalizeDate = (date: Date | number | null) => {
-    if (date == null) {
-      return null;
-    }
-    if (typeof date === 'number') {
-      date = new Date(date);
-    }
-    const offset = date.getTimezoneOffset();
-    const sign = Math.sign(offset);
-    const calculateDateWithOffset = sign === -1 ? subMinutes : addMinutes;
-    return calculateDateWithOffset(date, offset);
-  };
-
-  return {
-    normalizeDate,
-  };
-};
+export const useNormalizeDate = () => {};
 

[NoCoverage] BlockStatement
verticals/src/use/normalizeDate.ts:6:57
 import addMinutes from 'date-fns/addMinutes';
 
 export const useNormalizeDate = () => {
-  const normalizeDate = (date: Date | number | null) => {
-    if (date == null) {
-      return null;
-    }
-    if (typeof date === 'number') {
-      date = new Date(date);
-    }
-    const offset = date.getTimezoneOffset();
-    const sign = Math.sign(offset);
-    const calculateDateWithOffset = sign === -1 ? subMinutes : addMinutes;
-    return calculateDateWithOffset(date, offset);
-  };
+  const normalizeDate = (date: Date | number | null) => {};
 
   return {

[NoCoverage] ConditionalExpression
verticals/src/use/normalizeDate.ts:7:9
 
 export const useNormalizeDate = () => {
   const normalizeDate = (date: Date | number | null) => {
-    if (date == null) {
+    if (false) {
       return null;
     }

[NoCoverage] EqualityOperator
verticals/src/use/normalizeDate.ts:7:9
 
 export const useNormalizeDate = () => {
   const normalizeDate = (date: Date | number | null) => {
-    if (date == null) {
+    if (date != null) {
       return null;
     }

[NoCoverage] EqualityOperator
verticals/src/use/normalizeDate.ts:10:9
     if (date == null) {
       return null;
     }
-    if (typeof date === 'number') {
+    if (typeof date !== 'number') {
       date = new Date(date);
     }

[NoCoverage] ConditionalExpression
verticals/src/use/normalizeDate.ts:10:9
     if (date == null) {
       return null;
     }
-    if (typeof date === 'number') {
+    if (false) {
       date = new Date(date);
     }

[NoCoverage] ConditionalExpression
verticals/src/use/normalizeDate.ts:15:37
     }
     const offset = date.getTimezoneOffset();
     const sign = Math.sign(offset);
-    const calculateDateWithOffset = sign === -1 ? subMinutes : addMinutes;
+    const calculateDateWithOffset = false ? subMinutes : addMinutes;
     return calculateDateWithOffset(date, offset);
   };

[NoCoverage] UnaryOperator
verticals/src/use/normalizeDate.ts:15:46
     }
     const offset = date.getTimezoneOffset();
     const sign = Math.sign(offset);
-    const calculateDateWithOffset = sign === -1 ? subMinutes : addMinutes;
+    const calculateDateWithOffset = sign === +1 ? subMinutes : addMinutes;
     return calculateDateWithOffset(date, offset);
   };
