[NoCoverage] BlockStatement
verticals/src/use/openFiles.ts:15:51
 export const useOpenFiles: IUseOpenFiles = () => {
   const { restrictFileSize } = useFileList();
 
-  const dispatchClick = (element: HTMLElement) => {
-    const eventMouse = document.createEvent('MouseEvents');
-    eventMouse.initMouseEvent('click', true, false, window, 0, 0, 0, 0, 0, false, false, false, false, 0, null);
-    element.dispatchEvent(eventMouse);
-  };
+  const dispatchClick = (element: HTMLElement) => {};
 
   const openFiles = (

[NoCoverage] BooleanLiteral
verticals/src/use/openFiles.ts:17:46
 
   const dispatchClick = (element: HTMLElement) => {
     const eventMouse = document.createEvent('MouseEvents');
-    eventMouse.initMouseEvent('click', true, false, window, 0, 0, 0, 0, 0, false, false, false, false, 0, null);
+    eventMouse.initMouseEvent('click', true, true, window, 0, 0, 0, 0, 0, false, false, false, false, 0, null);
     element.dispatchEvent(eventMouse);
   };

[NoCoverage] BooleanLiteral
verticals/src/use/openFiles.ts:17:83
 
   const dispatchClick = (element: HTMLElement) => {
     const eventMouse = document.createEvent('MouseEvents');
-    eventMouse.initMouseEvent('click', true, false, window, 0, 0, 0, 0, 0, false, false, false, false, 0, null);
+    eventMouse.initMouseEvent('click', true, false, window, 0, 0, 0, 0, 0, false, true, false, false, 0, null);
     element.dispatchEvent(eventMouse);
   };

[NoCoverage] ArrowFunction
verticals/src/use/openFiles.ts:21:21
     element.dispatchEvent(eventMouse);
   };
 
-  const openFiles = (
-    accept = '',
-    isMultiple = true,
-  ) => new Promise<FileList | null>((resolve) => {
-    const root = document.querySelector('#root')!;
-    const fileInput = document.createElement('input');
-    fileInput.multiple = isMultiple;
-    fileInput.accept = accept;
-    fileInput.type = 'file';
-    fileInput.style.display = 'none';
-    fileInput.onchange = (event: Event) => {
-      const { files } = event.target as HTMLInputElement;
-      root.removeChild(fileInput);
-      const filteredFiles = restrictFileSize(files, MAX_FILE_SIZE);
-      return resolve(filteredFiles);
-    };
-
-    root.appendChild(fileInput);
-    dispatchClick(fileInput);
-  });
+  const openFiles = () => undefined;
 
   return {

[NoCoverage] StringLiteral
verticals/src/use/openFiles.ts:22:14
   };
 
   const openFiles = (
-    accept = '',
+    accept = "Stryker was here!",
     isMultiple = true,
   ) => new Promise<FileList | null>((resolve) => {

[NoCoverage] BooleanLiteral
verticals/src/use/openFiles.ts:23:18
 
   const openFiles = (
     accept = '',
-    isMultiple = true,
+    isMultiple = false,
   ) => new Promise<FileList | null>((resolve) => {
     const root = document.querySelector('#root')!;

[NoCoverage] BlockStatement
verticals/src/use/openFiles.ts:24:50
   const openFiles = (
     accept = '',
     isMultiple = true,
-  ) => new Promise<FileList | null>((resolve) => {
-    const root = document.querySelector('#root')!;
-    const fileInput = document.createElement('input');
-    fileInput.multiple = isMultiple;
-    fileInput.accept = accept;
-    fileInput.type = 'file';
-    fileInput.style.display = 'none';
-    fileInput.onchange = (event: Event) => {
-      const { files } = event.target as HTMLInputElement;
-      root.removeChild(fileInput);
-      const filteredFiles = restrictFileSize(files, MAX_FILE_SIZE);
-      return resolve(filteredFiles);
-    };
-
-    root.appendChild(fileInput);
-    dispatchClick(fileInput);
-  });
+  ) => new Promise<FileList | null>((resolve) => {});
 
   return {

[NoCoverage] StringLiteral
verticals/src/use/openFiles.ts:26:46
     isMultiple = true,
   ) => new Promise<FileList | null>((resolve) => {
     const root = document.querySelector('#root')!;
-    const fileInput = document.createElement('input');
+    const fileInput = document.createElement("");
     fileInput.multiple = isMultiple;
     fileInput.accept = accept;

[NoCoverage] StringLiteral
verticals/src/use/openFiles.ts:29:22
     const fileInput = document.createElement('input');
     fileInput.multiple = isMultiple;
     fileInput.accept = accept;
-    fileInput.type = 'file';
+    fileInput.type = "";
     fileInput.style.display = 'none';
     fileInput.onchange = (event: Event) => {

[NoCoverage] BlockStatement
verticals/src/use/openFiles.ts:31:44
     fileInput.accept = accept;
     fileInput.type = 'file';
     fileInput.style.display = 'none';
-    fileInput.onchange = (event: Event) => {
-      const { files } = event.target as HTMLInputElement;
-      root.removeChild(fileInput);
-      const filteredFiles = restrictFileSize(files, MAX_FILE_SIZE);
-      return resolve(filteredFiles);
-    };
+    fileInput.onchange = (event: Event) => {};
 
     root.appendChild(fileInput);
