[NoCoverage] BlockStatement
verticals/src/use/paramSelector.ts:8:6
 export const useParamSelector = <Args extends any, Value>(
   parametrizedSelectorCreator: (args: Args) => (state: IRootState) => Value,
   param: Args,
-) => {
-  const memoizedSelector = useMemo(() => parametrizedSelectorCreator(param), [param]);
-
-  return useSelector(memoizedSelector);
-};
+) => {};
 

[NoCoverage] ArrowFunction
verticals/src/use/paramSelector.ts:9:36
   parametrizedSelectorCreator: (args: Args) => (state: IRootState) => Value,
   param: Args,
 ) => {
-  const memoizedSelector = useMemo(() => parametrizedSelectorCreator(param), [param]);
+  const memoizedSelector = useMemo(() => undefined, [param]);
 
   return useSelector(memoizedSelector);
