[NoCoverage] BlockStatement
verticals/src/use/readableId.ts:3:36
 import slugify from '@sindresorhus/slugify';
 
-export const useReadableId = () => {
-  const toReadableId = (name: string, id: number) => `${slugify(name)}-${id.toString(36)}`;
-
-  const toNumericId = (readableId: string) => {
-    const splitted = readableId.split('-');
-    const stringedId = splitted[splitted.length - 1];
-    return parseInt(stringedId, 36);
-  };
-
-  return {
-    toReadableId,
-    toNumericId,
-  };
-};
+export const useReadableId = () => {};
 

[NoCoverage] ArrowFunction
verticals/src/use/readableId.ts:4:24
 import slugify from '@sindresorhus/slugify';
 
 export const useReadableId = () => {
-  const toReadableId = (name: string, id: number) => `${slugify(name)}-${id.toString(36)}`;
+  const toReadableId = () => undefined;
 
   const toNumericId = (readableId: string) => {

[NoCoverage] StringLiteral
verticals/src/use/readableId.ts:4:54
 import slugify from '@sindresorhus/slugify';
 
 export const useReadableId = () => {
-  const toReadableId = (name: string, id: number) => `${slugify(name)}-${id.toString(36)}`;
+  const toReadableId = (name: string, id: number) => ``;
 
   const toNumericId = (readableId: string) => {

[NoCoverage] BlockStatement
verticals/src/use/readableId.ts:6:47
 export const useReadableId = () => {
   const toReadableId = (name: string, id: number) => `${slugify(name)}-${id.toString(36)}`;
 
-  const toNumericId = (readableId: string) => {
-    const splitted = readableId.split('-');
-    const stringedId = splitted[splitted.length - 1];
-    return parseInt(stringedId, 36);
-  };
+  const toNumericId = (readableId: string) => {};
 
   return {

[NoCoverage] ArithmeticOperator
verticals/src/use/readableId.ts:8:33
 
   const toNumericId = (readableId: string) => {
     const splitted = readableId.split('-');
-    const stringedId = splitted[splitted.length - 1];
+    const stringedId = splitted[splitted.length + 1];
     return parseInt(stringedId, 36);
   };

[NoCoverage] ObjectLiteral
verticals/src/use/readableId.ts:12:10
     return parseInt(stringedId, 36);
   };
 
-  return {
-    toReadableId,
-    toNumericId,
-  };
+  return {};
 };
 
