[NoCoverage] BlockStatement
src/use/resizable/index.tsx:16:19
   const [state, dispatch] = useReducer<Reducer<IResizableState, any>>(resizableReducer, option);
   const group = directionMap[state.direction];
 
-  useEffect(() => {
-    if (option.size) {
-      dispatch(actions.init({
-        size: option.size,
-      }));
-    }
-  }, [option.size]);
+  useEffect(() => {}, [option.size]);
 
   const handleStartMove = useCallback((event: React.MouseEvent | React.TouchEvent) => {

[NoCoverage] BlockStatement
src/use/resizable/index.tsx:17:22
   const group = directionMap[state.direction];
 
   useEffect(() => {
-    if (option.size) {
-      dispatch(actions.init({
-        size: option.size,
-      }));
-    }
+    if (option.size) {}
   }, [option.size]);
 

[NoCoverage] ConditionalExpression
src/use/resizable/index.tsx:17:9
   const group = directionMap[state.direction];
 
   useEffect(() => {
-    if (option.size) {
+    if (true) {
       dispatch(actions.init({
         size: option.size,

[NoCoverage] BlockStatement
src/use/resizable/index.tsx:24:87
     }
   }, [option.size]);
 
-  const handleStartMove = useCallback((event: React.MouseEvent | React.TouchEvent) => {
-    dispatch(actions.start({
-      position: getPositionFromMouseOrTouch(group, event.nativeEvent),
-    }));
-  }, [group]);
+  const handleStartMove = useCallback((event: React.MouseEvent | React.TouchEvent) => {}, [group]);
 
   useEffect(() => {

[NoCoverage] ArrayDeclaration
src/use/resizable/index.tsx:28:6
     dispatch(actions.start({
       position: getPositionFromMouseOrTouch(group, event.nativeEvent),
     }));
-  }, [group]);
+  }, []);
 
   useEffect(() => {

[NoCoverage] BlockStatement
src/use/resizable/index.tsx:30:19
     }));
   }, [group]);
 
-  useEffect(() => {
-    if (!option.size && ref.current) {
-      dispatch(actions.init({
-        size: group === 'vertical'
-          ? ref.current.offsetHeight
-          : ref.current.offsetWidth,
-      }));
-    }
-  }, [option.size, group]);
+  useEffect(() => {}, [option.size, group]);
 
   useEffect(() => {

[NoCoverage] LogicalOperator
src/use/resizable/index.tsx:31:9
   }, [group]);
 
   useEffect(() => {
-    if (!option.size && ref.current) {
+    if (!option.size || ref.current) {
       dispatch(actions.init({
         size: group === 'vertical'

[NoCoverage] BlockStatement
src/use/resizable/index.tsx:31:38
   }, [group]);
 
   useEffect(() => {
-    if (!option.size && ref.current) {
-      dispatch(actions.init({
-        size: group === 'vertical'
-          ? ref.current.offsetHeight
-          : ref.current.offsetWidth,
-      }));
-    }
+    if (!option.size && ref.current) {}
   }, [option.size, group]);
 

[NoCoverage] EqualityOperator
src/use/resizable/index.tsx:33:15
   useEffect(() => {
     if (!option.size && ref.current) {
       dispatch(actions.init({
-        size: group === 'vertical'
+        size: group !== 'vertical'
           ? ref.current.offsetHeight
           : ref.current.offsetWidth,

[NoCoverage] ConditionalExpression
src/use/resizable/index.tsx:33:15
   useEffect(() => {
     if (!option.size && ref.current) {
       dispatch(actions.init({
-        size: group === 'vertical'
+        size: false
           ? ref.current.offsetHeight
           : ref.current.offsetWidth,

[NoCoverage] BlockStatement
src/use/resizable/index.tsx:40:19
     }
   }, [option.size, group]);
 
-  useEffect(() => {
-    if (state.isMove && state.size !== undefined) {
-      option.onResize?.(state.size);
-    }
-  }, [state.size, state.isMove]);
+  useEffect(() => {}, [state.size, state.isMove]);
 
   useEffect(() => {

[NoCoverage] BlockStatement
src/use/resizable/index.tsx:41:51
   }, [option.size, group]);
 
   useEffect(() => {
-    if (state.isMove && state.size !== undefined) {
-      option.onResize?.(state.size);
-    }
+    if (state.isMove && state.size !== undefined) {}
   }, [state.size, state.isMove]);
 

[NoCoverage] EqualityOperator
src/use/resizable/index.tsx:41:25
   }, [option.size, group]);
 
   useEffect(() => {
-    if (state.isMove && state.size !== undefined) {
+    if (state.isMove && state.size === undefined) {
       option.onResize?.(state.size);
     }

[NoCoverage] ArrayDeclaration
src/use/resizable/index.tsx:44:6
     if (state.isMove && state.size !== undefined) {
       option.onResize?.(state.size);
     }
-  }, [state.size, state.isMove]);
+  }, []);
 
   useEffect(() => {

[NoCoverage] BlockStatement
src/use/resizable/index.tsx:46:19
     }
   }, [state.size, state.isMove]);
 
-  useEffect(() => {
-    const handleEvent = (event: MouseEvent | TouchEvent) => {
-      if (event.type.includes('move')) {
-        dispatch(actions.move({
-          position: getPositionFromMouseOrTouch(group, event),
-        }));
-      } else {
-        dispatch(actions.end());
-      }
-    };
-    if (state.isMove) {
-      // @ts-ignore
-      windowEvents.forEach((type) => window.addEventListener(type, handleEvent));
-      document.body.style.cursor = group === 'vertical' ? 'row-resize !important' : 'ew-resize !important';
-      document.body.style.userSelect = 'none';
-    }
-    return () => {
-      // @ts-ignore
-      windowEvents.forEach((type) => window.removeEventListener(type, handleEvent));
-      document.body.style.cursor = '';
-      document.body.style.userSelect = '';
-    };
-  }, [state.isMove, group]);
+  useEffect(() => {}, [state.isMove, group]);
 
   return {

[NoCoverage] BlockStatement
src/use/resizable/index.tsx:47:61
   }, [state.size, state.isMove]);
 
   useEffect(() => {
-    const handleEvent = (event: MouseEvent | TouchEvent) => {
-      if (event.type.includes('move')) {
-        dispatch(actions.move({
-          position: getPositionFromMouseOrTouch(group, event),
-        }));
-      } else {
-        dispatch(actions.end());
-      }
-    };
+    const handleEvent = (event: MouseEvent | TouchEvent) => {};
     if (state.isMove) {
       // @ts-ignore

[NoCoverage] BlockStatement
src/use/resizable/index.tsx:48:40
 
   useEffect(() => {
     const handleEvent = (event: MouseEvent | TouchEvent) => {
-      if (event.type.includes('move')) {
-        dispatch(actions.move({
-          position: getPositionFromMouseOrTouch(group, event),
-        }));
-      } else {
+      if (event.type.includes('move')) {} else {
         dispatch(actions.end());
       }

[NoCoverage] ConditionalExpression
src/use/resizable/index.tsx:48:11
 
   useEffect(() => {
     const handleEvent = (event: MouseEvent | TouchEvent) => {
-      if (event.type.includes('move')) {
+      if (true) {
         dispatch(actions.move({
           position: getPositionFromMouseOrTouch(group, event),

[NoCoverage] BlockStatement
src/use/resizable/index.tsx:52:14
         dispatch(actions.move({
           position: getPositionFromMouseOrTouch(group, event),
         }));
-      } else {
-        dispatch(actions.end());
-      }
+      } else {}
     };
     if (state.isMove) {

[NoCoverage] ConditionalExpression
src/use/resizable/index.tsx:56:9
         dispatch(actions.end());
       }
     };
-    if (state.isMove) {
+    if (true) {
       // @ts-ignore
       windowEvents.forEach((type) => window.addEventListener(type, handleEvent));

[NoCoverage] BlockStatement
src/use/resizable/index.tsx:56:23
         dispatch(actions.end());
       }
     };
-    if (state.isMove) {
-      // @ts-ignore
-      windowEvents.forEach((type) => window.addEventListener(type, handleEvent));
-      document.body.style.cursor = group === 'vertical' ? 'row-resize !important' : 'ew-resize !important';
-      document.body.style.userSelect = 'none';
-    }
+    if (state.isMove) {}
     return () => {
       // @ts-ignore

[NoCoverage] ArrowFunction
src/use/resizable/index.tsx:58:28
     };
     if (state.isMove) {
       // @ts-ignore
-      windowEvents.forEach((type) => window.addEventListener(type, handleEvent));
+      windowEvents.forEach(() => undefined);
       document.body.style.cursor = group === 'vertical' ? 'row-resize !important' : 'ew-resize !important';
       document.body.style.userSelect = 'none';

[NoCoverage] ConditionalExpression
src/use/resizable/index.tsx:59:36
     if (state.isMove) {
       // @ts-ignore
       windowEvents.forEach((type) => window.addEventListener(type, handleEvent));
-      document.body.style.cursor = group === 'vertical' ? 'row-resize !important' : 'ew-resize !important';
+      document.body.style.cursor = false ? 'row-resize !important' : 'ew-resize !important';
       document.body.style.userSelect = 'none';
     }

[NoCoverage] ConditionalExpression
src/use/resizable/index.tsx:59:36
     if (state.isMove) {
       // @ts-ignore
       windowEvents.forEach((type) => window.addEventListener(type, handleEvent));
-      document.body.style.cursor = group === 'vertical' ? 'row-resize !important' : 'ew-resize !important';
+      document.body.style.cursor = true ? 'row-resize !important' : 'ew-resize !important';
       document.body.style.userSelect = 'none';
     }

[NoCoverage] BlockStatement
src/use/resizable/index.tsx:62:18
       document.body.style.cursor = group === 'vertical' ? 'row-resize !important' : 'ew-resize !important';
       document.body.style.userSelect = 'none';
     }
-    return () => {
-      // @ts-ignore
-      windowEvents.forEach((type) => window.removeEventListener(type, handleEvent));
-      document.body.style.cursor = '';
-      document.body.style.userSelect = '';
-    };
+    return () => {};
   }, [state.isMove, group]);
 

[NoCoverage] ArrowFunction
src/use/resizable/index.tsx:64:28
     }
     return () => {
       // @ts-ignore
-      windowEvents.forEach((type) => window.removeEventListener(type, handleEvent));
+      windowEvents.forEach(() => undefined);
       document.body.style.cursor = '';
       document.body.style.userSelect = '';

[NoCoverage] StringLiteral
src/use/resizable/index.tsx:65:36
     return () => {
       // @ts-ignore
       windowEvents.forEach((type) => window.removeEventListener(type, handleEvent));
-      document.body.style.cursor = '';
+      document.body.style.cursor = "Stryker was here!";
       document.body.style.userSelect = '';
     };
