[NoCoverage] BlockStatement
src/use/resizable/reducer.ts:15:48
 
 export const resizableReducer = createReducer(initialState, (builder) => {
   builder
-    .addCase(actions.start, (draft, action) => {
-      draft.isMove = true;
-      draft.position = action.payload.position;
-      draft.initSize = draft.size;
-    })
+    .addCase(actions.start, (draft, action) => {})
     .addCase(actions.init, (draft, action) => {
       draft.size = action.payload.size;

[NoCoverage] BooleanLiteral
src/use/resizable/reducer.ts:16:22
 export const resizableReducer = createReducer(initialState, (builder) => {
   builder
     .addCase(actions.start, (draft, action) => {
-      draft.isMove = true;
+      draft.isMove = false;
       draft.position = action.payload.position;
       draft.initSize = draft.size;

[NoCoverage] BlockStatement
src/use/resizable/reducer.ts:20:47
       draft.position = action.payload.position;
       draft.initSize = draft.size;
     })
-    .addCase(actions.init, (draft, action) => {
-      draft.size = action.payload.size;
-    })
+    .addCase(actions.init, (draft, action) => {})
     .addCase(actions.move, (draft, action) => {
       if (!draft.isMove || draft.position === undefined || draft.initSize === undefined) {

[NoCoverage] BlockStatement
src/use/resizable/reducer.ts:23:47
     .addCase(actions.init, (draft, action) => {
       draft.size = action.payload.size;
     })
-    .addCase(actions.move, (draft, action) => {
-      if (!draft.isMove || draft.position === undefined || draft.initSize === undefined) {
-        return draft;
-      }
-      const calc = directionCalcMap[draft.direction];
-      draft.size = draft.initSize + (action.payload.position - draft.position) * calc;
-      if (draft.maxSize && draft.size > draft.maxSize) {
-        draft.size = draft.maxSize;
-      }
-      if (draft.minSize && draft.size < draft.minSize) {
-        draft.size = draft.minSize;
-      }
-    })
+    .addCase(actions.move, (draft, action) => {})
     .addCase(actions.end, (draft) => {
       draft.isMove = false;

[NoCoverage] ConditionalExpression
src/use/resizable/reducer.ts:24:28
       draft.size = action.payload.size;
     })
     .addCase(actions.move, (draft, action) => {
-      if (!draft.isMove || draft.position === undefined || draft.initSize === undefined) {
+      if (!draft.isMove || true || draft.initSize === undefined) {
         return draft;
       }

[NoCoverage] ConditionalExpression
src/use/resizable/reducer.ts:24:60
       draft.size = action.payload.size;
     })
     .addCase(actions.move, (draft, action) => {
-      if (!draft.isMove || draft.position === undefined || draft.initSize === undefined) {
+      if (!draft.isMove || draft.position === undefined || false) {
         return draft;
       }

[NoCoverage] ArithmeticOperator
src/use/resizable/reducer.ts:28:38
         return draft;
       }
       const calc = directionCalcMap[draft.direction];
-      draft.size = draft.initSize + (action.payload.position - draft.position) * calc;
+      draft.size = draft.initSize + (action.payload.position + draft.position) * calc;
       if (draft.maxSize && draft.size > draft.maxSize) {
         draft.size = draft.maxSize;

[NoCoverage] ArithmeticOperator
src/use/resizable/reducer.ts:28:20
         return draft;
       }
       const calc = directionCalcMap[draft.direction];
-      draft.size = draft.initSize + (action.payload.position - draft.position) * calc;
+      draft.size = draft.initSize - (action.payload.position - draft.position) * calc;
       if (draft.maxSize && draft.size > draft.maxSize) {
         draft.size = draft.maxSize;

[NoCoverage] ConditionalExpression
src/use/resizable/reducer.ts:29:28
       }
       const calc = directionCalcMap[draft.direction];
       draft.size = draft.initSize + (action.payload.position - draft.position) * calc;
-      if (draft.maxSize && draft.size > draft.maxSize) {
+      if (draft.maxSize && false) {
         draft.size = draft.maxSize;
       }

[NoCoverage] ConditionalExpression
src/use/resizable/reducer.ts:29:11
       }
       const calc = directionCalcMap[draft.direction];
       draft.size = draft.initSize + (action.payload.position - draft.position) * calc;
-      if (draft.maxSize && draft.size > draft.maxSize) {
+      if (true) {
         draft.size = draft.maxSize;
       }

[NoCoverage] EqualityOperator
src/use/resizable/reducer.ts:32:28
       if (draft.maxSize && draft.size > draft.maxSize) {
         draft.size = draft.maxSize;
       }
-      if (draft.minSize && draft.size < draft.minSize) {
+      if (draft.minSize && draft.size <= draft.minSize) {
         draft.size = draft.minSize;
       }

[NoCoverage] LogicalOperator
src/use/resizable/reducer.ts:32:11
       if (draft.maxSize && draft.size > draft.maxSize) {
         draft.size = draft.maxSize;
       }
-      if (draft.minSize && draft.size < draft.minSize) {
+      if (draft.minSize || draft.size < draft.minSize) {
         draft.size = draft.minSize;
       }

[NoCoverage] BlockStatement
src/use/resizable/reducer.ts:36:38
         draft.size = draft.minSize;
       }
     })
-    .addCase(actions.end, (draft) => {
-      draft.isMove = false;
-      draft.initSize = undefined;
-    });
+    .addCase(actions.end, (draft) => {});
 });
 

[NoCoverage] BooleanLiteral
src/use/resizable/reducer.ts:37:22
       }
     })
     .addCase(actions.end, (draft) => {
-      draft.isMove = false;
+      draft.isMove = true;
       draft.initSize = undefined;
     });
