[NoCoverage] ObjectLiteral
src/use/resizable/types.ts:19:76
   readonly isMove?: boolean;
 }
 
-export const directionMap: Record<ResizeDirection, ResizeDirectionGroup> = {
-  left: 'horizontal',
-  right: 'horizontal',
-  up: 'vertical',
-  down: 'vertical',
-  top: 'vertical',
-  bottom: 'vertical',
-};
+export const directionMap: Record<ResizeDirection, ResizeDirectionGroup> = {};
 
 export const directionCalcMap: Record<ResizeDirection, number> = {

[NoCoverage] ObjectLiteral
src/use/resizable/types.ts:28:66
   bottom: 'vertical',
 };
 
-export const directionCalcMap: Record<ResizeDirection, number> = {
-  left: -1,
-  right: 1,
-  up: -1,
-  down: 1,
-  top: -1,
-  bottom: 1,
-};
+export const directionCalcMap: Record<ResizeDirection, number> = {};
 
 export const windowEvents = [

[NoCoverage] UnaryOperator
src/use/resizable/types.ts:29:9
 };
 
 export const directionCalcMap: Record<ResizeDirection, number> = {
-  left: -1,
+  left: +1,
   right: 1,
   up: -1,

[NoCoverage] UnaryOperator
src/use/resizable/types.ts:31:7
 export const directionCalcMap: Record<ResizeDirection, number> = {
   left: -1,
   right: 1,
-  up: -1,
+  up: +1,
   down: 1,
   top: -1,

[NoCoverage] UnaryOperator
src/use/resizable/types.ts:33:8
   right: 1,
   up: -1,
   down: 1,
-  top: -1,
+  top: +1,
   bottom: 1,
 };

[NoCoverage] StringLiteral
src/use/resizable/types.ts:38:3
 };
 
 export const windowEvents = [
-  'mousemove',
+  "",
   'touchmove',
   'mouseup',

[NoCoverage] StringLiteral
src/use/resizable/types.ts:39:3
 
 export const windowEvents = [
   'mousemove',
-  'touchmove',
+  "",
   'mouseup',
   'touchend',

[NoCoverage] StringLiteral
src/use/resizable/types.ts:40:3
 export const windowEvents = [
   'mousemove',
   'touchmove',
-  'mouseup',
+  "",
   'touchend',
 ];
