[NoCoverage] BlockStatement
verticals/src/use/shiftEnterRestriction.ts:3:47
 import { KeyboardEvent } from 'react';
 
-export const useShiftEnterRestriction = () => {
-  const shiftEnterRestriction = (event: KeyboardEvent) => {
-    const { key, shiftKey } = event;
-    if (key === 'Enter' && !shiftKey) {
-      event.preventDefault();
-    }
-  };
-
-  return {
-    shiftEnterRestriction,
-  };
-};
+export const useShiftEnterRestriction = () => {};
 

[NoCoverage] BlockStatement
verticals/src/use/shiftEnterRestriction.ts:4:59
 import { KeyboardEvent } from 'react';
 
 export const useShiftEnterRestriction = () => {
-  const shiftEnterRestriction = (event: KeyboardEvent) => {
-    const { key, shiftKey } = event;
-    if (key === 'Enter' && !shiftKey) {
-      event.preventDefault();
-    }
-  };
+  const shiftEnterRestriction = (event: KeyboardEvent) => {};
 
   return {

[NoCoverage] BooleanLiteral
verticals/src/use/shiftEnterRestriction.ts:6:28
 export const useShiftEnterRestriction = () => {
   const shiftEnterRestriction = (event: KeyboardEvent) => {
     const { key, shiftKey } = event;
-    if (key === 'Enter' && !shiftKey) {
+    if (key === 'Enter' && shiftKey) {
       event.preventDefault();
     }

[NoCoverage] BlockStatement
verticals/src/use/shiftEnterRestriction.ts:6:39
 export const useShiftEnterRestriction = () => {
   const shiftEnterRestriction = (event: KeyboardEvent) => {
     const { key, shiftKey } = event;
-    if (key === 'Enter' && !shiftKey) {
-      event.preventDefault();
-    }
+    if (key === 'Enter' && !shiftKey) {}
   };
 
