[NoCoverage] BlockStatement
verticals/src/use/title.ts:3:45
 import { useEffect } from 'react';
 
-export const useTitle = (title?: string) => {
-  useEffect(() => {
-    if (title) {
-      document.title = title;
-    }
-  });
-};
+export const useTitle = (title?: string) => {};
 

[NoCoverage] BlockStatement
verticals/src/use/title.ts:4:19
 import { useEffect } from 'react';
 
 export const useTitle = (title?: string) => {
-  useEffect(() => {
-    if (title) {
-      document.title = title;
-    }
-  });
+  useEffect(() => {});
 };
 

[NoCoverage] ConditionalExpression
verticals/src/use/title.ts:5:9
 
 export const useTitle = (title?: string) => {
   useEffect(() => {
-    if (title) {
+    if (false) {
       document.title = title;
     }

[NoCoverage] ConditionalExpression
verticals/src/use/title.ts:5:9
 
 export const useTitle = (title?: string) => {
   useEffect(() => {
-    if (title) {
+    if (true) {
       document.title = title;
     }
