[NoCoverage] BlockStatement
verticals/src/use/valueRef.ts:3:44
 import { useEffect, useRef } from 'react';
 
-export const useValueRef = (value: any) => {
-  const ref = useRef<any>(value);
-
-  useEffect(() => {
-    ref.current = value;
-  }, [value]);
-
-  return ref;
-};
+export const useValueRef = (value: any) => {};
 

[NoCoverage] BlockStatement
verticals/src/use/valueRef.ts:6:19
 export const useValueRef = (value: any) => {
   const ref = useRef<any>(value);
 
-  useEffect(() => {
-    ref.current = value;
-  }, [value]);
+  useEffect(() => {}, [value]);
 
   return ref;
