[Survived] UnaryOperator
verticals/src/constants/index.ts:2:31
 export const TEMP_ID = 0;
-export const TRASH_BOARD_ID = -1;
+export const TRASH_BOARD_ID = +1;
 export const NEW_BOARD_ID = -2;
 export const NEW_COLUMN_ID = -3;

[Survived] UnaryOperator
verticals/src/constants/index.ts:3:29
 export const TEMP_ID = 0;
 export const TRASH_BOARD_ID = -1;
-export const NEW_BOARD_ID = -2;
+export const NEW_BOARD_ID = +2;
 export const NEW_COLUMN_ID = -3;
 export const NEW_TODO_ID = -4;

[Survived] UnaryOperator
verticals/src/constants/index.ts:4:30
 export const TEMP_ID = 0;
 export const TRASH_BOARD_ID = -1;
 export const NEW_BOARD_ID = -2;
-export const NEW_COLUMN_ID = -3;
+export const NEW_COLUMN_ID = +3;
 export const NEW_TODO_ID = -4;
 export const DEFAULT_COLUMN_WIDTH = 280;

[Survived] UnaryOperator
verticals/src/constants/index.ts:5:28
 export const TRASH_BOARD_ID = -1;
 export const NEW_BOARD_ID = -2;
 export const NEW_COLUMN_ID = -3;
-export const NEW_TODO_ID = -4;
+export const NEW_TODO_ID = +4;
 export const DEFAULT_COLUMN_WIDTH = 280;
 export const ICONS = ['apple', 'archive', 'arrow-down', 'arrow-left', 'arrow-right', 'arrow-up', 'attach', 'bachelor',

[Survived] StringLiteral
verticals/src/constants/index.ts:7:23
 export const NEW_COLUMN_ID = -3;
 export const NEW_TODO_ID = -4;
 export const DEFAULT_COLUMN_WIDTH = 280;
-export const ICONS = ['apple', 'archive', 'arrow-down', 'arrow-left', 'arrow-right', 'arrow-up', 'attach', 'bachelor',
+export const ICONS = ["", 'archive', 'arrow-down', 'arrow-left', 'arrow-right', 'arrow-up', 'attach', 'bachelor',
   'ball', 'bell', 'book', 'bookmark', 'calendar', 'card', 'carrot', 'chair', 'change', 'cheese',
   'circle', 'coffee', 'croissant', 'cross', 'file', 'flag', 'foot', 'gallery', 'geo', 'heart', 'help', 'home', 'item',

[Survived] StringLiteral
verticals/src/constants/index.ts:7:108
 export const NEW_COLUMN_ID = -3;
 export const NEW_TODO_ID = -4;
 export const DEFAULT_COLUMN_WIDTH = 280;
-export const ICONS = ['apple', 'archive', 'arrow-down', 'arrow-left', 'arrow-right', 'arrow-up', 'attach', 'bachelor',
+export const ICONS = ['apple', 'archive', 'arrow-down', 'arrow-left', 'arrow-right', 'arrow-up', 'attach', "",
   'ball', 'bell', 'book', 'bookmark', 'calendar', 'card', 'carrot', 'chair', 'change', 'cheese',
   'circle', 'coffee', 'croissant', 'cross', 'file', 'flag', 'foot', 'gallery', 'geo', 'heart', 'help', 'home', 'item',

[Survived] StringLiteral
verticals/src/constants/index.ts:8:19
 export const NEW_TODO_ID = -4;
 export const DEFAULT_COLUMN_WIDTH = 280;
 export const ICONS = ['apple', 'archive', 'arrow-down', 'arrow-left', 'arrow-right', 'arrow-up', 'attach', 'bachelor',
-  'ball', 'bell', 'book', 'bookmark', 'calendar', 'card', 'carrot', 'chair', 'change', 'cheese',
+  'ball', 'bell', "", 'bookmark', 'calendar', 'card', 'carrot', 'chair', 'change', 'cheese',
   'circle', 'coffee', 'croissant', 'cross', 'file', 'flag', 'foot', 'gallery', 'geo', 'heart', 'help', 'home', 'item',
   'keyboard', 'light-bulb', 'link', 'lock', 'mail', 'message', 'music', 'phone', 'player',

[Survived] StringLiteral
verticals/src/constants/index.ts:8:27
 export const NEW_TODO_ID = -4;
 export const DEFAULT_COLUMN_WIDTH = 280;
 export const ICONS = ['apple', 'archive', 'arrow-down', 'arrow-left', 'arrow-right', 'arrow-up', 'attach', 'bachelor',
-  'ball', 'bell', 'book', 'bookmark', 'calendar', 'card', 'carrot', 'chair', 'change', 'cheese',
+  'ball', 'bell', 'book', "", 'calendar', 'card', 'carrot', 'chair', 'change', 'cheese',
   'circle', 'coffee', 'croissant', 'cross', 'file', 'flag', 'foot', 'gallery', 'geo', 'heart', 'help', 'home', 'item',
   'keyboard', 'light-bulb', 'link', 'lock', 'mail', 'message', 'music', 'phone', 'player',

[Survived] StringLiteral
verticals/src/constants/index.ts:9:53
 export const DEFAULT_COLUMN_WIDTH = 280;
 export const ICONS = ['apple', 'archive', 'arrow-down', 'arrow-left', 'arrow-right', 'arrow-up', 'attach', 'bachelor',
   'ball', 'bell', 'book', 'bookmark', 'calendar', 'card', 'carrot', 'chair', 'change', 'cheese',
-  'circle', 'coffee', 'croissant', 'cross', 'file', 'flag', 'foot', 'gallery', 'geo', 'heart', 'help', 'home', 'item',
+  'circle', 'coffee', 'croissant', 'cross', 'file', "", 'foot', 'gallery', 'geo', 'heart', 'help', 'home', 'item',
   'keyboard', 'light-bulb', 'link', 'lock', 'mail', 'message', 'music', 'phone', 'player',
   'preferences', 'preferences-2', 'profile', 'profiles', 'raspberry', 'restart', 'restart-2', 'rocket', 'scissors',

[Survived] StringLiteral
verticals/src/constants/index.ts:9:3
 export const DEFAULT_COLUMN_WIDTH = 280;
 export const ICONS = ['apple', 'archive', 'arrow-down', 'arrow-left', 'arrow-right', 'arrow-up', 'attach', 'bachelor',
   'ball', 'bell', 'book', 'bookmark', 'calendar', 'card', 'carrot', 'chair', 'change', 'cheese',
-  'circle', 'coffee', 'croissant', 'cross', 'file', 'flag', 'foot', 'gallery', 'geo', 'heart', 'help', 'home', 'item',
+  "", 'coffee', 'croissant', 'cross', 'file', 'flag', 'foot', 'gallery', 'geo', 'heart', 'help', 'home', 'item',
   'keyboard', 'light-bulb', 'link', 'lock', 'mail', 'message', 'music', 'phone', 'player',
   'preferences', 'preferences-2', 'profile', 'profiles', 'raspberry', 'restart', 'restart-2', 'rocket', 'scissors',

[Survived] StringLiteral
verticals/src/constants/index.ts:10:3
 export const ICONS = ['apple', 'archive', 'arrow-down', 'arrow-left', 'arrow-right', 'arrow-up', 'attach', 'bachelor',
   'ball', 'bell', 'book', 'bookmark', 'calendar', 'card', 'carrot', 'chair', 'change', 'cheese',
   'circle', 'coffee', 'croissant', 'cross', 'file', 'flag', 'foot', 'gallery', 'geo', 'heart', 'help', 'home', 'item',
-  'keyboard', 'light-bulb', 'link', 'lock', 'mail', 'message', 'music', 'phone', 'player',
+  "", 'light-bulb', 'link', 'lock', 'mail', 'message', 'music', 'phone', 'player',
   'preferences', 'preferences-2', 'profile', 'profiles', 'raspberry', 'restart', 'restart-2', 'rocket', 'scissors',
   'search', 'share-link', 'shortcut', 'shrimp', 'smile-1', 'smile-10', 'smile-11', 'smile-12', 'smile-13', 'smile-14',

[Survived] StringLiteral
verticals/src/constants/index.ts:10:73
 export const ICONS = ['apple', 'archive', 'arrow-down', 'arrow-left', 'arrow-right', 'arrow-up', 'attach', 'bachelor',
   'ball', 'bell', 'book', 'bookmark', 'calendar', 'card', 'carrot', 'chair', 'change', 'cheese',
   'circle', 'coffee', 'croissant', 'cross', 'file', 'flag', 'foot', 'gallery', 'geo', 'heart', 'help', 'home', 'item',
-  'keyboard', 'light-bulb', 'link', 'lock', 'mail', 'message', 'music', 'phone', 'player',
+  'keyboard', 'light-bulb', 'link', 'lock', 'mail', 'message', 'music', "", 'player',
   'preferences', 'preferences-2', 'profile', 'profiles', 'raspberry', 'restart', 'restart-2', 'rocket', 'scissors',
   'search', 'share-link', 'shortcut', 'shrimp', 'smile-1', 'smile-10', 'smile-11', 'smile-12', 'smile-13', 'smile-14',

[Survived] StringLiteral
verticals/src/constants/index.ts:11:71
   'ball', 'bell', 'book', 'bookmark', 'calendar', 'card', 'carrot', 'chair', 'change', 'cheese',
   'circle', 'coffee', 'croissant', 'cross', 'file', 'flag', 'foot', 'gallery', 'geo', 'heart', 'help', 'home', 'item',
   'keyboard', 'light-bulb', 'link', 'lock', 'mail', 'message', 'music', 'phone', 'player',
-  'preferences', 'preferences-2', 'profile', 'profiles', 'raspberry', 'restart', 'restart-2', 'rocket', 'scissors',
+  'preferences', 'preferences-2', 'profile', 'profiles', 'raspberry', "", 'restart-2', 'rocket', 'scissors',
   'search', 'share-link', 'shortcut', 'shrimp', 'smile-1', 'smile-10', 'smile-11', 'smile-12', 'smile-13', 'smile-14',
   'smile-2', 'smile-3', 'smile-4', 'smile-5', 'smile-6', 'smile-7', 'smile-8', 'smile-9', 'sound-off',

[Survived] StringLiteral
verticals/src/constants/index.ts:11:58
   'ball', 'bell', 'book', 'bookmark', 'calendar', 'card', 'carrot', 'chair', 'change', 'cheese',
   'circle', 'coffee', 'croissant', 'cross', 'file', 'flag', 'foot', 'gallery', 'geo', 'heart', 'help', 'home', 'item',
   'keyboard', 'light-bulb', 'link', 'lock', 'mail', 'message', 'music', 'phone', 'player',
-  'preferences', 'preferences-2', 'profile', 'profiles', 'raspberry', 'restart', 'restart-2', 'rocket', 'scissors',
+  'preferences', 'preferences-2', 'profile', 'profiles', "", 'restart', 'restart-2', 'rocket', 'scissors',
   'search', 'share-link', 'shortcut', 'shrimp', 'smile-1', 'smile-10', 'smile-11', 'smile-12', 'smile-13', 'smile-14',
   'smile-2', 'smile-3', 'smile-4', 'smile-5', 'smile-6', 'smile-7', 'smile-8', 'smile-9', 'sound-off',

[Survived] StringLiteral
verticals/src/constants/index.ts:12:72
   'circle', 'coffee', 'croissant', 'cross', 'file', 'flag', 'foot', 'gallery', 'geo', 'heart', 'help', 'home', 'item',
   'keyboard', 'light-bulb', 'link', 'lock', 'mail', 'message', 'music', 'phone', 'player',
   'preferences', 'preferences-2', 'profile', 'profiles', 'raspberry', 'restart', 'restart-2', 'rocket', 'scissors',
-  'search', 'share-link', 'shortcut', 'shrimp', 'smile-1', 'smile-10', 'smile-11', 'smile-12', 'smile-13', 'smile-14',
+  'search', 'share-link', 'shortcut', 'shrimp', 'smile-1', 'smile-10', "", 'smile-12', 'smile-13', 'smile-14',
   'smile-2', 'smile-3', 'smile-4', 'smile-5', 'smile-6', 'smile-7', 'smile-8', 'smile-9', 'sound-off',
   'sound-on', 'stop', 'tick', 'tick-2', 'timer', 'usd', 'wallet', 'trash', 'fire', 'twitch', 'youtube',

[Survived] StringLiteral
verticals/src/constants/index.ts:13:3
   'keyboard', 'light-bulb', 'link', 'lock', 'mail', 'message', 'music', 'phone', 'player',
   'preferences', 'preferences-2', 'profile', 'profiles', 'raspberry', 'restart', 'restart-2', 'rocket', 'scissors',
   'search', 'share-link', 'shortcut', 'shrimp', 'smile-1', 'smile-10', 'smile-11', 'smile-12', 'smile-13', 'smile-14',
-  'smile-2', 'smile-3', 'smile-4', 'smile-5', 'smile-6', 'smile-7', 'smile-8', 'smile-9', 'sound-off',
+  "", 'smile-3', 'smile-4', 'smile-5', 'smile-6', 'smile-7', 'smile-8', 'smile-9', 'sound-off',
   'sound-on', 'stop', 'tick', 'tick-2', 'timer', 'usd', 'wallet', 'trash', 'fire', 'twitch', 'youtube',
   'github', 'linkedin', 'twitter', 'facebook', 'instagram', 'snap', 'tik-tok'];

[Survived] StringLiteral
verticals/src/constants/index.ts:13:14
   'keyboard', 'light-bulb', 'link', 'lock', 'mail', 'message', 'music', 'phone', 'player',
   'preferences', 'preferences-2', 'profile', 'profiles', 'raspberry', 'restart', 'restart-2', 'rocket', 'scissors',
   'search', 'share-link', 'shortcut', 'shrimp', 'smile-1', 'smile-10', 'smile-11', 'smile-12', 'smile-13', 'smile-14',
-  'smile-2', 'smile-3', 'smile-4', 'smile-5', 'smile-6', 'smile-7', 'smile-8', 'smile-9', 'sound-off',
+  'smile-2', "", 'smile-4', 'smile-5', 'smile-6', 'smile-7', 'smile-8', 'smile-9', 'sound-off',
   'sound-on', 'stop', 'tick', 'tick-2', 'timer', 'usd', 'wallet', 'trash', 'fire', 'twitch', 'youtube',
   'github', 'linkedin', 'twitter', 'facebook', 'instagram', 'snap', 'tik-tok'];

[Survived] StringLiteral
verticals/src/constants/index.ts:14:3
   'preferences', 'preferences-2', 'profile', 'profiles', 'raspberry', 'restart', 'restart-2', 'rocket', 'scissors',
   'search', 'share-link', 'shortcut', 'shrimp', 'smile-1', 'smile-10', 'smile-11', 'smile-12', 'smile-13', 'smile-14',
   'smile-2', 'smile-3', 'smile-4', 'smile-5', 'smile-6', 'smile-7', 'smile-8', 'smile-9', 'sound-off',
-  'sound-on', 'stop', 'tick', 'tick-2', 'timer', 'usd', 'wallet', 'trash', 'fire', 'twitch', 'youtube',
+  "", 'stop', 'tick', 'tick-2', 'timer', 'usd', 'wallet', 'trash', 'fire', 'twitch', 'youtube',
   'github', 'linkedin', 'twitter', 'facebook', 'instagram', 'snap', 'tik-tok'];
 export const DEFAULT_BOARD_ICON = '/assets/svg/board/item.svg';

[Survived] StringLiteral
verticals/src/constants/index.ts:14:31
   'preferences', 'preferences-2', 'profile', 'profiles', 'raspberry', 'restart', 'restart-2', 'rocket', 'scissors',
   'search', 'share-link', 'shortcut', 'shrimp', 'smile-1', 'smile-10', 'smile-11', 'smile-12', 'smile-13', 'smile-14',
   'smile-2', 'smile-3', 'smile-4', 'smile-5', 'smile-6', 'smile-7', 'smile-8', 'smile-9', 'sound-off',
-  'sound-on', 'stop', 'tick', 'tick-2', 'timer', 'usd', 'wallet', 'trash', 'fire', 'twitch', 'youtube',
+  'sound-on', 'stop', 'tick', "", 'timer', 'usd', 'wallet', 'trash', 'fire', 'twitch', 'youtube',
   'github', 'linkedin', 'twitter', 'facebook', 'instagram', 'snap', 'tik-tok'];
 export const DEFAULT_BOARD_ICON = '/assets/svg/board/item.svg';

[Survived] StringLiteral
verticals/src/constants/index.ts:15:25
   'search', 'share-link', 'shortcut', 'shrimp', 'smile-1', 'smile-10', 'smile-11', 'smile-12', 'smile-13', 'smile-14',
   'smile-2', 'smile-3', 'smile-4', 'smile-5', 'smile-6', 'smile-7', 'smile-8', 'smile-9', 'sound-off',
   'sound-on', 'stop', 'tick', 'tick-2', 'timer', 'usd', 'wallet', 'trash', 'fire', 'twitch', 'youtube',
-  'github', 'linkedin', 'twitter', 'facebook', 'instagram', 'snap', 'tik-tok'];
+  'github', 'linkedin', "", 'facebook', 'instagram', 'snap', 'tik-tok'];
 export const DEFAULT_BOARD_ICON = '/assets/svg/board/item.svg';
 export const MAX_FILES_IN_COMMENT_PREVIEW = 3;

[Survived] StringLiteral
verticals/src/constants/index.ts:15:69
   'search', 'share-link', 'shortcut', 'shrimp', 'smile-1', 'smile-10', 'smile-11', 'smile-12', 'smile-13', 'smile-14',
   'smile-2', 'smile-3', 'smile-4', 'smile-5', 'smile-6', 'smile-7', 'smile-8', 'smile-9', 'sound-off',
   'sound-on', 'stop', 'tick', 'tick-2', 'timer', 'usd', 'wallet', 'trash', 'fire', 'twitch', 'youtube',
-  'github', 'linkedin', 'twitter', 'facebook', 'instagram', 'snap', 'tik-tok'];
+  'github', 'linkedin', 'twitter', 'facebook', 'instagram', 'snap', ""];
 export const DEFAULT_BOARD_ICON = '/assets/svg/board/item.svg';
 export const MAX_FILES_IN_COMMENT_PREVIEW = 3;

[Survived] StringLiteral
verticals/src/constants/index.ts:16:35
   'smile-2', 'smile-3', 'smile-4', 'smile-5', 'smile-6', 'smile-7', 'smile-8', 'smile-9', 'sound-off',
   'sound-on', 'stop', 'tick', 'tick-2', 'timer', 'usd', 'wallet', 'trash', 'fire', 'twitch', 'youtube',
   'github', 'linkedin', 'twitter', 'facebook', 'instagram', 'snap', 'tik-tok'];
-export const DEFAULT_BOARD_ICON = '/assets/svg/board/item.svg';
+export const DEFAULT_BOARD_ICON = "";
 export const MAX_FILES_IN_COMMENT_PREVIEW = 3;
 export const LANGUAGES = [

[Survived] StringLiteral
verticals/src/constants/index.ts:22:3
   'English',
   'Русский',
   'Français',
-  'Español',
+  "",
 ];
 export const LANGUAGE_CODES = [

[Survived] StringLiteral
verticals/src/constants/index.ts:25:3
   'Español',
 ];
 export const LANGUAGE_CODES = [
-  'en',
+  "",
   'ru',
   'fr',

[Survived] StringLiteral
verticals/src/constants/index.ts:26:3
 ];
 export const LANGUAGE_CODES = [
   'en',
-  'ru',
+  "",
   'fr',
   'es',
