[Survived] StringLiteral
src/store/actions/boards.ts:16:28
 
 export const BoardsActions = {
   effect: {
-    fetchAll: createAction('BOARDS-EFFECT/FETCH_ALL'),
+    fetchAll: createAction(""),
     create: createAction<ICreateBoard>('BOARDS-EFFECT/CREATE'),
     update: createAction<IUpdateBoard>('BOARDS-EFFECT/UPDATE'),

[Survived] StringLiteral
src/store/actions/boards.ts:19:40
     fetchAll: createAction('BOARDS-EFFECT/FETCH_ALL'),
     create: createAction<ICreateBoard>('BOARDS-EFFECT/CREATE'),
     update: createAction<IUpdateBoard>('BOARDS-EFFECT/UPDATE'),
-    remove: createAction<IRemoveBoard>('BOARDS-EFFECT/REMOVE'),
+    remove: createAction<IRemoveBoard>(""),
     move: createAction<IMoveBoard>('BOARDS-EFFECT/MOVE'),
   },

[Survived] StringLiteral
src/store/actions/boards.ts:20:36
     create: createAction<ICreateBoard>('BOARDS-EFFECT/CREATE'),
     update: createAction<IUpdateBoard>('BOARDS-EFFECT/UPDATE'),
     remove: createAction<IRemoveBoard>('BOARDS-EFFECT/REMOVE'),
-    move: createAction<IMoveBoard>('BOARDS-EFFECT/MOVE'),
+    move: createAction<IMoveBoard>(""),
   },
   setAll: createAction<ISetBoards>('BOARDS/SET_ALL'),

[Survived] StringLiteral
src/store/actions/boards.ts:22:36
     remove: createAction<IRemoveBoard>('BOARDS-EFFECT/REMOVE'),
     move: createAction<IMoveBoard>('BOARDS-EFFECT/MOVE'),
   },
-  setAll: createAction<ISetBoards>('BOARDS/SET_ALL'),
+  setAll: createAction<ISetBoards>(""),
   add: createAction<IAddBoard>('BOARDS/ADD'),
   insertInPosition: createAction<IInsertBoard>('BOARDS/INSERT_IN_POSITION'),

[Survived] StringLiteral
src/store/actions/boards.ts:23:32
     move: createAction<IMoveBoard>('BOARDS-EFFECT/MOVE'),
   },
   setAll: createAction<ISetBoards>('BOARDS/SET_ALL'),
-  add: createAction<IAddBoard>('BOARDS/ADD'),
+  add: createAction<IAddBoard>(""),
   insertInPosition: createAction<IInsertBoard>('BOARDS/INSERT_IN_POSITION'),
   updateEntity: createAction<IUpdateBoard>('BOARDS/UPDATE_ENTITY'),

[Survived] StringLiteral
src/store/actions/boards.ts:27:34
   insertInPosition: createAction<IInsertBoard>('BOARDS/INSERT_IN_POSITION'),
   updateEntity: createAction<IUpdateBoard>('BOARDS/UPDATE_ENTITY'),
   // setPositions
-  move: createAction<IMoveBoard>('BOARDS/MOVE'),
+  move: createAction<IMoveBoard>(""),
   setPositions: createAction<ISetBoardPositions>('BOARDS/SET_POSITIONS'),
   remove: createAction<IRemoveBoard>('BOARDS/REMOVE'),

[Survived] StringLiteral
src/store/actions/boards.ts:28:50
   updateEntity: createAction<IUpdateBoard>('BOARDS/UPDATE_ENTITY'),
   // setPositions
   move: createAction<IMoveBoard>('BOARDS/MOVE'),
-  setPositions: createAction<ISetBoardPositions>('BOARDS/SET_POSITIONS'),
+  setPositions: createAction<ISetBoardPositions>(""),
   remove: createAction<IRemoveBoard>('BOARDS/REMOVE'),
   drawBelow: createAction<IDrawBoardBelow>('BOARDS/DRAW_BELOW'),

[Survived] StringLiteral
src/store/actions/boards.ts:31:28
   setPositions: createAction<ISetBoardPositions>('BOARDS/SET_POSITIONS'),
   remove: createAction<IRemoveBoard>('BOARDS/REMOVE'),
   drawBelow: createAction<IDrawBoardBelow>('BOARDS/DRAW_BELOW'),
-  removeTemp: createAction('BOARDS/REMOVE_TEMP'),
+  removeTemp: createAction(""),
 };
 
