[Survived] StringLiteral
src/store/actions/comments.ts:16:57
 
 export const CommentsActions = {
   effects: {
-    fetchByTodoId: createAction<IFetchCommentsByTodoId>('COMMENTS-EFFECT/FETCH_BY_TODO_ID'),
+    fetchByTodoId: createAction<IFetchCommentsByTodoId>(""),
     create: createAction<ICreateComment>('COMMENTS-EFFECT/CREATE'),
     remove: createAction<IRemoveComment>('COMMENTS-EFFECT/REMOVE'),

[Survived] StringLiteral
src/store/actions/comments.ts:19:44
     fetchByTodoId: createAction<IFetchCommentsByTodoId>('COMMENTS-EFFECT/FETCH_BY_TODO_ID'),
     create: createAction<ICreateComment>('COMMENTS-EFFECT/CREATE'),
     remove: createAction<IRemoveComment>('COMMENTS-EFFECT/REMOVE'),
-    addLike: createAction<IAddCommentLike>('COMMENTS-EFFECT/ADD_LIKE'),
+    addLike: createAction<IAddCommentLike>(""),
     removeLike: createAction<IRemoveCommentLike>('COMMENTS-EFFECT/REMOVE_LIKE'),
     updateText: createAction<IUpdateCommentText>('COMMENTS-EFFECT/UPDATE_TEXT'),

[Survived] StringLiteral
src/store/actions/comments.ts:21:50
     remove: createAction<IRemoveComment>('COMMENTS-EFFECT/REMOVE'),
     addLike: createAction<IAddCommentLike>('COMMENTS-EFFECT/ADD_LIKE'),
     removeLike: createAction<IRemoveCommentLike>('COMMENTS-EFFECT/REMOVE_LIKE'),
-    updateText: createAction<IUpdateCommentText>('COMMENTS-EFFECT/UPDATE_TEXT'),
+    updateText: createAction<IUpdateCommentText>(""),
   },
   setAll: createAction<ISetComments>('COMMENTS/SET_ALL'),

[Survived] StringLiteral
src/store/actions/comments.ts:24:34
     updateText: createAction<IUpdateCommentText>('COMMENTS-EFFECT/UPDATE_TEXT'),
   },
   setAll: createAction<ISetComments>('COMMENTS/SET_ALL'),
-  add: createAction<IAddComment>('COMMENTS/ADD'),
+  add: createAction<IAddComment>(""),
   remove: createAction<IRemoveComment>('COMMENTS/REMOVE'),
   updateLike: createAction<IUpdateCommentLike>('COMMENTS/UPDATE_LIKE'),

[Survived] StringLiteral
src/store/actions/comments.ts:25:40
   },
   setAll: createAction<ISetComments>('COMMENTS/SET_ALL'),
   add: createAction<IAddComment>('COMMENTS/ADD'),
-  remove: createAction<IRemoveComment>('COMMENTS/REMOVE'),
+  remove: createAction<IRemoveComment>(""),
   updateLike: createAction<IUpdateCommentLike>('COMMENTS/UPDATE_LIKE'),
   updateText: createAction<IUpdateCommentText>('COMMENTS/UPDATE_TEXT'),
