[Survived] ObjectLiteral
src/store/actions/updates.ts:5:31
 
 const subscribe = createAction('UPDATE/SUBSCRIBE');
 
-export const UpdatesActions = {
-  subscribe,
-};
+export const UpdatesActions = {};
 
