[Killed] ObjectLiteral
src/store/reducers/boards.ts:6:38
 import { BoardsActions } from '@store/actions';
 import { DEFAULT_BOARD_ICON, TEMP_ID } from '@/constants';
 
-export const initialState: IBoards = {
-  entities: [],
-  positions: [],
-};
+export const initialState: IBoards = {};
 
 export const BoardsReducer = createReducer(initialState, (builder) => builder

[Killed] ArrowFunction
src/store/reducers/boards.ts:12:34
 };
 
 export const BoardsReducer = createReducer(initialState, (builder) => builder
-  .addCase(BoardsActions.setAll, (draft, action) => action.payload)
+  .addCase(BoardsActions.setAll, () => undefined)
   .addCase(BoardsActions.setPositions, (draft, action) => {
     draft.positions = action.payload;

[Killed] BlockStatement
src/store/reducers/boards.ts:13:59
 
 export const BoardsReducer = createReducer(initialState, (builder) => builder
   .addCase(BoardsActions.setAll, (draft, action) => action.payload)
-  .addCase(BoardsActions.setPositions, (draft, action) => {
-    draft.positions = action.payload;
-  })
+  .addCase(BoardsActions.setPositions, (draft, action) => {})
   .addCase(BoardsActions.updateEntity, (draft, action) => {
     const { id } = action.payload;

[Killed] BlockStatement
src/store/reducers/boards.ts:16:59
   .addCase(BoardsActions.setPositions, (draft, action) => {
     draft.positions = action.payload;
   })
-  .addCase(BoardsActions.updateEntity, (draft, action) => {
-    const { id } = action.payload;
-    const index = draft.entities.findIndex((board) => board.id === id);
-    draft.entities[index] = {
-      ...draft.entities[index],
-      ...action.payload,
-    };
-  })
+  .addCase(BoardsActions.updateEntity, (draft, action) => {})
   .addCase(BoardsActions.add, (draft, action) => {
     const { id } = action.payload;

[Killed] EqualityOperator
src/store/reducers/boards.ts:18:55
   })
   .addCase(BoardsActions.updateEntity, (draft, action) => {
     const { id } = action.payload;
-    const index = draft.entities.findIndex((board) => board.id === id);
+    const index = draft.entities.findIndex((board) => board.id !== id);
     draft.entities[index] = {
       ...draft.entities[index],

[Killed] ArrowFunction
src/store/reducers/boards.ts:18:44
   })
   .addCase(BoardsActions.updateEntity, (draft, action) => {
     const { id } = action.payload;
-    const index = draft.entities.findIndex((board) => board.id === id);
+    const index = draft.entities.findIndex(() => undefined);
     draft.entities[index] = {
       ...draft.entities[index],

[Killed] BlockStatement
src/store/reducers/boards.ts:24:50
       ...action.payload,
     };
   })
-  .addCase(BoardsActions.add, (draft, action) => {
-    const { id } = action.payload;
-
-    const isAlreadyExistId = draft.positions.includes(id);
-    if (!isAlreadyExistId) {
-      draft.entities.push(action.payload);
-      draft.positions.push(id);
-    }
-  })
+  .addCase(BoardsActions.add, (draft, action) => {})
   .addCase(BoardsActions.move, (draft, action) => {
     const { sourcePosition, destinationPosition } = action.payload;

[Killed] BlockStatement
src/store/reducers/boards.ts:28:28
     const { id } = action.payload;
 
     const isAlreadyExistId = draft.positions.includes(id);
-    if (!isAlreadyExistId) {
-      draft.entities.push(action.payload);
-      draft.positions.push(id);
-    }
+    if (!isAlreadyExistId) {}
   })
   .addCase(BoardsActions.move, (draft, action) => {

[Killed] ConditionalExpression
src/store/reducers/boards.ts:28:9
     const { id } = action.payload;
 
     const isAlreadyExistId = draft.positions.includes(id);
-    if (!isAlreadyExistId) {
+    if (false) {
       draft.entities.push(action.payload);
       draft.positions.push(id);

[Killed] BlockStatement
src/store/reducers/boards.ts:33:51
       draft.positions.push(id);
     }
   })
-  .addCase(BoardsActions.move, (draft, action) => {
-    const { sourcePosition, destinationPosition } = action.payload;
-    draft.positions.splice(destinationPosition, 0, draft.positions.splice(sourcePosition, 1)[0]);
-  })
+  .addCase(BoardsActions.move, (draft, action) => {})
   .addCase(BoardsActions.insertInPosition, (draft, action) => {
     const { entity, position } = action.payload;

[Killed] BlockStatement
src/store/reducers/boards.ts:37:63
     const { sourcePosition, destinationPosition } = action.payload;
     draft.positions.splice(destinationPosition, 0, draft.positions.splice(sourcePosition, 1)[0]);
   })
-  .addCase(BoardsActions.insertInPosition, (draft, action) => {
-    const { entity, position } = action.payload;
-    const isAlreadyExistId = draft.positions.includes(entity.id);
-    if (!isAlreadyExistId) {
-      draft.entities.push(entity);
-      draft.positions.splice(position, 0, entity.id);
-    }
-  })
+  .addCase(BoardsActions.insertInPosition, (draft, action) => {})
   .addCase(BoardsActions.remove, (draft, action) => {
     const { id } = action.payload;

[Killed] BooleanLiteral
src/store/reducers/boards.ts:40:9
   .addCase(BoardsActions.insertInPosition, (draft, action) => {
     const { entity, position } = action.payload;
     const isAlreadyExistId = draft.positions.includes(entity.id);
-    if (!isAlreadyExistId) {
+    if (isAlreadyExistId) {
       draft.entities.push(entity);
       draft.positions.splice(position, 0, entity.id);

[Killed] BlockStatement
src/store/reducers/boards.ts:40:28
   .addCase(BoardsActions.insertInPosition, (draft, action) => {
     const { entity, position } = action.payload;
     const isAlreadyExistId = draft.positions.includes(entity.id);
-    if (!isAlreadyExistId) {
-      draft.entities.push(entity);
-      draft.positions.splice(position, 0, entity.id);
-    }
+    if (!isAlreadyExistId) {}
   })
   .addCase(BoardsActions.remove, (draft, action) => {

[Killed] BlockStatement
src/store/reducers/boards.ts:45:53
       draft.positions.splice(position, 0, entity.id);
     }
   })
-  .addCase(BoardsActions.remove, (draft, action) => {
-    const { id } = action.payload;
-
-    const entityIndex = draft.entities.findIndex((board) => board.id === id);
-    if (entityIndex !== -1) {
-      draft.entities.splice(entityIndex, 1);
-
-      const positionIndex = draft.positions.findIndex((boardId) => boardId === id);
-      if (positionIndex !== -1) draft.positions.splice(positionIndex, 1);
-    }
-  })
+  .addCase(BoardsActions.remove, (draft, action) => {})
   .addCase(BoardsActions.drawBelow, (draft, action) => {
     const { belowId } = action.payload;

[Killed] ConditionalExpression
src/store/reducers/boards.ts:48:61
   .addCase(BoardsActions.remove, (draft, action) => {
     const { id } = action.payload;
 
-    const entityIndex = draft.entities.findIndex((board) => board.id === id);
+    const entityIndex = draft.entities.findIndex((board) => true);
     if (entityIndex !== -1) {
       draft.entities.splice(entityIndex, 1);

[Killed] ConditionalExpression
src/store/reducers/boards.ts:48:61
   .addCase(BoardsActions.remove, (draft, action) => {
     const { id } = action.payload;
 
-    const entityIndex = draft.entities.findIndex((board) => board.id === id);
+    const entityIndex = draft.entities.findIndex((board) => false);
     if (entityIndex !== -1) {
       draft.entities.splice(entityIndex, 1);

[Killed] BlockStatement
src/store/reducers/boards.ts:49:29
     const { id } = action.payload;
 
     const entityIndex = draft.entities.findIndex((board) => board.id === id);
-    if (entityIndex !== -1) {
-      draft.entities.splice(entityIndex, 1);
-
-      const positionIndex = draft.positions.findIndex((boardId) => boardId === id);
-      if (positionIndex !== -1) draft.positions.splice(positionIndex, 1);
-    }
+    if (entityIndex !== -1) {}
   })
   .addCase(BoardsActions.drawBelow, (draft, action) => {

[Killed] EqualityOperator
src/store/reducers/boards.ts:49:9
     const { id } = action.payload;
 
     const entityIndex = draft.entities.findIndex((board) => board.id === id);
-    if (entityIndex !== -1) {
+    if (entityIndex === -1) {
       draft.entities.splice(entityIndex, 1);
 

[Killed] EqualityOperator
src/store/reducers/boards.ts:52:68
     if (entityIndex !== -1) {
       draft.entities.splice(entityIndex, 1);
 
-      const positionIndex = draft.positions.findIndex((boardId) => boardId === id);
+      const positionIndex = draft.positions.findIndex((boardId) => boardId !== id);
       if (positionIndex !== -1) draft.positions.splice(positionIndex, 1);
     }

[Killed] ArrowFunction
src/store/reducers/boards.ts:52:55
     if (entityIndex !== -1) {
       draft.entities.splice(entityIndex, 1);
 
-      const positionIndex = draft.positions.findIndex((boardId) => boardId === id);
+      const positionIndex = draft.positions.findIndex(() => undefined);
       if (positionIndex !== -1) draft.positions.splice(positionIndex, 1);
     }

[Killed] ConditionalExpression
src/store/reducers/boards.ts:53:11
       draft.entities.splice(entityIndex, 1);
 
       const positionIndex = draft.positions.findIndex((boardId) => boardId === id);
-      if (positionIndex !== -1) draft.positions.splice(positionIndex, 1);
+      if (false) draft.positions.splice(positionIndex, 1);
     }
   })

[Killed] EqualityOperator
src/store/reducers/boards.ts:53:11
       draft.entities.splice(entityIndex, 1);
 
       const positionIndex = draft.positions.findIndex((boardId) => boardId === id);
-      if (positionIndex !== -1) draft.positions.splice(positionIndex, 1);
+      if (positionIndex === -1) draft.positions.splice(positionIndex, 1);
     }
   })

[Killed] BlockStatement
src/store/reducers/boards.ts:56:56
       if (positionIndex !== -1) draft.positions.splice(positionIndex, 1);
     }
   })
-  .addCase(BoardsActions.drawBelow, (draft, action) => {
-    const { belowId } = action.payload;
-    const positionIndex = draft.positions.findIndex((boardId) => boardId === belowId);
-
-    draft.entities.push({
-      id: TEMP_ID,
-      belowId,
-      title: '',
-      icon: DEFAULT_BOARD_ICON,
-      cardType: EnumTodoType.Checkboxes,
-    });
-
-    draft.positions.splice(positionIndex + 1, 0, TEMP_ID);
-  })
+  .addCase(BoardsActions.drawBelow, (draft, action) => {})
   .addCase(BoardsActions.removeTemp, (draft) => {
     const entityIndex = draft.entities.findIndex((board) => board.id === TEMP_ID);

[Killed] ConditionalExpression
src/store/reducers/boards.ts:58:66
   })
   .addCase(BoardsActions.drawBelow, (draft, action) => {
     const { belowId } = action.payload;
-    const positionIndex = draft.positions.findIndex((boardId) => boardId === belowId);
+    const positionIndex = draft.positions.findIndex((boardId) => true);
 
     draft.entities.push({

[Killed] ArrowFunction
src/store/reducers/boards.ts:58:53
   })
   .addCase(BoardsActions.drawBelow, (draft, action) => {
     const { belowId } = action.payload;
-    const positionIndex = draft.positions.findIndex((boardId) => boardId === belowId);
+    const positionIndex = draft.positions.findIndex(() => undefined);
 
     draft.entities.push({

[Killed] ArithmeticOperator
src/store/reducers/boards.ts:68:28
       cardType: EnumTodoType.Checkboxes,
     });
 
-    draft.positions.splice(positionIndex + 1, 0, TEMP_ID);
+    draft.positions.splice(positionIndex - 1, 0, TEMP_ID);
   })
   .addCase(BoardsActions.removeTemp, (draft) => {

[Killed] BlockStatement
src/store/reducers/boards.ts:70:49
 
     draft.positions.splice(positionIndex + 1, 0, TEMP_ID);
   })
-  .addCase(BoardsActions.removeTemp, (draft) => {
-    const entityIndex = draft.entities.findIndex((board) => board.id === TEMP_ID);
-    if (entityIndex !== -1) draft.entities.splice(entityIndex, 1);
-
-    const positionIndex = draft.positions.findIndex((boardId) => boardId === TEMP_ID);
-    if (positionIndex !== -1) draft.positions.splice(positionIndex, 1);
-  }));
+  .addCase(BoardsActions.removeTemp, (draft) => {}));
 

[Killed] ConditionalExpression
src/store/reducers/boards.ts:71:61
     draft.positions.splice(positionIndex + 1, 0, TEMP_ID);
   })
   .addCase(BoardsActions.removeTemp, (draft) => {
-    const entityIndex = draft.entities.findIndex((board) => board.id === TEMP_ID);
+    const entityIndex = draft.entities.findIndex((board) => true);
     if (entityIndex !== -1) draft.entities.splice(entityIndex, 1);
 

[Killed] ArrowFunction
src/store/reducers/boards.ts:71:50
     draft.positions.splice(positionIndex + 1, 0, TEMP_ID);
   })
   .addCase(BoardsActions.removeTemp, (draft) => {
-    const entityIndex = draft.entities.findIndex((board) => board.id === TEMP_ID);
+    const entityIndex = draft.entities.findIndex(() => undefined);
     if (entityIndex !== -1) draft.entities.splice(entityIndex, 1);
 

[Killed] ConditionalExpression
src/store/reducers/boards.ts:72:9
   })
   .addCase(BoardsActions.removeTemp, (draft) => {
     const entityIndex = draft.entities.findIndex((board) => board.id === TEMP_ID);
-    if (entityIndex !== -1) draft.entities.splice(entityIndex, 1);
+    if (false) draft.entities.splice(entityIndex, 1);
 
     const positionIndex = draft.positions.findIndex((boardId) => boardId === TEMP_ID);

[Killed] EqualityOperator
src/store/reducers/boards.ts:72:9
   })
   .addCase(BoardsActions.removeTemp, (draft) => {
     const entityIndex = draft.entities.findIndex((board) => board.id === TEMP_ID);
-    if (entityIndex !== -1) draft.entities.splice(entityIndex, 1);
+    if (entityIndex === -1) draft.entities.splice(entityIndex, 1);
 
     const positionIndex = draft.positions.findIndex((boardId) => boardId === TEMP_ID);

[Killed] ConditionalExpression
src/store/reducers/boards.ts:74:66
     const entityIndex = draft.entities.findIndex((board) => board.id === TEMP_ID);
     if (entityIndex !== -1) draft.entities.splice(entityIndex, 1);
 
-    const positionIndex = draft.positions.findIndex((boardId) => boardId === TEMP_ID);
+    const positionIndex = draft.positions.findIndex((boardId) => false);
     if (positionIndex !== -1) draft.positions.splice(positionIndex, 1);
   }));

[Killed] ConditionalExpression
src/store/reducers/boards.ts:74:66
     const entityIndex = draft.entities.findIndex((board) => board.id === TEMP_ID);
     if (entityIndex !== -1) draft.entities.splice(entityIndex, 1);
 
-    const positionIndex = draft.positions.findIndex((boardId) => boardId === TEMP_ID);
+    const positionIndex = draft.positions.findIndex((boardId) => true);
     if (positionIndex !== -1) draft.positions.splice(positionIndex, 1);
   }));

[Killed] ConditionalExpression
src/store/reducers/boards.ts:75:9
     if (entityIndex !== -1) draft.entities.splice(entityIndex, 1);
 
     const positionIndex = draft.positions.findIndex((boardId) => boardId === TEMP_ID);
-    if (positionIndex !== -1) draft.positions.splice(positionIndex, 1);
+    if (false) draft.positions.splice(positionIndex, 1);
   }));
 

[Killed] EqualityOperator
src/store/reducers/boards.ts:75:9
     if (entityIndex !== -1) draft.entities.splice(entityIndex, 1);
 
     const positionIndex = draft.positions.findIndex((boardId) => boardId === TEMP_ID);
-    if (positionIndex !== -1) draft.positions.splice(positionIndex, 1);
+    if (positionIndex === -1) draft.positions.splice(positionIndex, 1);
   }));
 
