[Survived] StringLiteral
src/types/entities/colors.ts:5:3
   '#ff6a56',
   '#fee930',
   '#9cc447',
-  '#32dabc',
+  "",
   '#5fc1e9',
   '#d8d8d8',

[Survived] StringLiteral
src/types/entities/colors.ts:6:3
   '#fee930',
   '#9cc447',
   '#32dabc',
-  '#5fc1e9',
+  "",
   '#d8d8d8',
 ];
